/* automatically generated by rust-bindgen 0.71.1 */

pub const _FILE_OFFSET_BITS: u32 = 64;
pub const _LIBC_LIMITS_H_: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __GLIBC_USE_ISOC2X: u32 = 0;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __USE_FILE_OFFSET64: u32 = 1;
pub const __WORDSIZE: u32 = 64;
pub const __WORDSIZE_TIME64_COMPAT32: u32 = 1;
pub const __SYSCALL_WORDSIZE: u32 = 64;
pub const __TIMESIZE: u32 = 64;
pub const __USE_MISC: u32 = 1;
pub const __USE_ATFILE: u32 = 1;
pub const __USE_FORTIFY_LEVEL: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_SCANF: u32 = 0;
pub const __GLIBC_USE_C2X_STRTOL: u32 = 0;
pub const _STDC_PREDEF_H: u32 = 1;
pub const __STDC_IEC_559__: u32 = 1;
pub const __STDC_IEC_60559_BFP__: u32 = 201404;
pub const __STDC_IEC_559_COMPLEX__: u32 = 1;
pub const __STDC_IEC_60559_COMPLEX__: u32 = 201404;
pub const __STDC_ISO_10646__: u32 = 201706;
pub const __GNU_LIBRARY__: u32 = 6;
pub const __GLIBC__: u32 = 2;
pub const __GLIBC_MINOR__: u32 = 39;

        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn memccpy(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn memset(
        __s: *mut ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn memcmp(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __memcmpeq(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn memchr(
        __s: *const ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn strcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strcat(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strncat(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strcmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strncmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strcoll(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strxfrm(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_ulong;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_struct {
    pub __locales: [*mut __locale_data; 13usize],
    pub __ctype_b: *const ::std::os::raw::c_ushort,
    pub __ctype_tolower: *const ::std::os::raw::c_int,
    pub __ctype_toupper: *const ::std::os::raw::c_int,
    pub __names: [*const ::std::os::raw::c_char; 13usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __locale_struct"][::std::mem::size_of::<__locale_struct>() - 232usize];
    ["Alignment of __locale_struct"][::std::mem::align_of::<__locale_struct>() - 8usize];
    ["Offset of field: __locale_struct::__locales"]
        [::std::mem::offset_of!(__locale_struct, __locales) - 0usize];
    ["Offset of field: __locale_struct::__ctype_b"]
        [::std::mem::offset_of!(__locale_struct, __ctype_b) - 104usize];
    ["Offset of field: __locale_struct::__ctype_tolower"]
        [::std::mem::offset_of!(__locale_struct, __ctype_tolower) - 112usize];
    ["Offset of field: __locale_struct::__ctype_toupper"]
        [::std::mem::offset_of!(__locale_struct, __ctype_toupper) - 120usize];
    ["Offset of field: __locale_struct::__names"]
        [::std::mem::offset_of!(__locale_struct, __names) - 128usize];
};
pub type __locale_t = *mut __locale_struct;
pub type locale_t = __locale_t;
unsafe extern "C" {
    pub fn strcoll_l(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __l: locale_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strxfrm_l(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: usize,
        __l: locale_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn strdup(__s: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strndup(
        __string: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strchr(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strrchr(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strchrnul(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strcspn(
        __s: *const ::std::os::raw::c_char,
        __reject: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn strspn(
        __s: *const ::std::os::raw::c_char,
        __accept: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn strpbrk(
        __s: *const ::std::os::raw::c_char,
        __accept: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strstr(
        __haystack: *const ::std::os::raw::c_char,
        __needle: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strtok(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn __strtok_r(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
        __save_ptr: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strtok_r(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
        __save_ptr: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strcasestr(
        __haystack: *const ::std::os::raw::c_char,
        __needle: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn memmem(
        __haystack: *const ::std::os::raw::c_void,
        __haystacklen: usize,
        __needle: *const ::std::os::raw::c_void,
        __needlelen: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn __mempcpy(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __n: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn mempcpy(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn strlen(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn strnlen(__string: *const ::std::os::raw::c_char, __maxlen: usize) -> usize;
}
unsafe extern "C" {
    pub fn strerror(__errnum: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    #[link_name = "\u{1}__xpg_strerror_r"]
    pub fn strerror_r(
        __errnum: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __buflen: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strerror_l(
        __errnum: ::std::os::raw::c_int,
        __l: locale_t,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn bcmp(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn bcopy(
        __src: *const ::std::os::raw::c_void,
        __dest: *mut ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    );
}
unsafe extern "C" {
    pub fn bzero(__s: *mut ::std::os::raw::c_void, __n: ::std::os::raw::c_ulong);
}
unsafe extern "C" {
    pub fn index(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn rindex(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ffs(__i: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ffsl(__l: ::std::os::raw::c_long) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ffsll(__ll: ::std::os::raw::c_longlong) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strcasecmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strncasecmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strcasecmp_l(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __loc: locale_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strncasecmp_l(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: usize,
        __loc: locale_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn explicit_bzero(__s: *mut ::std::os::raw::c_void, __n: usize);
}
unsafe extern "C" {
    pub fn strsep(
        __stringp: *mut *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strsignal(__sig: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn __stpcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn stpcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn __stpncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn stpncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strlcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> usize;
}
unsafe extern "C" {
    pub fn strlcat(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> usize;
}
pub type __gnuc_va_list = __builtin_va_list;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __fsid_t"][::std::mem::size_of::<__fsid_t>() - 8usize];
    ["Alignment of __fsid_t"][::std::mem::align_of::<__fsid_t>() - 4usize];
    ["Offset of field: __fsid_t::__val"][::std::mem::offset_of!(__fsid_t, __val) - 0usize];
};
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __mbstate_t {
    pub __count: ::std::os::raw::c_int,
    pub __value: __mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t__bindgen_ty_1 {
    pub __wch: ::std::os::raw::c_uint,
    pub __wchb: [::std::os::raw::c_char; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __mbstate_t__bindgen_ty_1"]
        [::std::mem::size_of::<__mbstate_t__bindgen_ty_1>() - 4usize];
    ["Alignment of __mbstate_t__bindgen_ty_1"]
        [::std::mem::align_of::<__mbstate_t__bindgen_ty_1>() - 4usize];
    ["Offset of field: __mbstate_t__bindgen_ty_1::__wch"]
        [::std::mem::offset_of!(__mbstate_t__bindgen_ty_1, __wch) - 0usize];
    ["Offset of field: __mbstate_t__bindgen_ty_1::__wchb"]
        [::std::mem::offset_of!(__mbstate_t__bindgen_ty_1, __wchb) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __mbstate_t"][::std::mem::size_of::<__mbstate_t>() - 8usize];
    ["Alignment of __mbstate_t"][::std::mem::align_of::<__mbstate_t>() - 4usize];
    ["Offset of field: __mbstate_t::__count"]
        [::std::mem::offset_of!(__mbstate_t, __count) - 0usize];
    ["Offset of field: __mbstate_t::__value"]
        [::std::mem::offset_of!(__mbstate_t, __value) - 4usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos_t {
    pub __pos: __off_t,
    pub __state: __mbstate_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _G_fpos_t"][::std::mem::size_of::<_G_fpos_t>() - 16usize];
    ["Alignment of _G_fpos_t"][::std::mem::align_of::<_G_fpos_t>() - 8usize];
    ["Offset of field: _G_fpos_t::__pos"][::std::mem::offset_of!(_G_fpos_t, __pos) - 0usize];
    ["Offset of field: _G_fpos_t::__state"][::std::mem::offset_of!(_G_fpos_t, __state) - 8usize];
};
pub type __fpos_t = _G_fpos_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos64_t {
    pub __pos: __off64_t,
    pub __state: __mbstate_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _G_fpos64_t"][::std::mem::size_of::<_G_fpos64_t>() - 16usize];
    ["Alignment of _G_fpos64_t"][::std::mem::align_of::<_G_fpos64_t>() - 8usize];
    ["Offset of field: _G_fpos64_t::__pos"][::std::mem::offset_of!(_G_fpos64_t, __pos) - 0usize];
    ["Offset of field: _G_fpos64_t::__state"]
        [::std::mem::offset_of!(_G_fpos64_t, __state) - 8usize];
};
pub type __fpos64_t = _G_fpos64_t;
pub type __FILE = _IO_FILE;
pub type FILE = _IO_FILE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_codecvt {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_wide_data {
    _unused: [u8; 0],
}
pub type _IO_lock_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
    pub _flags: ::std::os::raw::c_int,
    pub _IO_read_ptr: *mut ::std::os::raw::c_char,
    pub _IO_read_end: *mut ::std::os::raw::c_char,
    pub _IO_read_base: *mut ::std::os::raw::c_char,
    pub _IO_write_base: *mut ::std::os::raw::c_char,
    pub _IO_write_ptr: *mut ::std::os::raw::c_char,
    pub _IO_write_end: *mut ::std::os::raw::c_char,
    pub _IO_buf_base: *mut ::std::os::raw::c_char,
    pub _IO_buf_end: *mut ::std::os::raw::c_char,
    pub _IO_save_base: *mut ::std::os::raw::c_char,
    pub _IO_backup_base: *mut ::std::os::raw::c_char,
    pub _IO_save_end: *mut ::std::os::raw::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::std::os::raw::c_int,
    pub _flags2: ::std::os::raw::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: ::std::os::raw::c_ushort,
    pub _vtable_offset: ::std::os::raw::c_schar,
    pub _shortbuf: [::std::os::raw::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub _codecvt: *mut _IO_codecvt,
    pub _wide_data: *mut _IO_wide_data,
    pub _freeres_list: *mut _IO_FILE,
    pub _freeres_buf: *mut ::std::os::raw::c_void,
    pub __pad5: usize,
    pub _mode: ::std::os::raw::c_int,
    pub _unused2: [::std::os::raw::c_char; 20usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IO_FILE"][::std::mem::size_of::<_IO_FILE>() - 216usize];
    ["Alignment of _IO_FILE"][::std::mem::align_of::<_IO_FILE>() - 8usize];
    ["Offset of field: _IO_FILE::_flags"][::std::mem::offset_of!(_IO_FILE, _flags) - 0usize];
    ["Offset of field: _IO_FILE::_IO_read_ptr"]
        [::std::mem::offset_of!(_IO_FILE, _IO_read_ptr) - 8usize];
    ["Offset of field: _IO_FILE::_IO_read_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_read_end) - 16usize];
    ["Offset of field: _IO_FILE::_IO_read_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_read_base) - 24usize];
    ["Offset of field: _IO_FILE::_IO_write_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_write_base) - 32usize];
    ["Offset of field: _IO_FILE::_IO_write_ptr"]
        [::std::mem::offset_of!(_IO_FILE, _IO_write_ptr) - 40usize];
    ["Offset of field: _IO_FILE::_IO_write_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_write_end) - 48usize];
    ["Offset of field: _IO_FILE::_IO_buf_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_buf_base) - 56usize];
    ["Offset of field: _IO_FILE::_IO_buf_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_buf_end) - 64usize];
    ["Offset of field: _IO_FILE::_IO_save_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_save_base) - 72usize];
    ["Offset of field: _IO_FILE::_IO_backup_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_backup_base) - 80usize];
    ["Offset of field: _IO_FILE::_IO_save_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_save_end) - 88usize];
    ["Offset of field: _IO_FILE::_markers"][::std::mem::offset_of!(_IO_FILE, _markers) - 96usize];
    ["Offset of field: _IO_FILE::_chain"][::std::mem::offset_of!(_IO_FILE, _chain) - 104usize];
    ["Offset of field: _IO_FILE::_fileno"][::std::mem::offset_of!(_IO_FILE, _fileno) - 112usize];
    ["Offset of field: _IO_FILE::_flags2"][::std::mem::offset_of!(_IO_FILE, _flags2) - 116usize];
    ["Offset of field: _IO_FILE::_old_offset"]
        [::std::mem::offset_of!(_IO_FILE, _old_offset) - 120usize];
    ["Offset of field: _IO_FILE::_cur_column"]
        [::std::mem::offset_of!(_IO_FILE, _cur_column) - 128usize];
    ["Offset of field: _IO_FILE::_vtable_offset"]
        [::std::mem::offset_of!(_IO_FILE, _vtable_offset) - 130usize];
    ["Offset of field: _IO_FILE::_shortbuf"]
        [::std::mem::offset_of!(_IO_FILE, _shortbuf) - 131usize];
    ["Offset of field: _IO_FILE::_lock"][::std::mem::offset_of!(_IO_FILE, _lock) - 136usize];
    ["Offset of field: _IO_FILE::_offset"][::std::mem::offset_of!(_IO_FILE, _offset) - 144usize];
    ["Offset of field: _IO_FILE::_codecvt"][::std::mem::offset_of!(_IO_FILE, _codecvt) - 152usize];
    ["Offset of field: _IO_FILE::_wide_data"]
        [::std::mem::offset_of!(_IO_FILE, _wide_data) - 160usize];
    ["Offset of field: _IO_FILE::_freeres_list"]
        [::std::mem::offset_of!(_IO_FILE, _freeres_list) - 168usize];
    ["Offset of field: _IO_FILE::_freeres_buf"]
        [::std::mem::offset_of!(_IO_FILE, _freeres_buf) - 176usize];
    ["Offset of field: _IO_FILE::__pad5"][::std::mem::offset_of!(_IO_FILE, __pad5) - 184usize];
    ["Offset of field: _IO_FILE::_mode"][::std::mem::offset_of!(_IO_FILE, _mode) - 192usize];
    ["Offset of field: _IO_FILE::_unused2"][::std::mem::offset_of!(_IO_FILE, _unused2) - 196usize];
};
pub type cookie_read_function_t = ::std::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut ::std::os::raw::c_void,
        __buf: *mut ::std::os::raw::c_char,
        __nbytes: usize,
    ) -> __ssize_t,
>;
pub type cookie_write_function_t = ::std::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut ::std::os::raw::c_void,
        __buf: *const ::std::os::raw::c_char,
        __nbytes: usize,
    ) -> __ssize_t,
>;
pub type cookie_seek_function_t = ::std::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut ::std::os::raw::c_void,
        __pos: *mut __off64_t,
        __w: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type cookie_close_function_t = ::std::option::Option<
    unsafe extern "C" fn(__cookie: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_cookie_io_functions_t {
    pub read: cookie_read_function_t,
    pub write: cookie_write_function_t,
    pub seek: cookie_seek_function_t,
    pub close: cookie_close_function_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IO_cookie_io_functions_t"]
        [::std::mem::size_of::<_IO_cookie_io_functions_t>() - 32usize];
    ["Alignment of _IO_cookie_io_functions_t"]
        [::std::mem::align_of::<_IO_cookie_io_functions_t>() - 8usize];
    ["Offset of field: _IO_cookie_io_functions_t::read"]
        [::std::mem::offset_of!(_IO_cookie_io_functions_t, read) - 0usize];
    ["Offset of field: _IO_cookie_io_functions_t::write"]
        [::std::mem::offset_of!(_IO_cookie_io_functions_t, write) - 8usize];
    ["Offset of field: _IO_cookie_io_functions_t::seek"]
        [::std::mem::offset_of!(_IO_cookie_io_functions_t, seek) - 16usize];
    ["Offset of field: _IO_cookie_io_functions_t::close"]
        [::std::mem::offset_of!(_IO_cookie_io_functions_t, close) - 24usize];
};
pub type cookie_io_functions_t = _IO_cookie_io_functions_t;
pub type va_list = __gnuc_va_list;
pub type off_t = __off64_t;
pub type fpos_t = __fpos64_t;
unsafe extern "C" {
    pub static mut stdin: *mut FILE;
}
unsafe extern "C" {
    pub static mut stdout: *mut FILE;
}
unsafe extern "C" {
    pub static mut stderr: *mut FILE;
}
unsafe extern "C" {
    pub fn remove(__filename: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn rename(
        __old: *const ::std::os::raw::c_char,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn renameat(
        __oldfd: ::std::os::raw::c_int,
        __old: *const ::std::os::raw::c_char,
        __newfd: ::std::os::raw::c_int,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}tmpfile64"]
    pub fn tmpfile() -> *mut FILE;
}
unsafe extern "C" {
    pub fn tmpnam(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn tmpnam_r(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn tempnam(
        __dir: *const ::std::os::raw::c_char,
        __pfx: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn fflush(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fflush_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}fopen64"]
    pub fn fopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    #[link_name = "\u{1}freopen64"]
    pub fn freopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
        __stream: *mut FILE,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn fdopen(__fd: ::std::os::raw::c_int, __modes: *const ::std::os::raw::c_char)
        -> *mut FILE;
}
unsafe extern "C" {
    pub fn fopencookie(
        __magic_cookie: *mut ::std::os::raw::c_void,
        __modes: *const ::std::os::raw::c_char,
        __io_funcs: cookie_io_functions_t,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn fmemopen(
        __s: *mut ::std::os::raw::c_void,
        __len: usize,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn open_memstream(
        __bufloc: *mut *mut ::std::os::raw::c_char,
        __sizeloc: *mut usize,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn setbuf(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn setvbuf(
        __stream: *mut FILE,
        __buf: *mut ::std::os::raw::c_char,
        __modes: ::std::os::raw::c_int,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setbuffer(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char, __size: usize);
}
unsafe extern "C" {
    pub fn setlinebuf(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn fprintf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn printf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vfprintf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vprintf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vsprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn snprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vsnprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vasprintf(
        __ptr: *mut *mut ::std::os::raw::c_char,
        __f: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __asprintf(
        __ptr: *mut *mut ::std::os::raw::c_char,
        __fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn asprintf(
        __ptr: *mut *mut ::std::os::raw::c_char,
        __fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vdprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn dprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fscanf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn scanf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
pub type _Float32 = f32;
pub type _Float64 = f64;
pub type _Float32x = f64;
pub type _Float64x = u128;
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_fscanf"]
    pub fn fscanf1(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_scanf"]
    pub fn scanf1(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_sscanf"]
    pub fn sscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vfscanf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vscanf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vsscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_vfscanf"]
    pub fn vfscanf1(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_vscanf"]
    pub fn vscanf1(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_vsscanf"]
    pub fn vsscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fgetc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getchar() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getchar_unlocked() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fgetc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fputc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putchar(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fputc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE)
        -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putchar_unlocked(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getw(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putw(__w: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fgets(
        __s: *mut ::std::os::raw::c_char,
        __n: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn __getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
unsafe extern "C" {
    pub fn getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
unsafe extern "C" {
    pub fn getline(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
unsafe extern "C" {
    pub fn fputs(__s: *const ::std::os::raw::c_char, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn puts(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ungetc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fread(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __n: ::std::os::raw::c_ulong,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn fwrite(
        __ptr: *const ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __n: ::std::os::raw::c_ulong,
        __s: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn fread_unlocked(
        __ptr: *mut ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
unsafe extern "C" {
    pub fn fwrite_unlocked(
        __ptr: *const ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
unsafe extern "C" {
    pub fn fseek(
        __stream: *mut FILE,
        __off: ::std::os::raw::c_long,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ftell(__stream: *mut FILE) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn rewind(__stream: *mut FILE);
}
unsafe extern "C" {
    #[link_name = "\u{1}fseeko64"]
    pub fn fseeko(
        __stream: *mut FILE,
        __off: __off64_t,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}ftello64"]
    pub fn ftello(__stream: *mut FILE) -> __off64_t;
}
unsafe extern "C" {
    #[link_name = "\u{1}fgetpos64"]
    pub fn fgetpos(__stream: *mut FILE, __pos: *mut fpos_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}fsetpos64"]
    pub fn fsetpos(__stream: *mut FILE, __pos: *const fpos_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clearerr(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn feof(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ferror(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clearerr_unlocked(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn feof_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ferror_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn perror(__s: *const ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn fileno(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fileno_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn popen(
        __command: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn ctermid(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn flockfile(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn ftrylockfile(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn funlockfile(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn __uflow(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __overflow(arg1: *mut FILE, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct div_t {
    pub quot: ::std::os::raw::c_int,
    pub rem: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of div_t"][::std::mem::size_of::<div_t>() - 8usize];
    ["Alignment of div_t"][::std::mem::align_of::<div_t>() - 4usize];
    ["Offset of field: div_t::quot"][::std::mem::offset_of!(div_t, quot) - 0usize];
    ["Offset of field: div_t::rem"][::std::mem::offset_of!(div_t, rem) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ldiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ldiv_t"][::std::mem::size_of::<ldiv_t>() - 16usize];
    ["Alignment of ldiv_t"][::std::mem::align_of::<ldiv_t>() - 8usize];
    ["Offset of field: ldiv_t::quot"][::std::mem::offset_of!(ldiv_t, quot) - 0usize];
    ["Offset of field: ldiv_t::rem"][::std::mem::offset_of!(ldiv_t, rem) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lldiv_t {
    pub quot: ::std::os::raw::c_longlong,
    pub rem: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lldiv_t"][::std::mem::size_of::<lldiv_t>() - 16usize];
    ["Alignment of lldiv_t"][::std::mem::align_of::<lldiv_t>() - 8usize];
    ["Offset of field: lldiv_t::quot"][::std::mem::offset_of!(lldiv_t, quot) - 0usize];
    ["Offset of field: lldiv_t::rem"][::std::mem::offset_of!(lldiv_t, rem) - 8usize];
};
unsafe extern "C" {
    pub fn __ctype_get_mb_cur_max() -> usize;
}
unsafe extern "C" {
    pub fn atof(__nptr: *const ::std::os::raw::c_char) -> f64;
}
unsafe extern "C" {
    pub fn atoi(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn atol(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn atoll(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn strtod(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f64;
}
unsafe extern "C" {
    pub fn strtof(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f32;
}
unsafe extern "C" {
    pub fn strtold(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> u128;
}
unsafe extern "C" {
    pub fn strtol(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn strtoul(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn strtoq(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn strtouq(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub fn strtoll(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn strtoull(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub fn l64a(__n: ::std::os::raw::c_long) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn a64l(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino64_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type clockid_t = __clockid_t;
pub type time_t = __time_t;
pub type timer_t = __timer_t;
pub type ulong = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type register_t = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sigset_t"][::std::mem::size_of::<__sigset_t>() - 128usize];
    ["Alignment of __sigset_t"][::std::mem::align_of::<__sigset_t>() - 8usize];
    ["Offset of field: __sigset_t::__val"][::std::mem::offset_of!(__sigset_t, __val) - 0usize];
};
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timeval"][::std::mem::size_of::<timeval>() - 16usize];
    ["Alignment of timeval"][::std::mem::align_of::<timeval>() - 8usize];
    ["Offset of field: timeval::tv_sec"][::std::mem::offset_of!(timeval, tv_sec) - 0usize];
    ["Offset of field: timeval::tv_usec"][::std::mem::offset_of!(timeval, tv_usec) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timespec"][::std::mem::size_of::<timespec>() - 16usize];
    ["Alignment of timespec"][::std::mem::align_of::<timespec>() - 8usize];
    ["Offset of field: timespec::tv_sec"][::std::mem::offset_of!(timespec, tv_sec) - 0usize];
    ["Offset of field: timespec::tv_nsec"][::std::mem::offset_of!(timespec, tv_nsec) - 8usize];
};
pub type suseconds_t = __suseconds_t;
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fd_set"][::std::mem::size_of::<fd_set>() - 128usize];
    ["Alignment of fd_set"][::std::mem::align_of::<fd_set>() - 8usize];
    ["Offset of field: fd_set::__fds_bits"][::std::mem::offset_of!(fd_set, __fds_bits) - 0usize];
};
pub type fd_mask = __fd_mask;
unsafe extern "C" {
    pub fn select(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *mut timeval,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pselect(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *const timespec,
        __sigmask: *const __sigset_t,
    ) -> ::std::os::raw::c_int;
}
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt64_t;
pub type fsblkcnt_t = __fsblkcnt64_t;
pub type fsfilcnt_t = __fsfilcnt64_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __atomic_wide_counter {
    pub __value64: ::std::os::raw::c_ulonglong,
    pub __value32: __atomic_wide_counter__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __atomic_wide_counter__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __atomic_wide_counter__bindgen_ty_1"]
        [::std::mem::size_of::<__atomic_wide_counter__bindgen_ty_1>() - 8usize];
    ["Alignment of __atomic_wide_counter__bindgen_ty_1"]
        [::std::mem::align_of::<__atomic_wide_counter__bindgen_ty_1>() - 4usize];
    ["Offset of field: __atomic_wide_counter__bindgen_ty_1::__low"]
        [::std::mem::offset_of!(__atomic_wide_counter__bindgen_ty_1, __low) - 0usize];
    ["Offset of field: __atomic_wide_counter__bindgen_ty_1::__high"]
        [::std::mem::offset_of!(__atomic_wide_counter__bindgen_ty_1, __high) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __atomic_wide_counter"][::std::mem::size_of::<__atomic_wide_counter>() - 8usize];
    ["Alignment of __atomic_wide_counter"]
        [::std::mem::align_of::<__atomic_wide_counter>() - 8usize];
    ["Offset of field: __atomic_wide_counter::__value64"]
        [::std::mem::offset_of!(__atomic_wide_counter, __value64) - 0usize];
    ["Offset of field: __atomic_wide_counter::__value32"]
        [::std::mem::offset_of!(__atomic_wide_counter, __value32) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_internal_list"][::std::mem::size_of::<__pthread_internal_list>() - 16usize];
    ["Alignment of __pthread_internal_list"]
        [::std::mem::align_of::<__pthread_internal_list>() - 8usize];
    ["Offset of field: __pthread_internal_list::__prev"]
        [::std::mem::offset_of!(__pthread_internal_list, __prev) - 0usize];
    ["Offset of field: __pthread_internal_list::__next"]
        [::std::mem::offset_of!(__pthread_internal_list, __next) - 8usize];
};
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_slist {
    pub __next: *mut __pthread_internal_slist,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_internal_slist"]
        [::std::mem::size_of::<__pthread_internal_slist>() - 8usize];
    ["Alignment of __pthread_internal_slist"]
        [::std::mem::align_of::<__pthread_internal_slist>() - 8usize];
    ["Offset of field: __pthread_internal_slist::__next"]
        [::std::mem::offset_of!(__pthread_internal_slist, __next) - 0usize];
};
pub type __pthread_slist_t = __pthread_internal_slist;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_short,
    pub __elision: ::std::os::raw::c_short,
    pub __list: __pthread_list_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_mutex_s"][::std::mem::size_of::<__pthread_mutex_s>() - 40usize];
    ["Alignment of __pthread_mutex_s"][::std::mem::align_of::<__pthread_mutex_s>() - 8usize];
    ["Offset of field: __pthread_mutex_s::__lock"]
        [::std::mem::offset_of!(__pthread_mutex_s, __lock) - 0usize];
    ["Offset of field: __pthread_mutex_s::__count"]
        [::std::mem::offset_of!(__pthread_mutex_s, __count) - 4usize];
    ["Offset of field: __pthread_mutex_s::__owner"]
        [::std::mem::offset_of!(__pthread_mutex_s, __owner) - 8usize];
    ["Offset of field: __pthread_mutex_s::__nusers"]
        [::std::mem::offset_of!(__pthread_mutex_s, __nusers) - 12usize];
    ["Offset of field: __pthread_mutex_s::__kind"]
        [::std::mem::offset_of!(__pthread_mutex_s, __kind) - 16usize];
    ["Offset of field: __pthread_mutex_s::__spins"]
        [::std::mem::offset_of!(__pthread_mutex_s, __spins) - 20usize];
    ["Offset of field: __pthread_mutex_s::__elision"]
        [::std::mem::offset_of!(__pthread_mutex_s, __elision) - 22usize];
    ["Offset of field: __pthread_mutex_s::__list"]
        [::std::mem::offset_of!(__pthread_mutex_s, __list) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: ::std::os::raw::c_uint,
    pub __writers: ::std::os::raw::c_uint,
    pub __wrphase_futex: ::std::os::raw::c_uint,
    pub __writers_futex: ::std::os::raw::c_uint,
    pub __pad3: ::std::os::raw::c_uint,
    pub __pad4: ::std::os::raw::c_uint,
    pub __cur_writer: ::std::os::raw::c_int,
    pub __shared: ::std::os::raw::c_int,
    pub __rwelision: ::std::os::raw::c_schar,
    pub __pad1: [::std::os::raw::c_uchar; 7usize],
    pub __pad2: ::std::os::raw::c_ulong,
    pub __flags: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_rwlock_arch_t"][::std::mem::size_of::<__pthread_rwlock_arch_t>() - 56usize];
    ["Alignment of __pthread_rwlock_arch_t"]
        [::std::mem::align_of::<__pthread_rwlock_arch_t>() - 8usize];
    ["Offset of field: __pthread_rwlock_arch_t::__readers"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __readers) - 0usize];
    ["Offset of field: __pthread_rwlock_arch_t::__writers"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __writers) - 4usize];
    ["Offset of field: __pthread_rwlock_arch_t::__wrphase_futex"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __wrphase_futex) - 8usize];
    ["Offset of field: __pthread_rwlock_arch_t::__writers_futex"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __writers_futex) - 12usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad3"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad3) - 16usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad4"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad4) - 20usize];
    ["Offset of field: __pthread_rwlock_arch_t::__cur_writer"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __cur_writer) - 24usize];
    ["Offset of field: __pthread_rwlock_arch_t::__shared"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __shared) - 28usize];
    ["Offset of field: __pthread_rwlock_arch_t::__rwelision"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __rwelision) - 32usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad1"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad1) - 33usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad2"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad2) - 40usize];
    ["Offset of field: __pthread_rwlock_arch_t::__flags"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __flags) - 48usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __wseq: __atomic_wide_counter,
    pub __g1_start: __atomic_wide_counter,
    pub __g_refs: [::std::os::raw::c_uint; 2usize],
    pub __g_size: [::std::os::raw::c_uint; 2usize],
    pub __g1_orig_size: ::std::os::raw::c_uint,
    pub __wrefs: ::std::os::raw::c_uint,
    pub __g_signals: [::std::os::raw::c_uint; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_cond_s"][::std::mem::size_of::<__pthread_cond_s>() - 48usize];
    ["Alignment of __pthread_cond_s"][::std::mem::align_of::<__pthread_cond_s>() - 8usize];
    ["Offset of field: __pthread_cond_s::__wseq"]
        [::std::mem::offset_of!(__pthread_cond_s, __wseq) - 0usize];
    ["Offset of field: __pthread_cond_s::__g1_start"]
        [::std::mem::offset_of!(__pthread_cond_s, __g1_start) - 8usize];
    ["Offset of field: __pthread_cond_s::__g_refs"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_refs) - 16usize];
    ["Offset of field: __pthread_cond_s::__g_size"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_size) - 24usize];
    ["Offset of field: __pthread_cond_s::__g1_orig_size"]
        [::std::mem::offset_of!(__pthread_cond_s, __g1_orig_size) - 32usize];
    ["Offset of field: __pthread_cond_s::__wrefs"]
        [::std::mem::offset_of!(__pthread_cond_s, __wrefs) - 36usize];
    ["Offset of field: __pthread_cond_s::__g_signals"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_signals) - 40usize];
};
pub type __tss_t = ::std::os::raw::c_uint;
pub type __thrd_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __once_flag {
    pub __data: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __once_flag"][::std::mem::size_of::<__once_flag>() - 4usize];
    ["Alignment of __once_flag"][::std::mem::align_of::<__once_flag>() - 4usize];
    ["Offset of field: __once_flag::__data"][::std::mem::offset_of!(__once_flag, __data) - 0usize];
};
pub type pthread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_mutexattr_t"][::std::mem::size_of::<pthread_mutexattr_t>() - 4usize];
    ["Alignment of pthread_mutexattr_t"][::std::mem::align_of::<pthread_mutexattr_t>() - 4usize];
    ["Offset of field: pthread_mutexattr_t::__size"]
        [::std::mem::offset_of!(pthread_mutexattr_t, __size) - 0usize];
    ["Offset of field: pthread_mutexattr_t::__align"]
        [::std::mem::offset_of!(pthread_mutexattr_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_condattr_t"][::std::mem::size_of::<pthread_condattr_t>() - 4usize];
    ["Alignment of pthread_condattr_t"][::std::mem::align_of::<pthread_condattr_t>() - 4usize];
    ["Offset of field: pthread_condattr_t::__size"]
        [::std::mem::offset_of!(pthread_condattr_t, __size) - 0usize];
    ["Offset of field: pthread_condattr_t::__align"]
        [::std::mem::offset_of!(pthread_condattr_t, __align) - 0usize];
};
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_once_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_attr_t"][::std::mem::size_of::<pthread_attr_t>() - 56usize];
    ["Alignment of pthread_attr_t"][::std::mem::align_of::<pthread_attr_t>() - 8usize];
    ["Offset of field: pthread_attr_t::__size"]
        [::std::mem::offset_of!(pthread_attr_t, __size) - 0usize];
    ["Offset of field: pthread_attr_t::__align"]
        [::std::mem::offset_of!(pthread_attr_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 40usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_mutex_t"][::std::mem::size_of::<pthread_mutex_t>() - 40usize];
    ["Alignment of pthread_mutex_t"][::std::mem::align_of::<pthread_mutex_t>() - 8usize];
    ["Offset of field: pthread_mutex_t::__data"]
        [::std::mem::offset_of!(pthread_mutex_t, __data) - 0usize];
    ["Offset of field: pthread_mutex_t::__size"]
        [::std::mem::offset_of!(pthread_mutex_t, __size) - 0usize];
    ["Offset of field: pthread_mutex_t::__align"]
        [::std::mem::offset_of!(pthread_mutex_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_cond_t"][::std::mem::size_of::<pthread_cond_t>() - 48usize];
    ["Alignment of pthread_cond_t"][::std::mem::align_of::<pthread_cond_t>() - 8usize];
    ["Offset of field: pthread_cond_t::__data"]
        [::std::mem::offset_of!(pthread_cond_t, __data) - 0usize];
    ["Offset of field: pthread_cond_t::__size"]
        [::std::mem::offset_of!(pthread_cond_t, __size) - 0usize];
    ["Offset of field: pthread_cond_t::__align"]
        [::std::mem::offset_of!(pthread_cond_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_rwlock_t"][::std::mem::size_of::<pthread_rwlock_t>() - 56usize];
    ["Alignment of pthread_rwlock_t"][::std::mem::align_of::<pthread_rwlock_t>() - 8usize];
    ["Offset of field: pthread_rwlock_t::__data"]
        [::std::mem::offset_of!(pthread_rwlock_t, __data) - 0usize];
    ["Offset of field: pthread_rwlock_t::__size"]
        [::std::mem::offset_of!(pthread_rwlock_t, __size) - 0usize];
    ["Offset of field: pthread_rwlock_t::__align"]
        [::std::mem::offset_of!(pthread_rwlock_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_rwlockattr_t"][::std::mem::size_of::<pthread_rwlockattr_t>() - 8usize];
    ["Alignment of pthread_rwlockattr_t"][::std::mem::align_of::<pthread_rwlockattr_t>() - 8usize];
    ["Offset of field: pthread_rwlockattr_t::__size"]
        [::std::mem::offset_of!(pthread_rwlockattr_t, __size) - 0usize];
    ["Offset of field: pthread_rwlockattr_t::__align"]
        [::std::mem::offset_of!(pthread_rwlockattr_t, __align) - 0usize];
};
pub type pthread_spinlock_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [::std::os::raw::c_char; 32usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_barrier_t"][::std::mem::size_of::<pthread_barrier_t>() - 32usize];
    ["Alignment of pthread_barrier_t"][::std::mem::align_of::<pthread_barrier_t>() - 8usize];
    ["Offset of field: pthread_barrier_t::__size"]
        [::std::mem::offset_of!(pthread_barrier_t, __size) - 0usize];
    ["Offset of field: pthread_barrier_t::__align"]
        [::std::mem::offset_of!(pthread_barrier_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_barrierattr_t"][::std::mem::size_of::<pthread_barrierattr_t>() - 4usize];
    ["Alignment of pthread_barrierattr_t"]
        [::std::mem::align_of::<pthread_barrierattr_t>() - 4usize];
    ["Offset of field: pthread_barrierattr_t::__size"]
        [::std::mem::offset_of!(pthread_barrierattr_t, __size) - 0usize];
    ["Offset of field: pthread_barrierattr_t::__align"]
        [::std::mem::offset_of!(pthread_barrierattr_t, __align) - 0usize];
};
unsafe extern "C" {
    pub fn random() -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn srandom(__seed: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn initstate(
        __seed: ::std::os::raw::c_uint,
        __statebuf: *mut ::std::os::raw::c_char,
        __statelen: usize,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn setstate(__statebuf: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct random_data {
    pub fptr: *mut i32,
    pub rptr: *mut i32,
    pub state: *mut i32,
    pub rand_type: ::std::os::raw::c_int,
    pub rand_deg: ::std::os::raw::c_int,
    pub rand_sep: ::std::os::raw::c_int,
    pub end_ptr: *mut i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of random_data"][::std::mem::size_of::<random_data>() - 48usize];
    ["Alignment of random_data"][::std::mem::align_of::<random_data>() - 8usize];
    ["Offset of field: random_data::fptr"][::std::mem::offset_of!(random_data, fptr) - 0usize];
    ["Offset of field: random_data::rptr"][::std::mem::offset_of!(random_data, rptr) - 8usize];
    ["Offset of field: random_data::state"][::std::mem::offset_of!(random_data, state) - 16usize];
    ["Offset of field: random_data::rand_type"]
        [::std::mem::offset_of!(random_data, rand_type) - 24usize];
    ["Offset of field: random_data::rand_deg"]
        [::std::mem::offset_of!(random_data, rand_deg) - 28usize];
    ["Offset of field: random_data::rand_sep"]
        [::std::mem::offset_of!(random_data, rand_sep) - 32usize];
    ["Offset of field: random_data::end_ptr"]
        [::std::mem::offset_of!(random_data, end_ptr) - 40usize];
};
unsafe extern "C" {
    pub fn random_r(__buf: *mut random_data, __result: *mut i32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn srandom_r(
        __seed: ::std::os::raw::c_uint,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn initstate_r(
        __seed: ::std::os::raw::c_uint,
        __statebuf: *mut ::std::os::raw::c_char,
        __statelen: usize,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setstate_r(
        __statebuf: *mut ::std::os::raw::c_char,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn rand() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn srand(__seed: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn rand_r(__seed: *mut ::std::os::raw::c_uint) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn drand48() -> f64;
}
unsafe extern "C" {
    pub fn erand48(__xsubi: *mut ::std::os::raw::c_ushort) -> f64;
}
unsafe extern "C" {
    pub fn lrand48() -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn nrand48(__xsubi: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn mrand48() -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn jrand48(__xsubi: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn srand48(__seedval: ::std::os::raw::c_long);
}
unsafe extern "C" {
    pub fn seed48(__seed16v: *mut ::std::os::raw::c_ushort) -> *mut ::std::os::raw::c_ushort;
}
unsafe extern "C" {
    pub fn lcong48(__param: *mut ::std::os::raw::c_ushort);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct drand48_data {
    pub __x: [::std::os::raw::c_ushort; 3usize],
    pub __old_x: [::std::os::raw::c_ushort; 3usize],
    pub __c: ::std::os::raw::c_ushort,
    pub __init: ::std::os::raw::c_ushort,
    pub __a: ::std::os::raw::c_ulonglong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of drand48_data"][::std::mem::size_of::<drand48_data>() - 24usize];
    ["Alignment of drand48_data"][::std::mem::align_of::<drand48_data>() - 8usize];
    ["Offset of field: drand48_data::__x"][::std::mem::offset_of!(drand48_data, __x) - 0usize];
    ["Offset of field: drand48_data::__old_x"]
        [::std::mem::offset_of!(drand48_data, __old_x) - 6usize];
    ["Offset of field: drand48_data::__c"][::std::mem::offset_of!(drand48_data, __c) - 12usize];
    ["Offset of field: drand48_data::__init"]
        [::std::mem::offset_of!(drand48_data, __init) - 14usize];
    ["Offset of field: drand48_data::__a"][::std::mem::offset_of!(drand48_data, __a) - 16usize];
};
unsafe extern "C" {
    pub fn drand48_r(__buffer: *mut drand48_data, __result: *mut f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn erand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nrand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn jrand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn srand48_r(
        __seedval: ::std::os::raw::c_long,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn seed48_r(
        __seed16v: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lcong48_r(
        __param: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn arc4random() -> __uint32_t;
}
unsafe extern "C" {
    pub fn arc4random_buf(__buf: *mut ::std::os::raw::c_void, __size: usize);
}
unsafe extern "C" {
    pub fn arc4random_uniform(__upper_bound: __uint32_t) -> __uint32_t;
}
unsafe extern "C" {
    pub fn malloc(__size: ::std::os::raw::c_ulong) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn calloc(
        __nmemb: ::std::os::raw::c_ulong,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn realloc(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn free(__ptr: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn reallocarray(
        __ptr: *mut ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn alloca(__size: ::std::os::raw::c_ulong) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn valloc(__size: usize) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn posix_memalign(
        __memptr: *mut *mut ::std::os::raw::c_void,
        __alignment: usize,
        __size: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aligned_alloc(
        __alignment: ::std::os::raw::c_ulong,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn abort() -> !;
}
unsafe extern "C" {
    pub fn atexit(__func: ::std::option::Option<unsafe extern "C" fn()>) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn at_quick_exit(
        __func: ::std::option::Option<unsafe extern "C" fn()>,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn on_exit(
        __func: ::std::option::Option<
            unsafe extern "C" fn(
                __status: ::std::os::raw::c_int,
                __arg: *mut ::std::os::raw::c_void,
            ),
        >,
        __arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn exit(__status: ::std::os::raw::c_int) -> !;
}
unsafe extern "C" {
    pub fn quick_exit(__status: ::std::os::raw::c_int) -> !;
}
unsafe extern "C" {
    pub fn _Exit(__status: ::std::os::raw::c_int) -> !;
}
unsafe extern "C" {
    pub fn getenv(__name: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn putenv(__string: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setenv(
        __name: *const ::std::os::raw::c_char,
        __value: *const ::std::os::raw::c_char,
        __replace: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn unsetenv(__name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clearenv() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mktemp(__template: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    #[link_name = "\u{1}mkstemp64"]
    pub fn mkstemp(__template: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}mkstemps64"]
    pub fn mkstemps(
        __template: *mut ::std::os::raw::c_char,
        __suffixlen: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mkdtemp(__template: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn system(__command: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn realpath(
        __name: *const ::std::os::raw::c_char,
        __resolved: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
pub type __compar_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
unsafe extern "C" {
    pub fn bsearch(
        __key: *const ::std::os::raw::c_void,
        __base: *const ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
        __compar: __compar_fn_t,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn qsort(
        __base: *mut ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
        __compar: __compar_fn_t,
    );
}
unsafe extern "C" {
    pub fn abs(__x: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn labs(__x: ::std::os::raw::c_long) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn llabs(__x: ::std::os::raw::c_longlong) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn div(__numer: ::std::os::raw::c_int, __denom: ::std::os::raw::c_int) -> div_t;
}
unsafe extern "C" {
    pub fn ldiv(__numer: ::std::os::raw::c_long, __denom: ::std::os::raw::c_long) -> ldiv_t;
}
unsafe extern "C" {
    pub fn lldiv(
        __numer: ::std::os::raw::c_longlong,
        __denom: ::std::os::raw::c_longlong,
    ) -> lldiv_t;
}
unsafe extern "C" {
    pub fn ecvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn fcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn gcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn qecvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn qfcvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn qgcvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ecvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fcvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn qecvt_r(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn qfcvt_r(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mblen(__s: *const ::std::os::raw::c_char, __n: usize) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mbtowc(
        __pwc: *mut wchar_t,
        __s: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn wctomb(__s: *mut ::std::os::raw::c_char, __wchar: wchar_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mbstowcs(__pwcs: *mut wchar_t, __s: *const ::std::os::raw::c_char, __n: usize) -> usize;
}
unsafe extern "C" {
    pub fn wcstombs(__s: *mut ::std::os::raw::c_char, __pwcs: *const wchar_t, __n: usize) -> usize;
}
unsafe extern "C" {
    pub fn rpmatch(__response: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getsubopt(
        __optionp: *mut *mut ::std::os::raw::c_char,
        __tokens: *const *mut ::std::os::raw::c_char,
        __valuep: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getloadavg(__loadavg: *mut f64, __nelem: ::std::os::raw::c_int)
        -> ::std::os::raw::c_int;
}
pub type float_t = f32;
pub type double_t = f64;
unsafe extern "C" {
    pub fn __fpclassify(__value: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __signbit(__value: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __isinf(__value: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __finite(__value: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __isnan(__value: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __iseqsig(__x: f64, __y: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __issignaling(__value: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn acos(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __acos(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn asin(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __asin(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn atan(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __atan(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn atan2(__y: f64, __x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __atan2(__y: f64, __x: f64) -> f64;
}
unsafe extern "C" {
    pub fn cos(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __cos(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn sin(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __sin(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn tan(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __tan(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn cosh(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __cosh(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn sinh(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __sinh(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn tanh(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __tanh(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn acosh(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __acosh(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn asinh(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __asinh(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn atanh(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __atanh(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn exp(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __exp(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn frexp(__x: f64, __exponent: *mut ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn __frexp(__x: f64, __exponent: *mut ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn ldexp(__x: f64, __exponent: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn __ldexp(__x: f64, __exponent: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn log(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __log(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn log10(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __log10(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn modf(__x: f64, __iptr: *mut f64) -> f64;
}
unsafe extern "C" {
    pub fn __modf(__x: f64, __iptr: *mut f64) -> f64;
}
unsafe extern "C" {
    pub fn expm1(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __expm1(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn log1p(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __log1p(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn logb(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __logb(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn exp2(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __exp2(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn log2(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __log2(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn pow(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn __pow(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn sqrt(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __sqrt(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn hypot(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn __hypot(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn cbrt(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __cbrt(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn ceil(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __ceil(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn fabs(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __fabs(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn floor(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __floor(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn fmod(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn __fmod(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn isinf(__value: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn finite(__value: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn drem(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn __drem(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn significand(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __significand(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn copysign(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn __copysign(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn nan(__tagb: *const ::std::os::raw::c_char) -> f64;
}
unsafe extern "C" {
    pub fn __nan(__tagb: *const ::std::os::raw::c_char) -> f64;
}
unsafe extern "C" {
    pub fn isnan(__value: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn j0(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn __j0(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn j1(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn __j1(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn jn(arg1: ::std::os::raw::c_int, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn __jn(arg1: ::std::os::raw::c_int, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn y0(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn __y0(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn y1(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn __y1(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn yn(arg1: ::std::os::raw::c_int, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn __yn(arg1: ::std::os::raw::c_int, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn erf(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn __erf(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn erfc(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn __erfc(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn lgamma(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn __lgamma(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn tgamma(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn __tgamma(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn gamma(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn __gamma(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn lgamma_r(arg1: f64, __signgamp: *mut ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn __lgamma_r(arg1: f64, __signgamp: *mut ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn rint(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __rint(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn nextafter(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn __nextafter(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn nexttoward(__x: f64, __y: u128) -> f64;
}
unsafe extern "C" {
    pub fn __nexttoward(__x: f64, __y: u128) -> f64;
}
unsafe extern "C" {
    pub fn remainder(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn __remainder(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn scalbn(__x: f64, __n: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn __scalbn(__x: f64, __n: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn ilogb(__x: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __ilogb(__x: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn scalbln(__x: f64, __n: ::std::os::raw::c_long) -> f64;
}
unsafe extern "C" {
    pub fn __scalbln(__x: f64, __n: ::std::os::raw::c_long) -> f64;
}
unsafe extern "C" {
    pub fn nearbyint(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __nearbyint(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn round(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __round(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn trunc(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __trunc(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn remquo(__x: f64, __y: f64, __quo: *mut ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn __remquo(__x: f64, __y: f64, __quo: *mut ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn lrint(__x: f64) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn __lrint(__x: f64) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn llrint(__x: f64) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn __llrint(__x: f64) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn lround(__x: f64) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn __lround(__x: f64) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn llround(__x: f64) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn __llround(__x: f64) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn fdim(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn __fdim(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn fmax(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn __fmax(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn fmin(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn __fmin(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn fma(__x: f64, __y: f64, __z: f64) -> f64;
}
unsafe extern "C" {
    pub fn __fma(__x: f64, __y: f64, __z: f64) -> f64;
}
unsafe extern "C" {
    pub fn scalb(__x: f64, __n: f64) -> f64;
}
unsafe extern "C" {
    pub fn __scalb(__x: f64, __n: f64) -> f64;
}
unsafe extern "C" {
    pub fn __fpclassifyf(__value: f32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __signbitf(__value: f32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __isinff(__value: f32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __finitef(__value: f32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __isnanf(__value: f32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __iseqsigf(__x: f32, __y: f32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __issignalingf(__value: f32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn acosf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __acosf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn asinf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __asinf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn atanf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __atanf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn atan2f(__y: f32, __x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __atan2f(__y: f32, __x: f32) -> f32;
}
unsafe extern "C" {
    pub fn cosf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __cosf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn sinf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __sinf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn tanf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __tanf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn coshf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __coshf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn sinhf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __sinhf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn tanhf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __tanhf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn acoshf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __acoshf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn asinhf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __asinhf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn atanhf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __atanhf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn expf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __expf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn frexpf(__x: f32, __exponent: *mut ::std::os::raw::c_int) -> f32;
}
unsafe extern "C" {
    pub fn __frexpf(__x: f32, __exponent: *mut ::std::os::raw::c_int) -> f32;
}
unsafe extern "C" {
    pub fn ldexpf(__x: f32, __exponent: ::std::os::raw::c_int) -> f32;
}
unsafe extern "C" {
    pub fn __ldexpf(__x: f32, __exponent: ::std::os::raw::c_int) -> f32;
}
unsafe extern "C" {
    pub fn logf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __logf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn log10f(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __log10f(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn modff(__x: f32, __iptr: *mut f32) -> f32;
}
unsafe extern "C" {
    pub fn __modff(__x: f32, __iptr: *mut f32) -> f32;
}
unsafe extern "C" {
    pub fn expm1f(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __expm1f(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn log1pf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __log1pf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn logbf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __logbf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn exp2f(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __exp2f(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn log2f(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __log2f(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn powf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn __powf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn sqrtf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __sqrtf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn hypotf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn __hypotf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn cbrtf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __cbrtf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn ceilf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __ceilf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn fabsf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __fabsf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn floorf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __floorf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn fmodf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn __fmodf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn isinff(__value: f32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn finitef(__value: f32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn dremf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn __dremf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn significandf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __significandf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn copysignf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn __copysignf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn nanf(__tagb: *const ::std::os::raw::c_char) -> f32;
}
unsafe extern "C" {
    pub fn __nanf(__tagb: *const ::std::os::raw::c_char) -> f32;
}
unsafe extern "C" {
    pub fn isnanf(__value: f32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn j0f(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn __j0f(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn j1f(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn __j1f(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn jnf(arg1: ::std::os::raw::c_int, arg2: f32) -> f32;
}
unsafe extern "C" {
    pub fn __jnf(arg1: ::std::os::raw::c_int, arg2: f32) -> f32;
}
unsafe extern "C" {
    pub fn y0f(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn __y0f(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn y1f(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn __y1f(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn ynf(arg1: ::std::os::raw::c_int, arg2: f32) -> f32;
}
unsafe extern "C" {
    pub fn __ynf(arg1: ::std::os::raw::c_int, arg2: f32) -> f32;
}
unsafe extern "C" {
    pub fn erff(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn __erff(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn erfcf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn __erfcf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn lgammaf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn __lgammaf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn tgammaf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn __tgammaf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn gammaf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn __gammaf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn lgammaf_r(arg1: f32, __signgamp: *mut ::std::os::raw::c_int) -> f32;
}
unsafe extern "C" {
    pub fn __lgammaf_r(arg1: f32, __signgamp: *mut ::std::os::raw::c_int) -> f32;
}
unsafe extern "C" {
    pub fn rintf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __rintf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn nextafterf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn __nextafterf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn nexttowardf(__x: f32, __y: u128) -> f32;
}
unsafe extern "C" {
    pub fn __nexttowardf(__x: f32, __y: u128) -> f32;
}
unsafe extern "C" {
    pub fn remainderf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn __remainderf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn scalbnf(__x: f32, __n: ::std::os::raw::c_int) -> f32;
}
unsafe extern "C" {
    pub fn __scalbnf(__x: f32, __n: ::std::os::raw::c_int) -> f32;
}
unsafe extern "C" {
    pub fn ilogbf(__x: f32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __ilogbf(__x: f32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn scalblnf(__x: f32, __n: ::std::os::raw::c_long) -> f32;
}
unsafe extern "C" {
    pub fn __scalblnf(__x: f32, __n: ::std::os::raw::c_long) -> f32;
}
unsafe extern "C" {
    pub fn nearbyintf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __nearbyintf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn roundf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __roundf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn truncf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __truncf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn remquof(__x: f32, __y: f32, __quo: *mut ::std::os::raw::c_int) -> f32;
}
unsafe extern "C" {
    pub fn __remquof(__x: f32, __y: f32, __quo: *mut ::std::os::raw::c_int) -> f32;
}
unsafe extern "C" {
    pub fn lrintf(__x: f32) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn __lrintf(__x: f32) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn llrintf(__x: f32) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn __llrintf(__x: f32) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn lroundf(__x: f32) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn __lroundf(__x: f32) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn llroundf(__x: f32) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn __llroundf(__x: f32) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn fdimf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn __fdimf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn fmaxf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn __fmaxf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn fminf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn __fminf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn fmaf(__x: f32, __y: f32, __z: f32) -> f32;
}
unsafe extern "C" {
    pub fn __fmaf(__x: f32, __y: f32, __z: f32) -> f32;
}
unsafe extern "C" {
    pub fn scalbf(__x: f32, __n: f32) -> f32;
}
unsafe extern "C" {
    pub fn __scalbf(__x: f32, __n: f32) -> f32;
}
unsafe extern "C" {
    pub fn __fpclassifyl(__value: u128) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __signbitl(__value: u128) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __isinfl(__value: u128) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __finitel(__value: u128) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __isnanl(__value: u128) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __iseqsigl(__x: u128, __y: u128) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __issignalingl(__value: u128) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn acosl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __acosl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn asinl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __asinl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn atanl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __atanl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn atan2l(__y: u128, __x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __atan2l(__y: u128, __x: u128) -> u128;
}
unsafe extern "C" {
    pub fn cosl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __cosl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn sinl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __sinl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn tanl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __tanl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn coshl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __coshl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn sinhl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __sinhl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn tanhl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __tanhl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn acoshl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __acoshl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn asinhl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __asinhl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn atanhl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __atanhl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn expl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __expl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn frexpl(__x: u128, __exponent: *mut ::std::os::raw::c_int) -> u128;
}
unsafe extern "C" {
    pub fn __frexpl(__x: u128, __exponent: *mut ::std::os::raw::c_int) -> u128;
}
unsafe extern "C" {
    pub fn ldexpl(__x: u128, __exponent: ::std::os::raw::c_int) -> u128;
}
unsafe extern "C" {
    pub fn __ldexpl(__x: u128, __exponent: ::std::os::raw::c_int) -> u128;
}
unsafe extern "C" {
    pub fn logl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __logl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn log10l(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __log10l(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn modfl(__x: u128, __iptr: *mut u128) -> u128;
}
unsafe extern "C" {
    pub fn __modfl(__x: u128, __iptr: *mut u128) -> u128;
}
unsafe extern "C" {
    pub fn expm1l(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __expm1l(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn log1pl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __log1pl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn logbl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __logbl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn exp2l(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __exp2l(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn log2l(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __log2l(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn powl(__x: u128, __y: u128) -> u128;
}
unsafe extern "C" {
    pub fn __powl(__x: u128, __y: u128) -> u128;
}
unsafe extern "C" {
    pub fn sqrtl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __sqrtl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn hypotl(__x: u128, __y: u128) -> u128;
}
unsafe extern "C" {
    pub fn __hypotl(__x: u128, __y: u128) -> u128;
}
unsafe extern "C" {
    pub fn cbrtl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __cbrtl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn ceill(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __ceill(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn fabsl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __fabsl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn floorl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __floorl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn fmodl(__x: u128, __y: u128) -> u128;
}
unsafe extern "C" {
    pub fn __fmodl(__x: u128, __y: u128) -> u128;
}
unsafe extern "C" {
    pub fn isinfl(__value: u128) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn finitel(__value: u128) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn dreml(__x: u128, __y: u128) -> u128;
}
unsafe extern "C" {
    pub fn __dreml(__x: u128, __y: u128) -> u128;
}
unsafe extern "C" {
    pub fn significandl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __significandl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn copysignl(__x: u128, __y: u128) -> u128;
}
unsafe extern "C" {
    pub fn __copysignl(__x: u128, __y: u128) -> u128;
}
unsafe extern "C" {
    pub fn nanl(__tagb: *const ::std::os::raw::c_char) -> u128;
}
unsafe extern "C" {
    pub fn __nanl(__tagb: *const ::std::os::raw::c_char) -> u128;
}
unsafe extern "C" {
    pub fn isnanl(__value: u128) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn j0l(arg1: u128) -> u128;
}
unsafe extern "C" {
    pub fn __j0l(arg1: u128) -> u128;
}
unsafe extern "C" {
    pub fn j1l(arg1: u128) -> u128;
}
unsafe extern "C" {
    pub fn __j1l(arg1: u128) -> u128;
}
unsafe extern "C" {
    pub fn jnl(arg1: ::std::os::raw::c_int, arg2: u128) -> u128;
}
unsafe extern "C" {
    pub fn __jnl(arg1: ::std::os::raw::c_int, arg2: u128) -> u128;
}
unsafe extern "C" {
    pub fn y0l(arg1: u128) -> u128;
}
unsafe extern "C" {
    pub fn __y0l(arg1: u128) -> u128;
}
unsafe extern "C" {
    pub fn y1l(arg1: u128) -> u128;
}
unsafe extern "C" {
    pub fn __y1l(arg1: u128) -> u128;
}
unsafe extern "C" {
    pub fn ynl(arg1: ::std::os::raw::c_int, arg2: u128) -> u128;
}
unsafe extern "C" {
    pub fn __ynl(arg1: ::std::os::raw::c_int, arg2: u128) -> u128;
}
unsafe extern "C" {
    pub fn erfl(arg1: u128) -> u128;
}
unsafe extern "C" {
    pub fn __erfl(arg1: u128) -> u128;
}
unsafe extern "C" {
    pub fn erfcl(arg1: u128) -> u128;
}
unsafe extern "C" {
    pub fn __erfcl(arg1: u128) -> u128;
}
unsafe extern "C" {
    pub fn lgammal(arg1: u128) -> u128;
}
unsafe extern "C" {
    pub fn __lgammal(arg1: u128) -> u128;
}
unsafe extern "C" {
    pub fn tgammal(arg1: u128) -> u128;
}
unsafe extern "C" {
    pub fn __tgammal(arg1: u128) -> u128;
}
unsafe extern "C" {
    pub fn gammal(arg1: u128) -> u128;
}
unsafe extern "C" {
    pub fn __gammal(arg1: u128) -> u128;
}
unsafe extern "C" {
    pub fn lgammal_r(arg1: u128, __signgamp: *mut ::std::os::raw::c_int) -> u128;
}
unsafe extern "C" {
    pub fn __lgammal_r(arg1: u128, __signgamp: *mut ::std::os::raw::c_int) -> u128;
}
unsafe extern "C" {
    pub fn rintl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __rintl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn nextafterl(__x: u128, __y: u128) -> u128;
}
unsafe extern "C" {
    pub fn __nextafterl(__x: u128, __y: u128) -> u128;
}
unsafe extern "C" {
    pub fn nexttowardl(__x: u128, __y: u128) -> u128;
}
unsafe extern "C" {
    pub fn __nexttowardl(__x: u128, __y: u128) -> u128;
}
unsafe extern "C" {
    pub fn remainderl(__x: u128, __y: u128) -> u128;
}
unsafe extern "C" {
    pub fn __remainderl(__x: u128, __y: u128) -> u128;
}
unsafe extern "C" {
    pub fn scalbnl(__x: u128, __n: ::std::os::raw::c_int) -> u128;
}
unsafe extern "C" {
    pub fn __scalbnl(__x: u128, __n: ::std::os::raw::c_int) -> u128;
}
unsafe extern "C" {
    pub fn ilogbl(__x: u128) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __ilogbl(__x: u128) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn scalblnl(__x: u128, __n: ::std::os::raw::c_long) -> u128;
}
unsafe extern "C" {
    pub fn __scalblnl(__x: u128, __n: ::std::os::raw::c_long) -> u128;
}
unsafe extern "C" {
    pub fn nearbyintl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __nearbyintl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn roundl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __roundl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn truncl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __truncl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn remquol(__x: u128, __y: u128, __quo: *mut ::std::os::raw::c_int) -> u128;
}
unsafe extern "C" {
    pub fn __remquol(__x: u128, __y: u128, __quo: *mut ::std::os::raw::c_int) -> u128;
}
unsafe extern "C" {
    pub fn lrintl(__x: u128) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn __lrintl(__x: u128) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn llrintl(__x: u128) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn __llrintl(__x: u128) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn lroundl(__x: u128) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn __lroundl(__x: u128) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn llroundl(__x: u128) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn __llroundl(__x: u128) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn fdiml(__x: u128, __y: u128) -> u128;
}
unsafe extern "C" {
    pub fn __fdiml(__x: u128, __y: u128) -> u128;
}
unsafe extern "C" {
    pub fn fmaxl(__x: u128, __y: u128) -> u128;
}
unsafe extern "C" {
    pub fn __fmaxl(__x: u128, __y: u128) -> u128;
}
unsafe extern "C" {
    pub fn fminl(__x: u128, __y: u128) -> u128;
}
unsafe extern "C" {
    pub fn __fminl(__x: u128, __y: u128) -> u128;
}
unsafe extern "C" {
    pub fn fmal(__x: u128, __y: u128, __z: u128) -> u128;
}
unsafe extern "C" {
    pub fn __fmal(__x: u128, __y: u128, __z: u128) -> u128;
}
unsafe extern "C" {
    pub fn scalbl(__x: u128, __n: u128) -> u128;
}
unsafe extern "C" {
    pub fn __scalbl(__x: u128, __n: u128) -> u128;
}
unsafe extern "C" {
    pub static mut signgam: ::std::os::raw::c_int;
}
pub const FP_NAN: _bindgen_ty_1 = 0;
pub const FP_INFINITE: _bindgen_ty_1 = 1;
pub const FP_ZERO: _bindgen_ty_1 = 2;
pub const FP_SUBNORMAL: _bindgen_ty_1 = 3;
pub const FP_NORMAL: _bindgen_ty_1 = 4;
pub type _bindgen_ty_1 = ::std::os::raw::c_uint;
unsafe extern "C" {
    pub fn __errno_location() -> *mut ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timezone {
    pub tz_minuteswest: ::std::os::raw::c_int,
    pub tz_dsttime: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timezone"][::std::mem::size_of::<timezone>() - 8usize];
    ["Alignment of timezone"][::std::mem::align_of::<timezone>() - 4usize];
    ["Offset of field: timezone::tz_minuteswest"]
        [::std::mem::offset_of!(timezone, tz_minuteswest) - 0usize];
    ["Offset of field: timezone::tz_dsttime"]
        [::std::mem::offset_of!(timezone, tz_dsttime) - 4usize];
};
unsafe extern "C" {
    pub fn gettimeofday(
        __tv: *mut timeval,
        __tz: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn settimeofday(__tv: *const timeval, __tz: *const timezone) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn adjtime(__delta: *const timeval, __olddelta: *mut timeval) -> ::std::os::raw::c_int;
}
pub const __itimer_which_ITIMER_REAL: __itimer_which = 0;
pub const __itimer_which_ITIMER_VIRTUAL: __itimer_which = 1;
pub const __itimer_which_ITIMER_PROF: __itimer_which = 2;
pub type __itimer_which = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct itimerval {
    pub it_interval: timeval,
    pub it_value: timeval,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of itimerval"][::std::mem::size_of::<itimerval>() - 32usize];
    ["Alignment of itimerval"][::std::mem::align_of::<itimerval>() - 8usize];
    ["Offset of field: itimerval::it_interval"]
        [::std::mem::offset_of!(itimerval, it_interval) - 0usize];
    ["Offset of field: itimerval::it_value"][::std::mem::offset_of!(itimerval, it_value) - 16usize];
};
pub type __itimer_which_t = ::std::os::raw::c_int;
unsafe extern "C" {
    pub fn getitimer(__which: __itimer_which_t, __value: *mut itimerval) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setitimer(
        __which: __itimer_which_t,
        __new: *const itimerval,
        __old: *mut itimerval,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn utimes(
        __file: *const ::std::os::raw::c_char,
        __tvp: *const timeval,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lutimes(
        __file: *const ::std::os::raw::c_char,
        __tvp: *const timeval,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn futimes(__fd: ::std::os::raw::c_int, __tvp: *const timeval) -> ::std::os::raw::c_int;
}
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type __gwchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct imaxdiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of imaxdiv_t"][::std::mem::size_of::<imaxdiv_t>() - 16usize];
    ["Alignment of imaxdiv_t"][::std::mem::align_of::<imaxdiv_t>() - 8usize];
    ["Offset of field: imaxdiv_t::quot"][::std::mem::offset_of!(imaxdiv_t, quot) - 0usize];
    ["Offset of field: imaxdiv_t::rem"][::std::mem::offset_of!(imaxdiv_t, rem) - 8usize];
};
unsafe extern "C" {
    pub fn imaxabs(__n: intmax_t) -> intmax_t;
}
unsafe extern "C" {
    pub fn imaxdiv(__numer: intmax_t, __denom: intmax_t) -> imaxdiv_t;
}
unsafe extern "C" {
    pub fn strtoimax(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> intmax_t;
}
unsafe extern "C" {
    pub fn strtoumax(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
unsafe extern "C" {
    pub fn wcstoimax(
        __nptr: *const __gwchar_t,
        __endptr: *mut *mut __gwchar_t,
        __base: ::std::os::raw::c_int,
    ) -> intmax_t;
}
unsafe extern "C" {
    pub fn wcstoumax(
        __nptr: *const __gwchar_t,
        __endptr: *mut *mut __gwchar_t,
        __base: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
pub const LibRaw_openbayer_patterns_LIBRAW_OPENBAYER_RGGB: LibRaw_openbayer_patterns = 148;
pub const LibRaw_openbayer_patterns_LIBRAW_OPENBAYER_BGGR: LibRaw_openbayer_patterns = 22;
pub const LibRaw_openbayer_patterns_LIBRAW_OPENBAYER_GRBG: LibRaw_openbayer_patterns = 97;
pub const LibRaw_openbayer_patterns_LIBRAW_OPENBAYER_GBRG: LibRaw_openbayer_patterns = 73;
pub type LibRaw_openbayer_patterns = ::std::os::raw::c_uint;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_FORWARDMATRIX: LibRaw_dngfields_marks = 1;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_ILLUMINANT: LibRaw_dngfields_marks = 2;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_COLORMATRIX: LibRaw_dngfields_marks = 4;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_CALIBRATION: LibRaw_dngfields_marks = 8;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_ANALOGBALANCE: LibRaw_dngfields_marks = 16;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_BLACK: LibRaw_dngfields_marks = 32;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_WHITE: LibRaw_dngfields_marks = 64;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_OPCODE2: LibRaw_dngfields_marks = 128;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_LINTABLE: LibRaw_dngfields_marks = 256;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_CROPORIGIN: LibRaw_dngfields_marks = 512;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_CROPSIZE: LibRaw_dngfields_marks = 1024;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_PREVIEWCS: LibRaw_dngfields_marks = 2048;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_ASSHOTNEUTRAL: LibRaw_dngfields_marks = 4096;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_BASELINEEXPOSURE: LibRaw_dngfields_marks = 8192;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_LINEARRESPONSELIMIT: LibRaw_dngfields_marks = 16384;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_USERCROP: LibRaw_dngfields_marks = 32768;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_OPCODE1: LibRaw_dngfields_marks = 65536;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_OPCODE3: LibRaw_dngfields_marks = 131072;
pub type LibRaw_dngfields_marks = ::std::os::raw::c_uint;
pub const LibRaw_As_Shot_WB_Applied_codes_LIBRAW_ASWB_APPLIED: LibRaw_As_Shot_WB_Applied_codes = 1;
pub const LibRaw_As_Shot_WB_Applied_codes_LIBRAW_ASWB_CANON: LibRaw_As_Shot_WB_Applied_codes = 2;
pub const LibRaw_As_Shot_WB_Applied_codes_LIBRAW_ASWB_NIKON: LibRaw_As_Shot_WB_Applied_codes = 4;
pub const LibRaw_As_Shot_WB_Applied_codes_LIBRAW_ASWB_NIKON_SRAW: LibRaw_As_Shot_WB_Applied_codes =
    8;
pub const LibRaw_As_Shot_WB_Applied_codes_LIBRAW_ASWB_PENTAX: LibRaw_As_Shot_WB_Applied_codes = 16;
pub const LibRaw_As_Shot_WB_Applied_codes_LIBRAW_ASWB_SONY: LibRaw_As_Shot_WB_Applied_codes = 32;
pub type LibRaw_As_Shot_WB_Applied_codes = ::std::os::raw::c_uint;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_UNKNOWN: LibRaw_ExifTagTypes = 0;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_BYTE: LibRaw_ExifTagTypes = 1;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_ASCII: LibRaw_ExifTagTypes = 2;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_SHORT: LibRaw_ExifTagTypes = 3;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_LONG: LibRaw_ExifTagTypes = 4;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_RATIONAL: LibRaw_ExifTagTypes = 5;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_SBYTE: LibRaw_ExifTagTypes = 6;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_UNDEFINED: LibRaw_ExifTagTypes = 7;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_SSHORT: LibRaw_ExifTagTypes = 8;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_SLONG: LibRaw_ExifTagTypes = 9;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_SRATIONAL: LibRaw_ExifTagTypes = 10;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_FLOAT: LibRaw_ExifTagTypes = 11;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_DOUBLE: LibRaw_ExifTagTypes = 12;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_IFD: LibRaw_ExifTagTypes = 13;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_UNICODE: LibRaw_ExifTagTypes = 14;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_COMPLEX: LibRaw_ExifTagTypes = 15;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_LONG8: LibRaw_ExifTagTypes = 16;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_SLONG8: LibRaw_ExifTagTypes = 17;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_IFD8: LibRaw_ExifTagTypes = 18;
pub type LibRaw_ExifTagTypes = ::std::os::raw::c_uint;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Unknown: LibRaw_whitebalance_code = 0;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Daylight: LibRaw_whitebalance_code = 1;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Fluorescent: LibRaw_whitebalance_code = 2;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Tungsten: LibRaw_whitebalance_code = 3;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Flash: LibRaw_whitebalance_code = 4;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_FineWeather: LibRaw_whitebalance_code = 9;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Cloudy: LibRaw_whitebalance_code = 10;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Shade: LibRaw_whitebalance_code = 11;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_FL_D: LibRaw_whitebalance_code = 12;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_FL_N: LibRaw_whitebalance_code = 13;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_FL_W: LibRaw_whitebalance_code = 14;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_FL_WW: LibRaw_whitebalance_code = 15;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_FL_L: LibRaw_whitebalance_code = 16;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Ill_A: LibRaw_whitebalance_code = 17;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Ill_B: LibRaw_whitebalance_code = 18;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Ill_C: LibRaw_whitebalance_code = 19;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_D55: LibRaw_whitebalance_code = 20;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_D65: LibRaw_whitebalance_code = 21;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_D75: LibRaw_whitebalance_code = 22;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_D50: LibRaw_whitebalance_code = 23;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_StudioTungsten: LibRaw_whitebalance_code = 24;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Sunset: LibRaw_whitebalance_code = 64;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Underwater: LibRaw_whitebalance_code = 65;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_FluorescentHigh: LibRaw_whitebalance_code = 66;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_HT_Mercury: LibRaw_whitebalance_code = 67;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_AsShot: LibRaw_whitebalance_code = 81;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Auto: LibRaw_whitebalance_code = 82;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Custom: LibRaw_whitebalance_code = 83;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Auto1: LibRaw_whitebalance_code = 85;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Auto2: LibRaw_whitebalance_code = 86;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Auto3: LibRaw_whitebalance_code = 87;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Auto4: LibRaw_whitebalance_code = 88;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Custom1: LibRaw_whitebalance_code = 90;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Custom2: LibRaw_whitebalance_code = 91;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Custom3: LibRaw_whitebalance_code = 92;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Custom4: LibRaw_whitebalance_code = 93;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Custom5: LibRaw_whitebalance_code = 94;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Custom6: LibRaw_whitebalance_code = 95;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_PC_Set1: LibRaw_whitebalance_code = 96;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_PC_Set2: LibRaw_whitebalance_code = 97;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_PC_Set3: LibRaw_whitebalance_code = 98;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_PC_Set4: LibRaw_whitebalance_code = 99;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_PC_Set5: LibRaw_whitebalance_code = 100;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Measured: LibRaw_whitebalance_code = 110;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_BW: LibRaw_whitebalance_code = 120;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Kelvin: LibRaw_whitebalance_code = 254;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Other: LibRaw_whitebalance_code = 255;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_None: LibRaw_whitebalance_code = 65535;
pub type LibRaw_whitebalance_code = ::std::os::raw::c_uint;
pub const LibRaw_MultiExposure_related_LIBRAW_ME_NONE: LibRaw_MultiExposure_related = 0;
pub const LibRaw_MultiExposure_related_LIBRAW_ME_SIMPLE: LibRaw_MultiExposure_related = 1;
pub const LibRaw_MultiExposure_related_LIBRAW_ME_OVERLAY: LibRaw_MultiExposure_related = 2;
pub const LibRaw_MultiExposure_related_LIBRAW_ME_HDR: LibRaw_MultiExposure_related = 3;
pub type LibRaw_MultiExposure_related = ::std::os::raw::c_uint;
pub const LibRaw_dng_processing_LIBRAW_DNG_NONE: LibRaw_dng_processing = 0;
pub const LibRaw_dng_processing_LIBRAW_DNG_FLOAT: LibRaw_dng_processing = 1;
pub const LibRaw_dng_processing_LIBRAW_DNG_LINEAR: LibRaw_dng_processing = 2;
pub const LibRaw_dng_processing_LIBRAW_DNG_DEFLATE: LibRaw_dng_processing = 4;
pub const LibRaw_dng_processing_LIBRAW_DNG_XTRANS: LibRaw_dng_processing = 8;
pub const LibRaw_dng_processing_LIBRAW_DNG_OTHER: LibRaw_dng_processing = 16;
pub const LibRaw_dng_processing_LIBRAW_DNG_8BIT: LibRaw_dng_processing = 32;
pub const LibRaw_dng_processing_LIBRAW_DNG_ALL: LibRaw_dng_processing = 63;
pub const LibRaw_dng_processing_LIBRAW_DNG_DEFAULT: LibRaw_dng_processing = 39;
pub type LibRaw_dng_processing = ::std::os::raw::c_uint;
pub const LibRaw_output_flags_LIBRAW_OUTPUT_FLAGS_NONE: LibRaw_output_flags = 0;
pub const LibRaw_output_flags_LIBRAW_OUTPUT_FLAGS_PPMMETA: LibRaw_output_flags = 1;
pub type LibRaw_output_flags = ::std::os::raw::c_uint;
pub const LibRaw_runtime_capabilities_LIBRAW_CAPS_RAWSPEED: LibRaw_runtime_capabilities = 1;
pub const LibRaw_runtime_capabilities_LIBRAW_CAPS_DNGSDK: LibRaw_runtime_capabilities = 2;
pub const LibRaw_runtime_capabilities_LIBRAW_CAPS_GPRSDK: LibRaw_runtime_capabilities = 4;
pub const LibRaw_runtime_capabilities_LIBRAW_CAPS_UNICODEPATHS: LibRaw_runtime_capabilities = 8;
pub const LibRaw_runtime_capabilities_LIBRAW_CAPS_X3FTOOLS: LibRaw_runtime_capabilities = 16;
pub const LibRaw_runtime_capabilities_LIBRAW_CAPS_RPI6BY9: LibRaw_runtime_capabilities = 32;
pub const LibRaw_runtime_capabilities_LIBRAW_CAPS_ZLIB: LibRaw_runtime_capabilities = 64;
pub const LibRaw_runtime_capabilities_LIBRAW_CAPS_JPEG: LibRaw_runtime_capabilities = 128;
pub const LibRaw_runtime_capabilities_LIBRAW_CAPS_RAWSPEED3: LibRaw_runtime_capabilities = 256;
pub const LibRaw_runtime_capabilities_LIBRAW_CAPS_RAWSPEED_BITS: LibRaw_runtime_capabilities = 512;
pub type LibRaw_runtime_capabilities = ::std::os::raw::c_uint;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_NotFound: LibRaw_colorspace = 0;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_sRGB: LibRaw_colorspace = 1;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_AdobeRGB: LibRaw_colorspace = 2;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_WideGamutRGB: LibRaw_colorspace = 3;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_ProPhotoRGB: LibRaw_colorspace = 4;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_ICC: LibRaw_colorspace = 5;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_Uncalibrated: LibRaw_colorspace = 6;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_CameraLinearUniWB: LibRaw_colorspace = 7;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_CameraLinear: LibRaw_colorspace = 8;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_CameraGammaUniWB: LibRaw_colorspace = 9;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_CameraGamma: LibRaw_colorspace = 10;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_MonochromeLinear: LibRaw_colorspace = 11;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_MonochromeGamma: LibRaw_colorspace = 12;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_Rec2020: LibRaw_colorspace = 13;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_Unknown: LibRaw_colorspace = 255;
pub type LibRaw_colorspace = ::std::os::raw::c_uint;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Unknown: LibRaw_cameramaker_index = 0;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Agfa: LibRaw_cameramaker_index = 1;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Alcatel: LibRaw_cameramaker_index = 2;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Apple: LibRaw_cameramaker_index = 3;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Aptina: LibRaw_cameramaker_index = 4;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_AVT: LibRaw_cameramaker_index = 5;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Baumer: LibRaw_cameramaker_index = 6;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Broadcom: LibRaw_cameramaker_index = 7;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Canon: LibRaw_cameramaker_index = 8;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Casio: LibRaw_cameramaker_index = 9;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_CINE: LibRaw_cameramaker_index = 10;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Clauss: LibRaw_cameramaker_index = 11;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Contax: LibRaw_cameramaker_index = 12;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Creative: LibRaw_cameramaker_index = 13;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_DJI: LibRaw_cameramaker_index = 14;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_DXO: LibRaw_cameramaker_index = 15;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Epson: LibRaw_cameramaker_index = 16;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Foculus: LibRaw_cameramaker_index = 17;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Fujifilm: LibRaw_cameramaker_index = 18;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Generic: LibRaw_cameramaker_index = 19;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Gione: LibRaw_cameramaker_index = 20;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_GITUP: LibRaw_cameramaker_index = 21;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Google: LibRaw_cameramaker_index = 22;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_GoPro: LibRaw_cameramaker_index = 23;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Hasselblad: LibRaw_cameramaker_index = 24;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_HTC: LibRaw_cameramaker_index = 25;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_I_Mobile: LibRaw_cameramaker_index = 26;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Imacon: LibRaw_cameramaker_index = 27;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_JK_Imaging: LibRaw_cameramaker_index = 28;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Kodak: LibRaw_cameramaker_index = 29;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Konica: LibRaw_cameramaker_index = 30;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Leaf: LibRaw_cameramaker_index = 31;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Leica: LibRaw_cameramaker_index = 32;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Lenovo: LibRaw_cameramaker_index = 33;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_LG: LibRaw_cameramaker_index = 34;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Logitech: LibRaw_cameramaker_index = 35;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Mamiya: LibRaw_cameramaker_index = 36;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Matrix: LibRaw_cameramaker_index = 37;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Meizu: LibRaw_cameramaker_index = 38;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Micron: LibRaw_cameramaker_index = 39;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Minolta: LibRaw_cameramaker_index = 40;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Motorola: LibRaw_cameramaker_index = 41;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_NGM: LibRaw_cameramaker_index = 42;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Nikon: LibRaw_cameramaker_index = 43;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Nokia: LibRaw_cameramaker_index = 44;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Olympus: LibRaw_cameramaker_index = 45;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_OmniVison: LibRaw_cameramaker_index = 46;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Panasonic: LibRaw_cameramaker_index = 47;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Parrot: LibRaw_cameramaker_index = 48;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Pentax: LibRaw_cameramaker_index = 49;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_PhaseOne: LibRaw_cameramaker_index = 50;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_PhotoControl: LibRaw_cameramaker_index = 51;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Photron: LibRaw_cameramaker_index = 52;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Pixelink: LibRaw_cameramaker_index = 53;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Polaroid: LibRaw_cameramaker_index = 54;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_RED: LibRaw_cameramaker_index = 55;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Ricoh: LibRaw_cameramaker_index = 56;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Rollei: LibRaw_cameramaker_index = 57;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_RoverShot: LibRaw_cameramaker_index = 58;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Samsung: LibRaw_cameramaker_index = 59;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Sigma: LibRaw_cameramaker_index = 60;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Sinar: LibRaw_cameramaker_index = 61;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_SMaL: LibRaw_cameramaker_index = 62;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Sony: LibRaw_cameramaker_index = 63;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_ST_Micro: LibRaw_cameramaker_index = 64;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_THL: LibRaw_cameramaker_index = 65;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_VLUU: LibRaw_cameramaker_index = 66;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Xiaomi: LibRaw_cameramaker_index = 67;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_XIAOYI: LibRaw_cameramaker_index = 68;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_YI: LibRaw_cameramaker_index = 69;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Yuneec: LibRaw_cameramaker_index = 70;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Zeiss: LibRaw_cameramaker_index = 71;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_OnePlus: LibRaw_cameramaker_index = 72;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_ISG: LibRaw_cameramaker_index = 73;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_VIVO: LibRaw_cameramaker_index = 74;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_HMD_Global: LibRaw_cameramaker_index = 75;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_HUAWEI: LibRaw_cameramaker_index = 76;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_RaspberryPi: LibRaw_cameramaker_index = 77;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_OmDigital: LibRaw_cameramaker_index = 78;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_TheLastOne: LibRaw_cameramaker_index = 79;
pub type LibRaw_cameramaker_index = ::std::os::raw::c_uint;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Unknown: LibRaw_camera_mounts = 0;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Alpa: LibRaw_camera_mounts = 1;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_C: LibRaw_camera_mounts = 2;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Canon_EF_M: LibRaw_camera_mounts = 3;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Canon_EF_S: LibRaw_camera_mounts = 4;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Canon_EF: LibRaw_camera_mounts = 5;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Canon_RF: LibRaw_camera_mounts = 6;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Contax_N: LibRaw_camera_mounts = 7;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Contax645: LibRaw_camera_mounts = 8;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_FT: LibRaw_camera_mounts = 9;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_mFT: LibRaw_camera_mounts = 10;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Fuji_GF: LibRaw_camera_mounts = 11;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Fuji_GX: LibRaw_camera_mounts = 12;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Fuji_X: LibRaw_camera_mounts = 13;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Hasselblad_H: LibRaw_camera_mounts = 14;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Hasselblad_V: LibRaw_camera_mounts = 15;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Hasselblad_XCD: LibRaw_camera_mounts = 16;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Leica_M: LibRaw_camera_mounts = 17;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Leica_R: LibRaw_camera_mounts = 18;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Leica_S: LibRaw_camera_mounts = 19;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Leica_SL: LibRaw_camera_mounts = 20;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Leica_TL: LibRaw_camera_mounts = 21;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_LPS_L: LibRaw_camera_mounts = 22;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Mamiya67: LibRaw_camera_mounts = 23;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Mamiya645: LibRaw_camera_mounts = 24;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Minolta_A: LibRaw_camera_mounts = 25;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Nikon_CX: LibRaw_camera_mounts = 26;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Nikon_F: LibRaw_camera_mounts = 27;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Nikon_Z: LibRaw_camera_mounts = 28;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_PhaseOne_iXM_MV: LibRaw_camera_mounts = 29;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_PhaseOne_iXM_RS: LibRaw_camera_mounts = 30;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_PhaseOne_iXM: LibRaw_camera_mounts = 31;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Pentax_645: LibRaw_camera_mounts = 32;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Pentax_K: LibRaw_camera_mounts = 33;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Pentax_Q: LibRaw_camera_mounts = 34;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_RicohModule: LibRaw_camera_mounts = 35;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Rollei_bayonet: LibRaw_camera_mounts = 36;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Samsung_NX_M: LibRaw_camera_mounts = 37;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Samsung_NX: LibRaw_camera_mounts = 38;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Sigma_X3F: LibRaw_camera_mounts = 39;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Sony_E: LibRaw_camera_mounts = 40;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_LF: LibRaw_camera_mounts = 41;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_DigitalBack: LibRaw_camera_mounts = 42;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_FixedLens: LibRaw_camera_mounts = 43;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_IL_UM: LibRaw_camera_mounts = 44;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_TheLastOne: LibRaw_camera_mounts = 45;
pub type LibRaw_camera_mounts = ::std::os::raw::c_uint;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_Unknown: LibRaw_camera_formats = 0;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_APSC: LibRaw_camera_formats = 1;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_FF: LibRaw_camera_formats = 2;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_MF: LibRaw_camera_formats = 3;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_APSH: LibRaw_camera_formats = 4;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_1INCH: LibRaw_camera_formats = 5;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_1div2p3INCH: LibRaw_camera_formats = 6;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_1div1p7INCH: LibRaw_camera_formats = 7;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_FT: LibRaw_camera_formats = 8;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_CROP645: LibRaw_camera_formats = 9;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_LeicaS: LibRaw_camera_formats = 10;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_645: LibRaw_camera_formats = 11;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_66: LibRaw_camera_formats = 12;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_69: LibRaw_camera_formats = 13;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_LF: LibRaw_camera_formats = 14;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_Leica_DMR: LibRaw_camera_formats = 15;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_67: LibRaw_camera_formats = 16;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_SigmaAPSC: LibRaw_camera_formats = 17;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_SigmaMerrill: LibRaw_camera_formats = 18;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_SigmaAPSH: LibRaw_camera_formats = 19;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_3648: LibRaw_camera_formats = 20;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_68: LibRaw_camera_formats = 21;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_TheLastOne: LibRaw_camera_formats = 22;
pub type LibRaw_camera_formats = ::std::os::raw::c_uint;
pub const LibRawImageAspects_LIBRAW_IMAGE_ASPECT_UNKNOWN: LibRawImageAspects = 0;
pub const LibRawImageAspects_LIBRAW_IMAGE_ASPECT_OTHER: LibRawImageAspects = 1;
pub const LibRawImageAspects_LIBRAW_IMAGE_ASPECT_MINIMAL_REAL_ASPECT_VALUE: LibRawImageAspects = 99;
pub const LibRawImageAspects_LIBRAW_IMAGE_ASPECT_MAXIMAL_REAL_ASPECT_VALUE: LibRawImageAspects =
    10000;
pub const LibRawImageAspects_LIBRAW_IMAGE_ASPECT_3to2: LibRawImageAspects = 1500;
pub const LibRawImageAspects_LIBRAW_IMAGE_ASPECT_1to1: LibRawImageAspects = 1000;
pub const LibRawImageAspects_LIBRAW_IMAGE_ASPECT_4to3: LibRawImageAspects = 1333;
pub const LibRawImageAspects_LIBRAW_IMAGE_ASPECT_16to9: LibRawImageAspects = 1777;
pub const LibRawImageAspects_LIBRAW_IMAGE_ASPECT_5to4: LibRawImageAspects = 1250;
pub const LibRawImageAspects_LIBRAW_IMAGE_ASPECT_7to6: LibRawImageAspects = 1166;
pub const LibRawImageAspects_LIBRAW_IMAGE_ASPECT_6to5: LibRawImageAspects = 1200;
pub const LibRawImageAspects_LIBRAW_IMAGE_ASPECT_7to5: LibRawImageAspects = 1400;
pub type LibRawImageAspects = ::std::os::raw::c_uint;
pub const LibRaw_lens_focal_types_LIBRAW_FT_UNDEFINED: LibRaw_lens_focal_types = 0;
pub const LibRaw_lens_focal_types_LIBRAW_FT_PRIME_LENS: LibRaw_lens_focal_types = 1;
pub const LibRaw_lens_focal_types_LIBRAW_FT_ZOOM_LENS: LibRaw_lens_focal_types = 2;
pub const LibRaw_lens_focal_types_LIBRAW_FT_ZOOM_LENS_CONSTANT_APERTURE: LibRaw_lens_focal_types =
    3;
pub const LibRaw_lens_focal_types_LIBRAW_FT_ZOOM_LENS_VARIABLE_APERTURE: LibRaw_lens_focal_types =
    4;
pub type LibRaw_lens_focal_types = ::std::os::raw::c_uint;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_UNDEFINED: LibRaw_Canon_RecordModes = 0;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_JPEG: LibRaw_Canon_RecordModes = 1;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_CRW_THM: LibRaw_Canon_RecordModes = 2;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_AVI_THM: LibRaw_Canon_RecordModes = 3;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_TIF: LibRaw_Canon_RecordModes = 4;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_TIF_JPEG: LibRaw_Canon_RecordModes = 5;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_CR2: LibRaw_Canon_RecordModes = 6;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_CR2_JPEG: LibRaw_Canon_RecordModes = 7;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_UNKNOWN: LibRaw_Canon_RecordModes = 8;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_MOV: LibRaw_Canon_RecordModes = 9;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_MP4: LibRaw_Canon_RecordModes = 10;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_CRM: LibRaw_Canon_RecordModes = 11;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_CR3: LibRaw_Canon_RecordModes = 12;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_CR3_JPEG: LibRaw_Canon_RecordModes = 13;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_HEIF: LibRaw_Canon_RecordModes = 14;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_CR3_HEIF: LibRaw_Canon_RecordModes = 15;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_TheLastOne: LibRaw_Canon_RecordModes =
    16;
pub type LibRaw_Canon_RecordModes = ::std::os::raw::c_uint;
pub const LibRaw_minolta_storagemethods_LIBRAW_MINOLTA_UNPACKED: LibRaw_minolta_storagemethods = 82;
pub const LibRaw_minolta_storagemethods_LIBRAW_MINOLTA_PACKED: LibRaw_minolta_storagemethods = 89;
pub type LibRaw_minolta_storagemethods = ::std::os::raw::c_uint;
pub const LibRaw_minolta_bayerpatterns_LIBRAW_MINOLTA_RGGB: LibRaw_minolta_bayerpatterns = 1;
pub const LibRaw_minolta_bayerpatterns_LIBRAW_MINOLTA_G2BRG1: LibRaw_minolta_bayerpatterns = 4;
pub type LibRaw_minolta_bayerpatterns = ::std::os::raw::c_uint;
pub const LibRaw_sony_cameratypes_LIBRAW_SONY_DSC: LibRaw_sony_cameratypes = 1;
pub const LibRaw_sony_cameratypes_LIBRAW_SONY_DSLR: LibRaw_sony_cameratypes = 2;
pub const LibRaw_sony_cameratypes_LIBRAW_SONY_NEX: LibRaw_sony_cameratypes = 3;
pub const LibRaw_sony_cameratypes_LIBRAW_SONY_SLT: LibRaw_sony_cameratypes = 4;
pub const LibRaw_sony_cameratypes_LIBRAW_SONY_ILCE: LibRaw_sony_cameratypes = 5;
pub const LibRaw_sony_cameratypes_LIBRAW_SONY_ILCA: LibRaw_sony_cameratypes = 6;
pub const LibRaw_sony_cameratypes_LIBRAW_SONY_CameraType_UNKNOWN: LibRaw_sony_cameratypes = 65535;
pub type LibRaw_sony_cameratypes = ::std::os::raw::c_uint;
pub const LibRaw_Sony_0x2010_Type_LIBRAW_SONY_Tag2010None: LibRaw_Sony_0x2010_Type = 0;
pub const LibRaw_Sony_0x2010_Type_LIBRAW_SONY_Tag2010a: LibRaw_Sony_0x2010_Type = 1;
pub const LibRaw_Sony_0x2010_Type_LIBRAW_SONY_Tag2010b: LibRaw_Sony_0x2010_Type = 2;
pub const LibRaw_Sony_0x2010_Type_LIBRAW_SONY_Tag2010c: LibRaw_Sony_0x2010_Type = 3;
pub const LibRaw_Sony_0x2010_Type_LIBRAW_SONY_Tag2010d: LibRaw_Sony_0x2010_Type = 4;
pub const LibRaw_Sony_0x2010_Type_LIBRAW_SONY_Tag2010e: LibRaw_Sony_0x2010_Type = 5;
pub const LibRaw_Sony_0x2010_Type_LIBRAW_SONY_Tag2010f: LibRaw_Sony_0x2010_Type = 6;
pub const LibRaw_Sony_0x2010_Type_LIBRAW_SONY_Tag2010g: LibRaw_Sony_0x2010_Type = 7;
pub const LibRaw_Sony_0x2010_Type_LIBRAW_SONY_Tag2010h: LibRaw_Sony_0x2010_Type = 8;
pub const LibRaw_Sony_0x2010_Type_LIBRAW_SONY_Tag2010i: LibRaw_Sony_0x2010_Type = 9;
pub type LibRaw_Sony_0x2010_Type = ::std::os::raw::c_uint;
pub const LibRaw_Sony_0x9050_Type_LIBRAW_SONY_Tag9050None: LibRaw_Sony_0x9050_Type = 0;
pub const LibRaw_Sony_0x9050_Type_LIBRAW_SONY_Tag9050a: LibRaw_Sony_0x9050_Type = 1;
pub const LibRaw_Sony_0x9050_Type_LIBRAW_SONY_Tag9050b: LibRaw_Sony_0x9050_Type = 2;
pub const LibRaw_Sony_0x9050_Type_LIBRAW_SONY_Tag9050c: LibRaw_Sony_0x9050_Type = 3;
pub const LibRaw_Sony_0x9050_Type_LIBRAW_SONY_Tag9050d: LibRaw_Sony_0x9050_Type = 4;
pub type LibRaw_Sony_0x9050_Type = ::std::os::raw::c_uint;
pub const LIBRAW_SONY_FOCUSMODEmodes_LIBRAW_SONY_FOCUSMODE_MF: LIBRAW_SONY_FOCUSMODEmodes = 0;
pub const LIBRAW_SONY_FOCUSMODEmodes_LIBRAW_SONY_FOCUSMODE_AF_S: LIBRAW_SONY_FOCUSMODEmodes = 2;
pub const LIBRAW_SONY_FOCUSMODEmodes_LIBRAW_SONY_FOCUSMODE_AF_C: LIBRAW_SONY_FOCUSMODEmodes = 3;
pub const LIBRAW_SONY_FOCUSMODEmodes_LIBRAW_SONY_FOCUSMODE_AF_A: LIBRAW_SONY_FOCUSMODEmodes = 4;
pub const LIBRAW_SONY_FOCUSMODEmodes_LIBRAW_SONY_FOCUSMODE_DMF: LIBRAW_SONY_FOCUSMODEmodes = 6;
pub const LIBRAW_SONY_FOCUSMODEmodes_LIBRAW_SONY_FOCUSMODE_AF_D: LIBRAW_SONY_FOCUSMODEmodes = 7;
pub const LIBRAW_SONY_FOCUSMODEmodes_LIBRAW_SONY_FOCUSMODE_AF: LIBRAW_SONY_FOCUSMODEmodes = 101;
pub const LIBRAW_SONY_FOCUSMODEmodes_LIBRAW_SONY_FOCUSMODE_PERMANENT_AF:
    LIBRAW_SONY_FOCUSMODEmodes = 104;
pub const LIBRAW_SONY_FOCUSMODEmodes_LIBRAW_SONY_FOCUSMODE_SEMI_MF: LIBRAW_SONY_FOCUSMODEmodes =
    105;
pub const LIBRAW_SONY_FOCUSMODEmodes_LIBRAW_SONY_FOCUSMODE_UNKNOWN: LIBRAW_SONY_FOCUSMODEmodes = -1;
pub type LIBRAW_SONY_FOCUSMODEmodes = ::std::os::raw::c_int;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_UnknownSensor: LibRaw_KodakSensors = 0;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_M1: LibRaw_KodakSensors = 1;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_M15: LibRaw_KodakSensors = 2;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_M16: LibRaw_KodakSensors = 3;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_M17: LibRaw_KodakSensors = 4;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_M2: LibRaw_KodakSensors = 5;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_M23: LibRaw_KodakSensors = 6;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_M24: LibRaw_KodakSensors = 7;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_M3: LibRaw_KodakSensors = 8;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_M5: LibRaw_KodakSensors = 9;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_M6: LibRaw_KodakSensors = 10;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_C14: LibRaw_KodakSensors = 11;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_X14: LibRaw_KodakSensors = 12;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_M11: LibRaw_KodakSensors = 13;
pub type LibRaw_KodakSensors = ::std::os::raw::c_uint;
pub const LibRaw_HasselbladFormatCodes_LIBRAW_HF_Unknown: LibRaw_HasselbladFormatCodes = 0;
pub const LibRaw_HasselbladFormatCodes_LIBRAW_HF_3FR: LibRaw_HasselbladFormatCodes = 1;
pub const LibRaw_HasselbladFormatCodes_LIBRAW_HF_FFF: LibRaw_HasselbladFormatCodes = 2;
pub const LibRaw_HasselbladFormatCodes_LIBRAW_HF_Imacon: LibRaw_HasselbladFormatCodes = 3;
pub const LibRaw_HasselbladFormatCodes_LIBRAW_HF_HasselbladDNG: LibRaw_HasselbladFormatCodes = 4;
pub const LibRaw_HasselbladFormatCodes_LIBRAW_HF_AdobeDNG: LibRaw_HasselbladFormatCodes = 5;
pub const LibRaw_HasselbladFormatCodes_LIBRAW_HF_AdobeDNG_fromPhocusDNG:
    LibRaw_HasselbladFormatCodes = 6;
pub type LibRaw_HasselbladFormatCodes = ::std::os::raw::c_uint;
pub const LibRaw_rawspecial_t_LIBRAW_RAWSPECIAL_SONYARW2_NONE: LibRaw_rawspecial_t = 0;
pub const LibRaw_rawspecial_t_LIBRAW_RAWSPECIAL_SONYARW2_BASEONLY: LibRaw_rawspecial_t = 1;
pub const LibRaw_rawspecial_t_LIBRAW_RAWSPECIAL_SONYARW2_DELTAONLY: LibRaw_rawspecial_t = 2;
pub const LibRaw_rawspecial_t_LIBRAW_RAWSPECIAL_SONYARW2_DELTAZEROBASE: LibRaw_rawspecial_t = 4;
pub const LibRaw_rawspecial_t_LIBRAW_RAWSPECIAL_SONYARW2_DELTATOVALUE: LibRaw_rawspecial_t = 8;
pub const LibRaw_rawspecial_t_LIBRAW_RAWSPECIAL_SONYARW2_ALLFLAGS: LibRaw_rawspecial_t = 15;
pub const LibRaw_rawspecial_t_LIBRAW_RAWSPECIAL_NODP2Q_INTERPOLATERG: LibRaw_rawspecial_t = 16;
pub const LibRaw_rawspecial_t_LIBRAW_RAWSPECIAL_NODP2Q_INTERPOLATEAF: LibRaw_rawspecial_t = 32;
pub const LibRaw_rawspecial_t_LIBRAW_RAWSPECIAL_SRAW_NO_RGB: LibRaw_rawspecial_t = 64;
pub const LibRaw_rawspecial_t_LIBRAW_RAWSPECIAL_SRAW_NO_INTERPOLATE: LibRaw_rawspecial_t = 128;
pub type LibRaw_rawspecial_t = ::std::os::raw::c_uint;
pub const LibRaw_rawspeed_bits_t_LIBRAW_RAWSPEEDV1_USE: LibRaw_rawspeed_bits_t = 1;
pub const LibRaw_rawspeed_bits_t_LIBRAW_RAWSPEEDV1_FAILONUNKNOWN: LibRaw_rawspeed_bits_t = 2;
pub const LibRaw_rawspeed_bits_t_LIBRAW_RAWSPEEDV1_IGNOREERRORS: LibRaw_rawspeed_bits_t = 4;
pub const LibRaw_rawspeed_bits_t_LIBRAW_RAWSPEEDV3_USE: LibRaw_rawspeed_bits_t = 256;
pub const LibRaw_rawspeed_bits_t_LIBRAW_RAWSPEEDV3_FAILONUNKNOWN: LibRaw_rawspeed_bits_t = 512;
pub const LibRaw_rawspeed_bits_t_LIBRAW_RAWSPEEDV3_IGNOREERRORS: LibRaw_rawspeed_bits_t = 1024;
pub type LibRaw_rawspeed_bits_t = ::std::os::raw::c_uint;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_PENTAX_PS_ALLFRAMES:
    LibRaw_processing_options = 1;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_CONVERTFLOAT_TO_INT:
    LibRaw_processing_options = 2;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_ARQ_SKIP_CHANNEL_SWAP:
    LibRaw_processing_options = 4;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_NO_ROTATE_FOR_KODAK_THUMBNAILS:
    LibRaw_processing_options = 8;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_USE_PPM16_THUMBS: LibRaw_processing_options =
    32;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_DONT_CHECK_DNG_ILLUMINANT:
    LibRaw_processing_options = 64;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_DNGSDK_ZEROCOPY: LibRaw_processing_options =
    128;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_ZEROFILTERS_FOR_MONOCHROMETIFFS:
    LibRaw_processing_options = 256;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_DNG_ADD_ENHANCED: LibRaw_processing_options =
    512;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_DNG_ADD_PREVIEWS: LibRaw_processing_options =
    1024;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_DNG_PREFER_LARGEST_IMAGE:
    LibRaw_processing_options = 2048;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_DNG_STAGE2: LibRaw_processing_options = 4096;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_DNG_STAGE3: LibRaw_processing_options = 8192;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_DNG_ALLOWSIZECHANGE:
    LibRaw_processing_options = 16384;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_DNG_DISABLEWBADJUST:
    LibRaw_processing_options = 32768;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_PROVIDE_NONSTANDARD_WB:
    LibRaw_processing_options = 65536;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_CAMERAWB_FALLBACK_TO_DAYLIGHT:
    LibRaw_processing_options = 131072;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_CHECK_THUMBNAILS_KNOWN_VENDORS:
    LibRaw_processing_options = 262144;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_CHECK_THUMBNAILS_ALL_VENDORS:
    LibRaw_processing_options = 524288;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_DNG_STAGE2_IFPRESENT:
    LibRaw_processing_options = 1048576;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_DNG_STAGE3_IFPRESENT:
    LibRaw_processing_options = 2097152;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_DNG_ADD_MASKS: LibRaw_processing_options =
    4194304;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_CANON_IGNORE_MAKERNOTES_ROTATION:
    LibRaw_processing_options = 8388608;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_ALLOW_JPEGXL_PREVIEWS:
    LibRaw_processing_options = 16777216;
pub type LibRaw_processing_options = ::std::os::raw::c_uint;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_HASCURVE: LibRaw_decoder_flags = 16;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_SONYARW2: LibRaw_decoder_flags = 32;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_TRYRAWSPEED: LibRaw_decoder_flags = 64;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_OWNALLOC: LibRaw_decoder_flags = 128;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_FIXEDMAXC: LibRaw_decoder_flags = 256;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_ADOBECOPYPIXEL: LibRaw_decoder_flags = 512;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_LEGACY_WITH_MARGINS: LibRaw_decoder_flags = 1024;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_3CHANNEL: LibRaw_decoder_flags = 2048;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_SINAR4SHOT: LibRaw_decoder_flags = 2048;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_FLATDATA: LibRaw_decoder_flags = 4096;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_FLAT_BG2_SWAPPED: LibRaw_decoder_flags = 8192;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_UNSUPPORTED_FORMAT: LibRaw_decoder_flags = 16384;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_NOTSET: LibRaw_decoder_flags = 32768;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_TRYRAWSPEED3: LibRaw_decoder_flags = 65536;
pub type LibRaw_decoder_flags = ::std::os::raw::c_uint;
pub const LibRaw_constructor_flags_LIBRAW_OPTIONS_NONE: LibRaw_constructor_flags = 0;
pub const LibRaw_constructor_flags_LIBRAW_OPTIONS_NO_DATAERR_CALLBACK: LibRaw_constructor_flags = 2;
pub const LibRaw_constructor_flags_LIBRAW_OPIONS_NO_DATAERR_CALLBACK: LibRaw_constructor_flags = 2;
pub type LibRaw_constructor_flags = ::std::os::raw::c_uint;
pub const LibRaw_warnings_LIBRAW_WARN_NONE: LibRaw_warnings = 0;
pub const LibRaw_warnings_LIBRAW_WARN_BAD_CAMERA_WB: LibRaw_warnings = 4;
pub const LibRaw_warnings_LIBRAW_WARN_NO_METADATA: LibRaw_warnings = 8;
pub const LibRaw_warnings_LIBRAW_WARN_NO_JPEGLIB: LibRaw_warnings = 16;
pub const LibRaw_warnings_LIBRAW_WARN_NO_EMBEDDED_PROFILE: LibRaw_warnings = 32;
pub const LibRaw_warnings_LIBRAW_WARN_NO_INPUT_PROFILE: LibRaw_warnings = 64;
pub const LibRaw_warnings_LIBRAW_WARN_BAD_OUTPUT_PROFILE: LibRaw_warnings = 128;
pub const LibRaw_warnings_LIBRAW_WARN_NO_BADPIXELMAP: LibRaw_warnings = 256;
pub const LibRaw_warnings_LIBRAW_WARN_BAD_DARKFRAME_FILE: LibRaw_warnings = 512;
pub const LibRaw_warnings_LIBRAW_WARN_BAD_DARKFRAME_DIM: LibRaw_warnings = 1024;
pub const LibRaw_warnings_LIBRAW_WARN_RAWSPEED_PROBLEM: LibRaw_warnings = 4096;
pub const LibRaw_warnings_LIBRAW_WARN_RAWSPEED_UNSUPPORTED: LibRaw_warnings = 8192;
pub const LibRaw_warnings_LIBRAW_WARN_RAWSPEED_PROCESSED: LibRaw_warnings = 16384;
pub const LibRaw_warnings_LIBRAW_WARN_FALLBACK_TO_AHD: LibRaw_warnings = 32768;
pub const LibRaw_warnings_LIBRAW_WARN_PARSEFUJI_PROCESSED: LibRaw_warnings = 65536;
pub const LibRaw_warnings_LIBRAW_WARN_DNGSDK_PROCESSED: LibRaw_warnings = 131072;
pub const LibRaw_warnings_LIBRAW_WARN_DNG_IMAGES_REORDERED: LibRaw_warnings = 262144;
pub const LibRaw_warnings_LIBRAW_WARN_DNG_STAGE2_APPLIED: LibRaw_warnings = 524288;
pub const LibRaw_warnings_LIBRAW_WARN_DNG_STAGE3_APPLIED: LibRaw_warnings = 1048576;
pub const LibRaw_warnings_LIBRAW_WARN_RAWSPEED3_PROBLEM: LibRaw_warnings = 2097152;
pub const LibRaw_warnings_LIBRAW_WARN_RAWSPEED3_UNSUPPORTED: LibRaw_warnings = 4194304;
pub const LibRaw_warnings_LIBRAW_WARN_RAWSPEED3_PROCESSED: LibRaw_warnings = 8388608;
pub const LibRaw_warnings_LIBRAW_WARN_RAWSPEED3_NOTLISTED: LibRaw_warnings = 16777216;
pub const LibRaw_warnings_LIBRAW_WARN_VENDOR_CROP_SUGGESTED: LibRaw_warnings = 33554432;
pub type LibRaw_warnings = ::std::os::raw::c_uint;
pub const LibRaw_exceptions_LIBRAW_EXCEPTION_NONE: LibRaw_exceptions = 0;
pub const LibRaw_exceptions_LIBRAW_EXCEPTION_ALLOC: LibRaw_exceptions = 1;
pub const LibRaw_exceptions_LIBRAW_EXCEPTION_DECODE_RAW: LibRaw_exceptions = 2;
pub const LibRaw_exceptions_LIBRAW_EXCEPTION_DECODE_JPEG: LibRaw_exceptions = 3;
pub const LibRaw_exceptions_LIBRAW_EXCEPTION_IO_EOF: LibRaw_exceptions = 4;
pub const LibRaw_exceptions_LIBRAW_EXCEPTION_IO_CORRUPT: LibRaw_exceptions = 5;
pub const LibRaw_exceptions_LIBRAW_EXCEPTION_CANCELLED_BY_CALLBACK: LibRaw_exceptions = 6;
pub const LibRaw_exceptions_LIBRAW_EXCEPTION_BAD_CROP: LibRaw_exceptions = 7;
pub const LibRaw_exceptions_LIBRAW_EXCEPTION_IO_BADFILE: LibRaw_exceptions = 8;
pub const LibRaw_exceptions_LIBRAW_EXCEPTION_DECODE_JPEG2000: LibRaw_exceptions = 9;
pub const LibRaw_exceptions_LIBRAW_EXCEPTION_TOOBIG: LibRaw_exceptions = 10;
pub const LibRaw_exceptions_LIBRAW_EXCEPTION_MEMPOOL: LibRaw_exceptions = 11;
pub const LibRaw_exceptions_LIBRAW_EXCEPTION_UNSUPPORTED_FORMAT: LibRaw_exceptions = 12;
pub type LibRaw_exceptions = ::std::os::raw::c_uint;
pub const LibRaw_progress_LIBRAW_PROGRESS_START: LibRaw_progress = 0;
pub const LibRaw_progress_LIBRAW_PROGRESS_OPEN: LibRaw_progress = 1;
pub const LibRaw_progress_LIBRAW_PROGRESS_IDENTIFY: LibRaw_progress = 2;
pub const LibRaw_progress_LIBRAW_PROGRESS_SIZE_ADJUST: LibRaw_progress = 4;
pub const LibRaw_progress_LIBRAW_PROGRESS_LOAD_RAW: LibRaw_progress = 8;
pub const LibRaw_progress_LIBRAW_PROGRESS_RAW2_IMAGE: LibRaw_progress = 16;
pub const LibRaw_progress_LIBRAW_PROGRESS_REMOVE_ZEROES: LibRaw_progress = 32;
pub const LibRaw_progress_LIBRAW_PROGRESS_BAD_PIXELS: LibRaw_progress = 64;
pub const LibRaw_progress_LIBRAW_PROGRESS_DARK_FRAME: LibRaw_progress = 128;
pub const LibRaw_progress_LIBRAW_PROGRESS_FOVEON_INTERPOLATE: LibRaw_progress = 256;
pub const LibRaw_progress_LIBRAW_PROGRESS_SCALE_COLORS: LibRaw_progress = 512;
pub const LibRaw_progress_LIBRAW_PROGRESS_PRE_INTERPOLATE: LibRaw_progress = 1024;
pub const LibRaw_progress_LIBRAW_PROGRESS_INTERPOLATE: LibRaw_progress = 2048;
pub const LibRaw_progress_LIBRAW_PROGRESS_MIX_GREEN: LibRaw_progress = 4096;
pub const LibRaw_progress_LIBRAW_PROGRESS_MEDIAN_FILTER: LibRaw_progress = 8192;
pub const LibRaw_progress_LIBRAW_PROGRESS_HIGHLIGHTS: LibRaw_progress = 16384;
pub const LibRaw_progress_LIBRAW_PROGRESS_FUJI_ROTATE: LibRaw_progress = 32768;
pub const LibRaw_progress_LIBRAW_PROGRESS_FLIP: LibRaw_progress = 65536;
pub const LibRaw_progress_LIBRAW_PROGRESS_APPLY_PROFILE: LibRaw_progress = 131072;
pub const LibRaw_progress_LIBRAW_PROGRESS_CONVERT_RGB: LibRaw_progress = 262144;
pub const LibRaw_progress_LIBRAW_PROGRESS_STRETCH: LibRaw_progress = 524288;
pub const LibRaw_progress_LIBRAW_PROGRESS_STAGE20: LibRaw_progress = 1048576;
pub const LibRaw_progress_LIBRAW_PROGRESS_STAGE21: LibRaw_progress = 2097152;
pub const LibRaw_progress_LIBRAW_PROGRESS_STAGE22: LibRaw_progress = 4194304;
pub const LibRaw_progress_LIBRAW_PROGRESS_STAGE23: LibRaw_progress = 8388608;
pub const LibRaw_progress_LIBRAW_PROGRESS_STAGE24: LibRaw_progress = 16777216;
pub const LibRaw_progress_LIBRAW_PROGRESS_STAGE25: LibRaw_progress = 33554432;
pub const LibRaw_progress_LIBRAW_PROGRESS_STAGE26: LibRaw_progress = 67108864;
pub const LibRaw_progress_LIBRAW_PROGRESS_STAGE27: LibRaw_progress = 134217728;
pub const LibRaw_progress_LIBRAW_PROGRESS_THUMB_LOAD: LibRaw_progress = 268435456;
pub const LibRaw_progress_LIBRAW_PROGRESS_TRESERVED1: LibRaw_progress = 536870912;
pub const LibRaw_progress_LIBRAW_PROGRESS_TRESERVED2: LibRaw_progress = 1073741824;
pub type LibRaw_progress = ::std::os::raw::c_uint;
pub const LibRaw_errors_LIBRAW_SUCCESS: LibRaw_errors = 0;
pub const LibRaw_errors_LIBRAW_UNSPECIFIED_ERROR: LibRaw_errors = -1;
pub const LibRaw_errors_LIBRAW_FILE_UNSUPPORTED: LibRaw_errors = -2;
pub const LibRaw_errors_LIBRAW_REQUEST_FOR_NONEXISTENT_IMAGE: LibRaw_errors = -3;
pub const LibRaw_errors_LIBRAW_OUT_OF_ORDER_CALL: LibRaw_errors = -4;
pub const LibRaw_errors_LIBRAW_NO_THUMBNAIL: LibRaw_errors = -5;
pub const LibRaw_errors_LIBRAW_UNSUPPORTED_THUMBNAIL: LibRaw_errors = -6;
pub const LibRaw_errors_LIBRAW_INPUT_CLOSED: LibRaw_errors = -7;
pub const LibRaw_errors_LIBRAW_NOT_IMPLEMENTED: LibRaw_errors = -8;
pub const LibRaw_errors_LIBRAW_REQUEST_FOR_NONEXISTENT_THUMBNAIL: LibRaw_errors = -9;
pub const LibRaw_errors_LIBRAW_UNSUFFICIENT_MEMORY: LibRaw_errors = -100007;
pub const LibRaw_errors_LIBRAW_DATA_ERROR: LibRaw_errors = -100008;
pub const LibRaw_errors_LIBRAW_IO_ERROR: LibRaw_errors = -100009;
pub const LibRaw_errors_LIBRAW_CANCELLED_BY_CALLBACK: LibRaw_errors = -100010;
pub const LibRaw_errors_LIBRAW_BAD_CROP: LibRaw_errors = -100011;
pub const LibRaw_errors_LIBRAW_TOO_BIG: LibRaw_errors = -100012;
pub const LibRaw_errors_LIBRAW_MEMPOOL_OVERFLOW: LibRaw_errors = -100013;
pub type LibRaw_errors = ::std::os::raw::c_int;
pub const LibRaw_internal_thumbnail_formats_LIBRAW_INTERNAL_THUMBNAIL_UNKNOWN:
    LibRaw_internal_thumbnail_formats = 0;
pub const LibRaw_internal_thumbnail_formats_LIBRAW_INTERNAL_THUMBNAIL_KODAK_THUMB:
    LibRaw_internal_thumbnail_formats = 1;
pub const LibRaw_internal_thumbnail_formats_LIBRAW_INTERNAL_THUMBNAIL_KODAK_YCBCR:
    LibRaw_internal_thumbnail_formats = 2;
pub const LibRaw_internal_thumbnail_formats_LIBRAW_INTERNAL_THUMBNAIL_KODAK_RGB:
    LibRaw_internal_thumbnail_formats = 3;
pub const LibRaw_internal_thumbnail_formats_LIBRAW_INTERNAL_THUMBNAIL_JPEG:
    LibRaw_internal_thumbnail_formats = 4;
pub const LibRaw_internal_thumbnail_formats_LIBRAW_INTERNAL_THUMBNAIL_LAYER:
    LibRaw_internal_thumbnail_formats = 5;
pub const LibRaw_internal_thumbnail_formats_LIBRAW_INTERNAL_THUMBNAIL_ROLLEI:
    LibRaw_internal_thumbnail_formats = 6;
pub const LibRaw_internal_thumbnail_formats_LIBRAW_INTERNAL_THUMBNAIL_PPM:
    LibRaw_internal_thumbnail_formats = 7;
pub const LibRaw_internal_thumbnail_formats_LIBRAW_INTERNAL_THUMBNAIL_PPM16:
    LibRaw_internal_thumbnail_formats = 8;
pub const LibRaw_internal_thumbnail_formats_LIBRAW_INTERNAL_THUMBNAIL_X3F:
    LibRaw_internal_thumbnail_formats = 9;
pub const LibRaw_internal_thumbnail_formats_LIBRAW_INTERNAL_THUMBNAIL_DNG_YCBCR:
    LibRaw_internal_thumbnail_formats = 10;
pub const LibRaw_internal_thumbnail_formats_LIBRAW_INTERNAL_THUMBNAIL_JPEGXL:
    LibRaw_internal_thumbnail_formats = 11;
pub type LibRaw_internal_thumbnail_formats = ::std::os::raw::c_uint;
pub const LibRaw_thumbnail_formats_LIBRAW_THUMBNAIL_UNKNOWN: LibRaw_thumbnail_formats = 0;
pub const LibRaw_thumbnail_formats_LIBRAW_THUMBNAIL_JPEG: LibRaw_thumbnail_formats = 1;
pub const LibRaw_thumbnail_formats_LIBRAW_THUMBNAIL_BITMAP: LibRaw_thumbnail_formats = 2;
pub const LibRaw_thumbnail_formats_LIBRAW_THUMBNAIL_BITMAP16: LibRaw_thumbnail_formats = 3;
pub const LibRaw_thumbnail_formats_LIBRAW_THUMBNAIL_LAYER: LibRaw_thumbnail_formats = 4;
pub const LibRaw_thumbnail_formats_LIBRAW_THUMBNAIL_ROLLEI: LibRaw_thumbnail_formats = 5;
pub const LibRaw_thumbnail_formats_LIBRAW_THUMBNAIL_H265: LibRaw_thumbnail_formats = 6;
pub const LibRaw_thumbnail_formats_LIBRAW_THUMBNAIL_JPEGXL: LibRaw_thumbnail_formats = 7;
pub type LibRaw_thumbnail_formats = ::std::os::raw::c_uint;
pub const LibRaw_image_formats_LIBRAW_IMAGE_JPEG: LibRaw_image_formats = 1;
pub const LibRaw_image_formats_LIBRAW_IMAGE_BITMAP: LibRaw_image_formats = 2;
pub const LibRaw_image_formats_LIBRAW_IMAGE_JPEGXL: LibRaw_image_formats = 3;
pub const LibRaw_image_formats_LIBRAW_IMAGE_H265: LibRaw_image_formats = 4;
pub type LibRaw_image_formats = ::std::os::raw::c_uint;
pub type INT64 = ::std::os::raw::c_longlong;
pub type UINT64 = ::std::os::raw::c_ulonglong;
pub type uchar = ::std::os::raw::c_uchar;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_decoder_info_t {
    pub decoder_name: *const ::std::os::raw::c_char,
    pub decoder_flags: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_decoder_info_t"][::std::mem::size_of::<libraw_decoder_info_t>() - 16usize];
    ["Alignment of libraw_decoder_info_t"]
        [::std::mem::align_of::<libraw_decoder_info_t>() - 8usize];
    ["Offset of field: libraw_decoder_info_t::decoder_name"]
        [::std::mem::offset_of!(libraw_decoder_info_t, decoder_name) - 0usize];
    ["Offset of field: libraw_decoder_info_t::decoder_flags"]
        [::std::mem::offset_of!(libraw_decoder_info_t, decoder_flags) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_internal_output_params_t {
    pub mix_green: ::std::os::raw::c_uint,
    pub raw_color: ::std::os::raw::c_uint,
    pub zero_is_bad: ::std::os::raw::c_uint,
    pub shrink: ushort,
    pub fuji_width: ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_internal_output_params_t"]
        [::std::mem::size_of::<libraw_internal_output_params_t>() - 16usize];
    ["Alignment of libraw_internal_output_params_t"]
        [::std::mem::align_of::<libraw_internal_output_params_t>() - 4usize];
    ["Offset of field: libraw_internal_output_params_t::mix_green"]
        [::std::mem::offset_of!(libraw_internal_output_params_t, mix_green) - 0usize];
    ["Offset of field: libraw_internal_output_params_t::raw_color"]
        [::std::mem::offset_of!(libraw_internal_output_params_t, raw_color) - 4usize];
    ["Offset of field: libraw_internal_output_params_t::zero_is_bad"]
        [::std::mem::offset_of!(libraw_internal_output_params_t, zero_is_bad) - 8usize];
    ["Offset of field: libraw_internal_output_params_t::shrink"]
        [::std::mem::offset_of!(libraw_internal_output_params_t, shrink) - 12usize];
    ["Offset of field: libraw_internal_output_params_t::fuji_width"]
        [::std::mem::offset_of!(libraw_internal_output_params_t, fuji_width) - 14usize];
};
pub type memory_callback = ::std::option::Option<
    unsafe extern "C" fn(
        data: *mut ::std::os::raw::c_void,
        file: *const ::std::os::raw::c_char,
        where_: *const ::std::os::raw::c_char,
    ),
>;
pub type exif_parser_callback = ::std::option::Option<
    unsafe extern "C" fn(
        context: *mut ::std::os::raw::c_void,
        tag: ::std::os::raw::c_int,
        type_: ::std::os::raw::c_int,
        len: ::std::os::raw::c_int,
        ord: ::std::os::raw::c_uint,
        ifp: *mut ::std::os::raw::c_void,
        base: INT64,
    ),
>;
pub type data_callback = ::std::option::Option<
    unsafe extern "C" fn(
        data: *mut ::std::os::raw::c_void,
        file: *const ::std::os::raw::c_char,
        offset: ::std::os::raw::c_int,
    ),
>;
unsafe extern "C" {
    pub fn default_data_callback(
        data: *mut ::std::os::raw::c_void,
        file: *const ::std::os::raw::c_char,
        offset: ::std::os::raw::c_int,
    );
}
pub type progress_callback = ::std::option::Option<
    unsafe extern "C" fn(
        data: *mut ::std::os::raw::c_void,
        stage: LibRaw_progress,
        iteration: ::std::os::raw::c_int,
        expected: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type pre_identify_callback = ::std::option::Option<
    unsafe extern "C" fn(ctx: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
>;
pub type post_identify_callback =
    ::std::option::Option<unsafe extern "C" fn(ctx: *mut ::std::os::raw::c_void)>;
pub type process_step_callback =
    ::std::option::Option<unsafe extern "C" fn(ctx: *mut ::std::os::raw::c_void)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_callbacks_t {
    pub data_cb: data_callback,
    pub datacb_data: *mut ::std::os::raw::c_void,
    pub progress_cb: progress_callback,
    pub progresscb_data: *mut ::std::os::raw::c_void,
    pub exif_cb: exif_parser_callback,
    pub exifparser_data: *mut ::std::os::raw::c_void,
    pub pre_identify_cb: pre_identify_callback,
    pub post_identify_cb: post_identify_callback,
    pub pre_subtractblack_cb: process_step_callback,
    pub pre_scalecolors_cb: process_step_callback,
    pub pre_preinterpolate_cb: process_step_callback,
    pub pre_interpolate_cb: process_step_callback,
    pub interpolate_bayer_cb: process_step_callback,
    pub interpolate_xtrans_cb: process_step_callback,
    pub post_interpolate_cb: process_step_callback,
    pub pre_converttorgb_cb: process_step_callback,
    pub post_converttorgb_cb: process_step_callback,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_callbacks_t"][::std::mem::size_of::<libraw_callbacks_t>() - 136usize];
    ["Alignment of libraw_callbacks_t"][::std::mem::align_of::<libraw_callbacks_t>() - 8usize];
    ["Offset of field: libraw_callbacks_t::data_cb"]
        [::std::mem::offset_of!(libraw_callbacks_t, data_cb) - 0usize];
    ["Offset of field: libraw_callbacks_t::datacb_data"]
        [::std::mem::offset_of!(libraw_callbacks_t, datacb_data) - 8usize];
    ["Offset of field: libraw_callbacks_t::progress_cb"]
        [::std::mem::offset_of!(libraw_callbacks_t, progress_cb) - 16usize];
    ["Offset of field: libraw_callbacks_t::progresscb_data"]
        [::std::mem::offset_of!(libraw_callbacks_t, progresscb_data) - 24usize];
    ["Offset of field: libraw_callbacks_t::exif_cb"]
        [::std::mem::offset_of!(libraw_callbacks_t, exif_cb) - 32usize];
    ["Offset of field: libraw_callbacks_t::exifparser_data"]
        [::std::mem::offset_of!(libraw_callbacks_t, exifparser_data) - 40usize];
    ["Offset of field: libraw_callbacks_t::pre_identify_cb"]
        [::std::mem::offset_of!(libraw_callbacks_t, pre_identify_cb) - 48usize];
    ["Offset of field: libraw_callbacks_t::post_identify_cb"]
        [::std::mem::offset_of!(libraw_callbacks_t, post_identify_cb) - 56usize];
    ["Offset of field: libraw_callbacks_t::pre_subtractblack_cb"]
        [::std::mem::offset_of!(libraw_callbacks_t, pre_subtractblack_cb) - 64usize];
    ["Offset of field: libraw_callbacks_t::pre_scalecolors_cb"]
        [::std::mem::offset_of!(libraw_callbacks_t, pre_scalecolors_cb) - 72usize];
    ["Offset of field: libraw_callbacks_t::pre_preinterpolate_cb"]
        [::std::mem::offset_of!(libraw_callbacks_t, pre_preinterpolate_cb) - 80usize];
    ["Offset of field: libraw_callbacks_t::pre_interpolate_cb"]
        [::std::mem::offset_of!(libraw_callbacks_t, pre_interpolate_cb) - 88usize];
    ["Offset of field: libraw_callbacks_t::interpolate_bayer_cb"]
        [::std::mem::offset_of!(libraw_callbacks_t, interpolate_bayer_cb) - 96usize];
    ["Offset of field: libraw_callbacks_t::interpolate_xtrans_cb"]
        [::std::mem::offset_of!(libraw_callbacks_t, interpolate_xtrans_cb) - 104usize];
    ["Offset of field: libraw_callbacks_t::post_interpolate_cb"]
        [::std::mem::offset_of!(libraw_callbacks_t, post_interpolate_cb) - 112usize];
    ["Offset of field: libraw_callbacks_t::pre_converttorgb_cb"]
        [::std::mem::offset_of!(libraw_callbacks_t, pre_converttorgb_cb) - 120usize];
    ["Offset of field: libraw_callbacks_t::post_converttorgb_cb"]
        [::std::mem::offset_of!(libraw_callbacks_t, post_converttorgb_cb) - 128usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_processed_image_t {
    pub type_: LibRaw_image_formats,
    pub height: ushort,
    pub width: ushort,
    pub colors: ushort,
    pub bits: ushort,
    pub data_size: ::std::os::raw::c_uint,
    pub data: [::std::os::raw::c_uchar; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_processed_image_t"]
        [::std::mem::size_of::<libraw_processed_image_t>() - 20usize];
    ["Alignment of libraw_processed_image_t"]
        [::std::mem::align_of::<libraw_processed_image_t>() - 4usize];
    ["Offset of field: libraw_processed_image_t::type_"]
        [::std::mem::offset_of!(libraw_processed_image_t, type_) - 0usize];
    ["Offset of field: libraw_processed_image_t::height"]
        [::std::mem::offset_of!(libraw_processed_image_t, height) - 4usize];
    ["Offset of field: libraw_processed_image_t::width"]
        [::std::mem::offset_of!(libraw_processed_image_t, width) - 6usize];
    ["Offset of field: libraw_processed_image_t::colors"]
        [::std::mem::offset_of!(libraw_processed_image_t, colors) - 8usize];
    ["Offset of field: libraw_processed_image_t::bits"]
        [::std::mem::offset_of!(libraw_processed_image_t, bits) - 10usize];
    ["Offset of field: libraw_processed_image_t::data_size"]
        [::std::mem::offset_of!(libraw_processed_image_t, data_size) - 12usize];
    ["Offset of field: libraw_processed_image_t::data"]
        [::std::mem::offset_of!(libraw_processed_image_t, data) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_iparams_t {
    pub guard: [::std::os::raw::c_char; 4usize],
    pub make: [::std::os::raw::c_char; 64usize],
    pub model: [::std::os::raw::c_char; 64usize],
    pub software: [::std::os::raw::c_char; 64usize],
    pub normalized_make: [::std::os::raw::c_char; 64usize],
    pub normalized_model: [::std::os::raw::c_char; 64usize],
    pub maker_index: ::std::os::raw::c_uint,
    pub raw_count: ::std::os::raw::c_uint,
    pub dng_version: ::std::os::raw::c_uint,
    pub is_foveon: ::std::os::raw::c_uint,
    pub colors: ::std::os::raw::c_int,
    pub filters: ::std::os::raw::c_uint,
    pub xtrans: [[::std::os::raw::c_char; 6usize]; 6usize],
    pub xtrans_abs: [[::std::os::raw::c_char; 6usize]; 6usize],
    pub cdesc: [::std::os::raw::c_char; 5usize],
    pub xmplen: ::std::os::raw::c_uint,
    pub xmpdata: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_iparams_t"][::std::mem::size_of::<libraw_iparams_t>() - 440usize];
    ["Alignment of libraw_iparams_t"][::std::mem::align_of::<libraw_iparams_t>() - 8usize];
    ["Offset of field: libraw_iparams_t::guard"]
        [::std::mem::offset_of!(libraw_iparams_t, guard) - 0usize];
    ["Offset of field: libraw_iparams_t::make"]
        [::std::mem::offset_of!(libraw_iparams_t, make) - 4usize];
    ["Offset of field: libraw_iparams_t::model"]
        [::std::mem::offset_of!(libraw_iparams_t, model) - 68usize];
    ["Offset of field: libraw_iparams_t::software"]
        [::std::mem::offset_of!(libraw_iparams_t, software) - 132usize];
    ["Offset of field: libraw_iparams_t::normalized_make"]
        [::std::mem::offset_of!(libraw_iparams_t, normalized_make) - 196usize];
    ["Offset of field: libraw_iparams_t::normalized_model"]
        [::std::mem::offset_of!(libraw_iparams_t, normalized_model) - 260usize];
    ["Offset of field: libraw_iparams_t::maker_index"]
        [::std::mem::offset_of!(libraw_iparams_t, maker_index) - 324usize];
    ["Offset of field: libraw_iparams_t::raw_count"]
        [::std::mem::offset_of!(libraw_iparams_t, raw_count) - 328usize];
    ["Offset of field: libraw_iparams_t::dng_version"]
        [::std::mem::offset_of!(libraw_iparams_t, dng_version) - 332usize];
    ["Offset of field: libraw_iparams_t::is_foveon"]
        [::std::mem::offset_of!(libraw_iparams_t, is_foveon) - 336usize];
    ["Offset of field: libraw_iparams_t::colors"]
        [::std::mem::offset_of!(libraw_iparams_t, colors) - 340usize];
    ["Offset of field: libraw_iparams_t::filters"]
        [::std::mem::offset_of!(libraw_iparams_t, filters) - 344usize];
    ["Offset of field: libraw_iparams_t::xtrans"]
        [::std::mem::offset_of!(libraw_iparams_t, xtrans) - 348usize];
    ["Offset of field: libraw_iparams_t::xtrans_abs"]
        [::std::mem::offset_of!(libraw_iparams_t, xtrans_abs) - 384usize];
    ["Offset of field: libraw_iparams_t::cdesc"]
        [::std::mem::offset_of!(libraw_iparams_t, cdesc) - 420usize];
    ["Offset of field: libraw_iparams_t::xmplen"]
        [::std::mem::offset_of!(libraw_iparams_t, xmplen) - 428usize];
    ["Offset of field: libraw_iparams_t::xmpdata"]
        [::std::mem::offset_of!(libraw_iparams_t, xmpdata) - 432usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_raw_inset_crop_t {
    pub cleft: ushort,
    pub ctop: ushort,
    pub cwidth: ushort,
    pub cheight: ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_raw_inset_crop_t"][::std::mem::size_of::<libraw_raw_inset_crop_t>() - 8usize];
    ["Alignment of libraw_raw_inset_crop_t"]
        [::std::mem::align_of::<libraw_raw_inset_crop_t>() - 2usize];
    ["Offset of field: libraw_raw_inset_crop_t::cleft"]
        [::std::mem::offset_of!(libraw_raw_inset_crop_t, cleft) - 0usize];
    ["Offset of field: libraw_raw_inset_crop_t::ctop"]
        [::std::mem::offset_of!(libraw_raw_inset_crop_t, ctop) - 2usize];
    ["Offset of field: libraw_raw_inset_crop_t::cwidth"]
        [::std::mem::offset_of!(libraw_raw_inset_crop_t, cwidth) - 4usize];
    ["Offset of field: libraw_raw_inset_crop_t::cheight"]
        [::std::mem::offset_of!(libraw_raw_inset_crop_t, cheight) - 6usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_image_sizes_t {
    pub raw_height: ushort,
    pub raw_width: ushort,
    pub height: ushort,
    pub width: ushort,
    pub top_margin: ushort,
    pub left_margin: ushort,
    pub iheight: ushort,
    pub iwidth: ushort,
    pub raw_pitch: ::std::os::raw::c_uint,
    pub pixel_aspect: f64,
    pub flip: ::std::os::raw::c_int,
    pub mask: [[::std::os::raw::c_int; 4usize]; 8usize],
    pub raw_aspect: ushort,
    pub raw_inset_crops: [libraw_raw_inset_crop_t; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_image_sizes_t"][::std::mem::size_of::<libraw_image_sizes_t>() - 184usize];
    ["Alignment of libraw_image_sizes_t"][::std::mem::align_of::<libraw_image_sizes_t>() - 8usize];
    ["Offset of field: libraw_image_sizes_t::raw_height"]
        [::std::mem::offset_of!(libraw_image_sizes_t, raw_height) - 0usize];
    ["Offset of field: libraw_image_sizes_t::raw_width"]
        [::std::mem::offset_of!(libraw_image_sizes_t, raw_width) - 2usize];
    ["Offset of field: libraw_image_sizes_t::height"]
        [::std::mem::offset_of!(libraw_image_sizes_t, height) - 4usize];
    ["Offset of field: libraw_image_sizes_t::width"]
        [::std::mem::offset_of!(libraw_image_sizes_t, width) - 6usize];
    ["Offset of field: libraw_image_sizes_t::top_margin"]
        [::std::mem::offset_of!(libraw_image_sizes_t, top_margin) - 8usize];
    ["Offset of field: libraw_image_sizes_t::left_margin"]
        [::std::mem::offset_of!(libraw_image_sizes_t, left_margin) - 10usize];
    ["Offset of field: libraw_image_sizes_t::iheight"]
        [::std::mem::offset_of!(libraw_image_sizes_t, iheight) - 12usize];
    ["Offset of field: libraw_image_sizes_t::iwidth"]
        [::std::mem::offset_of!(libraw_image_sizes_t, iwidth) - 14usize];
    ["Offset of field: libraw_image_sizes_t::raw_pitch"]
        [::std::mem::offset_of!(libraw_image_sizes_t, raw_pitch) - 16usize];
    ["Offset of field: libraw_image_sizes_t::pixel_aspect"]
        [::std::mem::offset_of!(libraw_image_sizes_t, pixel_aspect) - 24usize];
    ["Offset of field: libraw_image_sizes_t::flip"]
        [::std::mem::offset_of!(libraw_image_sizes_t, flip) - 32usize];
    ["Offset of field: libraw_image_sizes_t::mask"]
        [::std::mem::offset_of!(libraw_image_sizes_t, mask) - 36usize];
    ["Offset of field: libraw_image_sizes_t::raw_aspect"]
        [::std::mem::offset_of!(libraw_image_sizes_t, raw_aspect) - 164usize];
    ["Offset of field: libraw_image_sizes_t::raw_inset_crops"]
        [::std::mem::offset_of!(libraw_image_sizes_t, raw_inset_crops) - 166usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_area_t {
    pub t: ::std::os::raw::c_short,
    pub l: ::std::os::raw::c_short,
    pub b: ::std::os::raw::c_short,
    pub r: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_area_t"][::std::mem::size_of::<libraw_area_t>() - 8usize];
    ["Alignment of libraw_area_t"][::std::mem::align_of::<libraw_area_t>() - 2usize];
    ["Offset of field: libraw_area_t::t"][::std::mem::offset_of!(libraw_area_t, t) - 0usize];
    ["Offset of field: libraw_area_t::l"][::std::mem::offset_of!(libraw_area_t, l) - 2usize];
    ["Offset of field: libraw_area_t::b"][::std::mem::offset_of!(libraw_area_t, b) - 4usize];
    ["Offset of field: libraw_area_t::r"][::std::mem::offset_of!(libraw_area_t, r) - 6usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ph1_t {
    pub format: ::std::os::raw::c_int,
    pub key_off: ::std::os::raw::c_int,
    pub tag_21a: ::std::os::raw::c_int,
    pub t_black: ::std::os::raw::c_int,
    pub split_col: ::std::os::raw::c_int,
    pub black_col: ::std::os::raw::c_int,
    pub split_row: ::std::os::raw::c_int,
    pub black_row: ::std::os::raw::c_int,
    pub tag_210: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ph1_t"][::std::mem::size_of::<ph1_t>() - 36usize];
    ["Alignment of ph1_t"][::std::mem::align_of::<ph1_t>() - 4usize];
    ["Offset of field: ph1_t::format"][::std::mem::offset_of!(ph1_t, format) - 0usize];
    ["Offset of field: ph1_t::key_off"][::std::mem::offset_of!(ph1_t, key_off) - 4usize];
    ["Offset of field: ph1_t::tag_21a"][::std::mem::offset_of!(ph1_t, tag_21a) - 8usize];
    ["Offset of field: ph1_t::t_black"][::std::mem::offset_of!(ph1_t, t_black) - 12usize];
    ["Offset of field: ph1_t::split_col"][::std::mem::offset_of!(ph1_t, split_col) - 16usize];
    ["Offset of field: ph1_t::black_col"][::std::mem::offset_of!(ph1_t, black_col) - 20usize];
    ["Offset of field: ph1_t::split_row"][::std::mem::offset_of!(ph1_t, split_row) - 24usize];
    ["Offset of field: ph1_t::black_row"][::std::mem::offset_of!(ph1_t, black_row) - 28usize];
    ["Offset of field: ph1_t::tag_210"][::std::mem::offset_of!(ph1_t, tag_210) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_dng_color_t {
    pub parsedfields: ::std::os::raw::c_uint,
    pub illuminant: ushort,
    pub calibration: [[f32; 4usize]; 4usize],
    pub colormatrix: [[f32; 3usize]; 4usize],
    pub forwardmatrix: [[f32; 4usize]; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_dng_color_t"][::std::mem::size_of::<libraw_dng_color_t>() - 168usize];
    ["Alignment of libraw_dng_color_t"][::std::mem::align_of::<libraw_dng_color_t>() - 4usize];
    ["Offset of field: libraw_dng_color_t::parsedfields"]
        [::std::mem::offset_of!(libraw_dng_color_t, parsedfields) - 0usize];
    ["Offset of field: libraw_dng_color_t::illuminant"]
        [::std::mem::offset_of!(libraw_dng_color_t, illuminant) - 4usize];
    ["Offset of field: libraw_dng_color_t::calibration"]
        [::std::mem::offset_of!(libraw_dng_color_t, calibration) - 8usize];
    ["Offset of field: libraw_dng_color_t::colormatrix"]
        [::std::mem::offset_of!(libraw_dng_color_t, colormatrix) - 72usize];
    ["Offset of field: libraw_dng_color_t::forwardmatrix"]
        [::std::mem::offset_of!(libraw_dng_color_t, forwardmatrix) - 120usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_dng_levels_t {
    pub parsedfields: ::std::os::raw::c_uint,
    pub dng_cblack: [::std::os::raw::c_uint; 4104usize],
    pub dng_black: ::std::os::raw::c_uint,
    pub dng_fcblack: [f32; 4104usize],
    pub dng_fblack: f32,
    pub dng_whitelevel: [::std::os::raw::c_uint; 4usize],
    pub default_crop: [ushort; 4usize],
    pub user_crop: [f32; 4usize],
    pub preview_colorspace: ::std::os::raw::c_uint,
    pub analogbalance: [f32; 4usize],
    pub asshotneutral: [f32; 4usize],
    pub baseline_exposure: f32,
    pub LinearResponseLimit: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_dng_levels_t"][::std::mem::size_of::<libraw_dng_levels_t>() - 32928usize];
    ["Alignment of libraw_dng_levels_t"][::std::mem::align_of::<libraw_dng_levels_t>() - 4usize];
    ["Offset of field: libraw_dng_levels_t::parsedfields"]
        [::std::mem::offset_of!(libraw_dng_levels_t, parsedfields) - 0usize];
    ["Offset of field: libraw_dng_levels_t::dng_cblack"]
        [::std::mem::offset_of!(libraw_dng_levels_t, dng_cblack) - 4usize];
    ["Offset of field: libraw_dng_levels_t::dng_black"]
        [::std::mem::offset_of!(libraw_dng_levels_t, dng_black) - 16420usize];
    ["Offset of field: libraw_dng_levels_t::dng_fcblack"]
        [::std::mem::offset_of!(libraw_dng_levels_t, dng_fcblack) - 16424usize];
    ["Offset of field: libraw_dng_levels_t::dng_fblack"]
        [::std::mem::offset_of!(libraw_dng_levels_t, dng_fblack) - 32840usize];
    ["Offset of field: libraw_dng_levels_t::dng_whitelevel"]
        [::std::mem::offset_of!(libraw_dng_levels_t, dng_whitelevel) - 32844usize];
    ["Offset of field: libraw_dng_levels_t::default_crop"]
        [::std::mem::offset_of!(libraw_dng_levels_t, default_crop) - 32860usize];
    ["Offset of field: libraw_dng_levels_t::user_crop"]
        [::std::mem::offset_of!(libraw_dng_levels_t, user_crop) - 32868usize];
    ["Offset of field: libraw_dng_levels_t::preview_colorspace"]
        [::std::mem::offset_of!(libraw_dng_levels_t, preview_colorspace) - 32884usize];
    ["Offset of field: libraw_dng_levels_t::analogbalance"]
        [::std::mem::offset_of!(libraw_dng_levels_t, analogbalance) - 32888usize];
    ["Offset of field: libraw_dng_levels_t::asshotneutral"]
        [::std::mem::offset_of!(libraw_dng_levels_t, asshotneutral) - 32904usize];
    ["Offset of field: libraw_dng_levels_t::baseline_exposure"]
        [::std::mem::offset_of!(libraw_dng_levels_t, baseline_exposure) - 32920usize];
    ["Offset of field: libraw_dng_levels_t::LinearResponseLimit"]
        [::std::mem::offset_of!(libraw_dng_levels_t, LinearResponseLimit) - 32924usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_P1_color_t {
    pub romm_cam: [f32; 9usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_P1_color_t"][::std::mem::size_of::<libraw_P1_color_t>() - 36usize];
    ["Alignment of libraw_P1_color_t"][::std::mem::align_of::<libraw_P1_color_t>() - 4usize];
    ["Offset of field: libraw_P1_color_t::romm_cam"]
        [::std::mem::offset_of!(libraw_P1_color_t, romm_cam) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_canon_makernotes_t {
    pub ColorDataVer: ::std::os::raw::c_int,
    pub ColorDataSubVer: ::std::os::raw::c_int,
    pub SpecularWhiteLevel: ::std::os::raw::c_int,
    pub NormalWhiteLevel: ::std::os::raw::c_int,
    pub ChannelBlackLevel: [::std::os::raw::c_int; 4usize],
    pub AverageBlackLevel: ::std::os::raw::c_int,
    pub multishot: [::std::os::raw::c_uint; 4usize],
    pub MeteringMode: ::std::os::raw::c_short,
    pub SpotMeteringMode: ::std::os::raw::c_short,
    pub FlashMeteringMode: uchar,
    pub FlashExposureLock: ::std::os::raw::c_short,
    pub ExposureMode: ::std::os::raw::c_short,
    pub AESetting: ::std::os::raw::c_short,
    pub ImageStabilization: ::std::os::raw::c_short,
    pub FlashMode: ::std::os::raw::c_short,
    pub FlashActivity: ::std::os::raw::c_short,
    pub FlashBits: ::std::os::raw::c_short,
    pub ManualFlashOutput: ::std::os::raw::c_short,
    pub FlashOutput: ::std::os::raw::c_short,
    pub FlashGuideNumber: ::std::os::raw::c_short,
    pub ContinuousDrive: ::std::os::raw::c_short,
    pub SensorWidth: ::std::os::raw::c_short,
    pub SensorHeight: ::std::os::raw::c_short,
    pub AFMicroAdjMode: ::std::os::raw::c_int,
    pub AFMicroAdjValue: f32,
    pub MakernotesFlip: ::std::os::raw::c_short,
    pub RecordMode: ::std::os::raw::c_short,
    pub SRAWQuality: ::std::os::raw::c_short,
    pub wbi: ::std::os::raw::c_uint,
    pub RF_lensID: ::std::os::raw::c_short,
    pub AutoLightingOptimizer: ::std::os::raw::c_int,
    pub HighlightTonePriority: ::std::os::raw::c_int,
    pub Quality: ::std::os::raw::c_short,
    pub CanonLog: ::std::os::raw::c_int,
    pub DefaultCropAbsolute: libraw_area_t,
    pub RecommendedImageArea: libraw_area_t,
    pub LeftOpticalBlack: libraw_area_t,
    pub UpperOpticalBlack: libraw_area_t,
    pub ActiveArea: libraw_area_t,
    pub ISOgain: [::std::os::raw::c_short; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_canon_makernotes_t"]
        [::std::mem::size_of::<libraw_canon_makernotes_t>() - 168usize];
    ["Alignment of libraw_canon_makernotes_t"]
        [::std::mem::align_of::<libraw_canon_makernotes_t>() - 4usize];
    ["Offset of field: libraw_canon_makernotes_t::ColorDataVer"]
        [::std::mem::offset_of!(libraw_canon_makernotes_t, ColorDataVer) - 0usize];
    ["Offset of field: libraw_canon_makernotes_t::ColorDataSubVer"]
        [::std::mem::offset_of!(libraw_canon_makernotes_t, ColorDataSubVer) - 4usize];
    ["Offset of field: libraw_canon_makernotes_t::SpecularWhiteLevel"]
        [::std::mem::offset_of!(libraw_canon_makernotes_t, SpecularWhiteLevel) - 8usize];
    ["Offset of field: libraw_canon_makernotes_t::NormalWhiteLevel"]
        [::std::mem::offset_of!(libraw_canon_makernotes_t, NormalWhiteLevel) - 12usize];
    ["Offset of field: libraw_canon_makernotes_t::ChannelBlackLevel"]
        [::std::mem::offset_of!(libraw_canon_makernotes_t, ChannelBlackLevel) - 16usize];
    ["Offset of field: libraw_canon_makernotes_t::AverageBlackLevel"]
        [::std::mem::offset_of!(libraw_canon_makernotes_t, AverageBlackLevel) - 32usize];
    ["Offset of field: libraw_canon_makernotes_t::multishot"]
        [::std::mem::offset_of!(libraw_canon_makernotes_t, multishot) - 36usize];
    ["Offset of field: libraw_canon_makernotes_t::MeteringMode"]
        [::std::mem::offset_of!(libraw_canon_makernotes_t, MeteringMode) - 52usize];
    ["Offset of field: libraw_canon_makernotes_t::SpotMeteringMode"]
        [::std::mem::offset_of!(libraw_canon_makernotes_t, SpotMeteringMode) - 54usize];
    ["Offset of field: libraw_canon_makernotes_t::FlashMeteringMode"]
        [::std::mem::offset_of!(libraw_canon_makernotes_t, FlashMeteringMode) - 56usize];
    ["Offset of field: libraw_canon_makernotes_t::FlashExposureLock"]
        [::std::mem::offset_of!(libraw_canon_makernotes_t, FlashExposureLock) - 58usize];
    ["Offset of field: libraw_canon_makernotes_t::ExposureMode"]
        [::std::mem::offset_of!(libraw_canon_makernotes_t, ExposureMode) - 60usize];
    ["Offset of field: libraw_canon_makernotes_t::AESetting"]
        [::std::mem::offset_of!(libraw_canon_makernotes_t, AESetting) - 62usize];
    ["Offset of field: libraw_canon_makernotes_t::ImageStabilization"]
        [::std::mem::offset_of!(libraw_canon_makernotes_t, ImageStabilization) - 64usize];
    ["Offset of field: libraw_canon_makernotes_t::FlashMode"]
        [::std::mem::offset_of!(libraw_canon_makernotes_t, FlashMode) - 66usize];
    ["Offset of field: libraw_canon_makernotes_t::FlashActivity"]
        [::std::mem::offset_of!(libraw_canon_makernotes_t, FlashActivity) - 68usize];
    ["Offset of field: libraw_canon_makernotes_t::FlashBits"]
        [::std::mem::offset_of!(libraw_canon_makernotes_t, FlashBits) - 70usize];
    ["Offset of field: libraw_canon_makernotes_t::ManualFlashOutput"]
        [::std::mem::offset_of!(libraw_canon_makernotes_t, ManualFlashOutput) - 72usize];
    ["Offset of field: libraw_canon_makernotes_t::FlashOutput"]
        [::std::mem::offset_of!(libraw_canon_makernotes_t, FlashOutput) - 74usize];
    ["Offset of field: libraw_canon_makernotes_t::FlashGuideNumber"]
        [::std::mem::offset_of!(libraw_canon_makernotes_t, FlashGuideNumber) - 76usize];
    ["Offset of field: libraw_canon_makernotes_t::ContinuousDrive"]
        [::std::mem::offset_of!(libraw_canon_makernotes_t, ContinuousDrive) - 78usize];
    ["Offset of field: libraw_canon_makernotes_t::SensorWidth"]
        [::std::mem::offset_of!(libraw_canon_makernotes_t, SensorWidth) - 80usize];
    ["Offset of field: libraw_canon_makernotes_t::SensorHeight"]
        [::std::mem::offset_of!(libraw_canon_makernotes_t, SensorHeight) - 82usize];
    ["Offset of field: libraw_canon_makernotes_t::AFMicroAdjMode"]
        [::std::mem::offset_of!(libraw_canon_makernotes_t, AFMicroAdjMode) - 84usize];
    ["Offset of field: libraw_canon_makernotes_t::AFMicroAdjValue"]
        [::std::mem::offset_of!(libraw_canon_makernotes_t, AFMicroAdjValue) - 88usize];
    ["Offset of field: libraw_canon_makernotes_t::MakernotesFlip"]
        [::std::mem::offset_of!(libraw_canon_makernotes_t, MakernotesFlip) - 92usize];
    ["Offset of field: libraw_canon_makernotes_t::RecordMode"]
        [::std::mem::offset_of!(libraw_canon_makernotes_t, RecordMode) - 94usize];
    ["Offset of field: libraw_canon_makernotes_t::SRAWQuality"]
        [::std::mem::offset_of!(libraw_canon_makernotes_t, SRAWQuality) - 96usize];
    ["Offset of field: libraw_canon_makernotes_t::wbi"]
        [::std::mem::offset_of!(libraw_canon_makernotes_t, wbi) - 100usize];
    ["Offset of field: libraw_canon_makernotes_t::RF_lensID"]
        [::std::mem::offset_of!(libraw_canon_makernotes_t, RF_lensID) - 104usize];
    ["Offset of field: libraw_canon_makernotes_t::AutoLightingOptimizer"]
        [::std::mem::offset_of!(libraw_canon_makernotes_t, AutoLightingOptimizer) - 108usize];
    ["Offset of field: libraw_canon_makernotes_t::HighlightTonePriority"]
        [::std::mem::offset_of!(libraw_canon_makernotes_t, HighlightTonePriority) - 112usize];
    ["Offset of field: libraw_canon_makernotes_t::Quality"]
        [::std::mem::offset_of!(libraw_canon_makernotes_t, Quality) - 116usize];
    ["Offset of field: libraw_canon_makernotes_t::CanonLog"]
        [::std::mem::offset_of!(libraw_canon_makernotes_t, CanonLog) - 120usize];
    ["Offset of field: libraw_canon_makernotes_t::DefaultCropAbsolute"]
        [::std::mem::offset_of!(libraw_canon_makernotes_t, DefaultCropAbsolute) - 124usize];
    ["Offset of field: libraw_canon_makernotes_t::RecommendedImageArea"]
        [::std::mem::offset_of!(libraw_canon_makernotes_t, RecommendedImageArea) - 132usize];
    ["Offset of field: libraw_canon_makernotes_t::LeftOpticalBlack"]
        [::std::mem::offset_of!(libraw_canon_makernotes_t, LeftOpticalBlack) - 140usize];
    ["Offset of field: libraw_canon_makernotes_t::UpperOpticalBlack"]
        [::std::mem::offset_of!(libraw_canon_makernotes_t, UpperOpticalBlack) - 148usize];
    ["Offset of field: libraw_canon_makernotes_t::ActiveArea"]
        [::std::mem::offset_of!(libraw_canon_makernotes_t, ActiveArea) - 156usize];
    ["Offset of field: libraw_canon_makernotes_t::ISOgain"]
        [::std::mem::offset_of!(libraw_canon_makernotes_t, ISOgain) - 164usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_hasselblad_makernotes_t {
    pub BaseISO: ::std::os::raw::c_int,
    pub Gain: f64,
    pub Sensor: [::std::os::raw::c_char; 8usize],
    pub SensorUnit: [::std::os::raw::c_char; 64usize],
    pub HostBody: [::std::os::raw::c_char; 64usize],
    pub SensorCode: ::std::os::raw::c_int,
    pub SensorSubCode: ::std::os::raw::c_int,
    pub CoatingCode: ::std::os::raw::c_int,
    pub uncropped: ::std::os::raw::c_int,
    pub CaptureSequenceInitiator: [::std::os::raw::c_char; 32usize],
    pub SensorUnitConnector: [::std::os::raw::c_char; 64usize],
    pub format: ::std::os::raw::c_int,
    pub nIFD_CM: [::std::os::raw::c_int; 2usize],
    pub RecommendedCrop: [::std::os::raw::c_int; 2usize],
    pub mnColorMatrix: [[f64; 3usize]; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_hasselblad_makernotes_t"]
        [::std::mem::size_of::<libraw_hasselblad_makernotes_t>() - 384usize];
    ["Alignment of libraw_hasselblad_makernotes_t"]
        [::std::mem::align_of::<libraw_hasselblad_makernotes_t>() - 8usize];
    ["Offset of field: libraw_hasselblad_makernotes_t::BaseISO"]
        [::std::mem::offset_of!(libraw_hasselblad_makernotes_t, BaseISO) - 0usize];
    ["Offset of field: libraw_hasselblad_makernotes_t::Gain"]
        [::std::mem::offset_of!(libraw_hasselblad_makernotes_t, Gain) - 8usize];
    ["Offset of field: libraw_hasselblad_makernotes_t::Sensor"]
        [::std::mem::offset_of!(libraw_hasselblad_makernotes_t, Sensor) - 16usize];
    ["Offset of field: libraw_hasselblad_makernotes_t::SensorUnit"]
        [::std::mem::offset_of!(libraw_hasselblad_makernotes_t, SensorUnit) - 24usize];
    ["Offset of field: libraw_hasselblad_makernotes_t::HostBody"]
        [::std::mem::offset_of!(libraw_hasselblad_makernotes_t, HostBody) - 88usize];
    ["Offset of field: libraw_hasselblad_makernotes_t::SensorCode"]
        [::std::mem::offset_of!(libraw_hasselblad_makernotes_t, SensorCode) - 152usize];
    ["Offset of field: libraw_hasselblad_makernotes_t::SensorSubCode"]
        [::std::mem::offset_of!(libraw_hasselblad_makernotes_t, SensorSubCode) - 156usize];
    ["Offset of field: libraw_hasselblad_makernotes_t::CoatingCode"]
        [::std::mem::offset_of!(libraw_hasselblad_makernotes_t, CoatingCode) - 160usize];
    ["Offset of field: libraw_hasselblad_makernotes_t::uncropped"]
        [::std::mem::offset_of!(libraw_hasselblad_makernotes_t, uncropped) - 164usize];
    ["Offset of field: libraw_hasselblad_makernotes_t::CaptureSequenceInitiator"][::std::mem::offset_of!(
        libraw_hasselblad_makernotes_t,
        CaptureSequenceInitiator
    ) - 168usize];
    ["Offset of field: libraw_hasselblad_makernotes_t::SensorUnitConnector"]
        [::std::mem::offset_of!(libraw_hasselblad_makernotes_t, SensorUnitConnector) - 200usize];
    ["Offset of field: libraw_hasselblad_makernotes_t::format"]
        [::std::mem::offset_of!(libraw_hasselblad_makernotes_t, format) - 264usize];
    ["Offset of field: libraw_hasselblad_makernotes_t::nIFD_CM"]
        [::std::mem::offset_of!(libraw_hasselblad_makernotes_t, nIFD_CM) - 268usize];
    ["Offset of field: libraw_hasselblad_makernotes_t::RecommendedCrop"]
        [::std::mem::offset_of!(libraw_hasselblad_makernotes_t, RecommendedCrop) - 276usize];
    ["Offset of field: libraw_hasselblad_makernotes_t::mnColorMatrix"]
        [::std::mem::offset_of!(libraw_hasselblad_makernotes_t, mnColorMatrix) - 288usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_fuji_info_t {
    pub ExpoMidPointShift: f32,
    pub DynamicRange: ushort,
    pub FilmMode: ushort,
    pub DynamicRangeSetting: ushort,
    pub DevelopmentDynamicRange: ushort,
    pub AutoDynamicRange: ushort,
    pub DRangePriority: ushort,
    pub DRangePriorityAuto: ushort,
    pub DRangePriorityFixed: ushort,
    pub FujiModel: [::std::os::raw::c_char; 33usize],
    pub FujiModel2: [::std::os::raw::c_char; 33usize],
    pub BrightnessCompensation: f32,
    pub FocusMode: ushort,
    pub AFMode: ushort,
    pub FocusPixel: [ushort; 2usize],
    pub PrioritySettings: ushort,
    pub FocusSettings: ::std::os::raw::c_uint,
    pub AF_C_Settings: ::std::os::raw::c_uint,
    pub FocusWarning: ushort,
    pub ImageStabilization: [ushort; 3usize],
    pub FlashMode: ushort,
    pub WB_Preset: ushort,
    pub ShutterType: ushort,
    pub ExrMode: ushort,
    pub Macro: ushort,
    pub Rating: ::std::os::raw::c_uint,
    pub CropMode: ushort,
    pub SerialSignature: [::std::os::raw::c_char; 13usize],
    pub SensorID: [::std::os::raw::c_char; 5usize],
    pub RAFVersion: [::std::os::raw::c_char; 5usize],
    pub RAFDataGeneration: ::std::os::raw::c_int,
    pub RAFDataVersion: ushort,
    pub isTSNERDTS: ::std::os::raw::c_int,
    pub DriveMode: ::std::os::raw::c_short,
    pub BlackLevel: [ushort; 9usize],
    pub RAFData_ImageSizeTable: [::std::os::raw::c_uint; 32usize],
    pub AutoBracketing: ::std::os::raw::c_int,
    pub SequenceNumber: ::std::os::raw::c_int,
    pub SeriesLength: ::std::os::raw::c_int,
    pub PixelShiftOffset: [f32; 2usize],
    pub ImageCount: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_fuji_info_t"][::std::mem::size_of::<libraw_fuji_info_t>() - 348usize];
    ["Alignment of libraw_fuji_info_t"][::std::mem::align_of::<libraw_fuji_info_t>() - 4usize];
    ["Offset of field: libraw_fuji_info_t::ExpoMidPointShift"]
        [::std::mem::offset_of!(libraw_fuji_info_t, ExpoMidPointShift) - 0usize];
    ["Offset of field: libraw_fuji_info_t::DynamicRange"]
        [::std::mem::offset_of!(libraw_fuji_info_t, DynamicRange) - 4usize];
    ["Offset of field: libraw_fuji_info_t::FilmMode"]
        [::std::mem::offset_of!(libraw_fuji_info_t, FilmMode) - 6usize];
    ["Offset of field: libraw_fuji_info_t::DynamicRangeSetting"]
        [::std::mem::offset_of!(libraw_fuji_info_t, DynamicRangeSetting) - 8usize];
    ["Offset of field: libraw_fuji_info_t::DevelopmentDynamicRange"]
        [::std::mem::offset_of!(libraw_fuji_info_t, DevelopmentDynamicRange) - 10usize];
    ["Offset of field: libraw_fuji_info_t::AutoDynamicRange"]
        [::std::mem::offset_of!(libraw_fuji_info_t, AutoDynamicRange) - 12usize];
    ["Offset of field: libraw_fuji_info_t::DRangePriority"]
        [::std::mem::offset_of!(libraw_fuji_info_t, DRangePriority) - 14usize];
    ["Offset of field: libraw_fuji_info_t::DRangePriorityAuto"]
        [::std::mem::offset_of!(libraw_fuji_info_t, DRangePriorityAuto) - 16usize];
    ["Offset of field: libraw_fuji_info_t::DRangePriorityFixed"]
        [::std::mem::offset_of!(libraw_fuji_info_t, DRangePriorityFixed) - 18usize];
    ["Offset of field: libraw_fuji_info_t::FujiModel"]
        [::std::mem::offset_of!(libraw_fuji_info_t, FujiModel) - 20usize];
    ["Offset of field: libraw_fuji_info_t::FujiModel2"]
        [::std::mem::offset_of!(libraw_fuji_info_t, FujiModel2) - 53usize];
    ["Offset of field: libraw_fuji_info_t::BrightnessCompensation"]
        [::std::mem::offset_of!(libraw_fuji_info_t, BrightnessCompensation) - 88usize];
    ["Offset of field: libraw_fuji_info_t::FocusMode"]
        [::std::mem::offset_of!(libraw_fuji_info_t, FocusMode) - 92usize];
    ["Offset of field: libraw_fuji_info_t::AFMode"]
        [::std::mem::offset_of!(libraw_fuji_info_t, AFMode) - 94usize];
    ["Offset of field: libraw_fuji_info_t::FocusPixel"]
        [::std::mem::offset_of!(libraw_fuji_info_t, FocusPixel) - 96usize];
    ["Offset of field: libraw_fuji_info_t::PrioritySettings"]
        [::std::mem::offset_of!(libraw_fuji_info_t, PrioritySettings) - 100usize];
    ["Offset of field: libraw_fuji_info_t::FocusSettings"]
        [::std::mem::offset_of!(libraw_fuji_info_t, FocusSettings) - 104usize];
    ["Offset of field: libraw_fuji_info_t::AF_C_Settings"]
        [::std::mem::offset_of!(libraw_fuji_info_t, AF_C_Settings) - 108usize];
    ["Offset of field: libraw_fuji_info_t::FocusWarning"]
        [::std::mem::offset_of!(libraw_fuji_info_t, FocusWarning) - 112usize];
    ["Offset of field: libraw_fuji_info_t::ImageStabilization"]
        [::std::mem::offset_of!(libraw_fuji_info_t, ImageStabilization) - 114usize];
    ["Offset of field: libraw_fuji_info_t::FlashMode"]
        [::std::mem::offset_of!(libraw_fuji_info_t, FlashMode) - 120usize];
    ["Offset of field: libraw_fuji_info_t::WB_Preset"]
        [::std::mem::offset_of!(libraw_fuji_info_t, WB_Preset) - 122usize];
    ["Offset of field: libraw_fuji_info_t::ShutterType"]
        [::std::mem::offset_of!(libraw_fuji_info_t, ShutterType) - 124usize];
    ["Offset of field: libraw_fuji_info_t::ExrMode"]
        [::std::mem::offset_of!(libraw_fuji_info_t, ExrMode) - 126usize];
    ["Offset of field: libraw_fuji_info_t::Macro"]
        [::std::mem::offset_of!(libraw_fuji_info_t, Macro) - 128usize];
    ["Offset of field: libraw_fuji_info_t::Rating"]
        [::std::mem::offset_of!(libraw_fuji_info_t, Rating) - 132usize];
    ["Offset of field: libraw_fuji_info_t::CropMode"]
        [::std::mem::offset_of!(libraw_fuji_info_t, CropMode) - 136usize];
    ["Offset of field: libraw_fuji_info_t::SerialSignature"]
        [::std::mem::offset_of!(libraw_fuji_info_t, SerialSignature) - 138usize];
    ["Offset of field: libraw_fuji_info_t::SensorID"]
        [::std::mem::offset_of!(libraw_fuji_info_t, SensorID) - 151usize];
    ["Offset of field: libraw_fuji_info_t::RAFVersion"]
        [::std::mem::offset_of!(libraw_fuji_info_t, RAFVersion) - 156usize];
    ["Offset of field: libraw_fuji_info_t::RAFDataGeneration"]
        [::std::mem::offset_of!(libraw_fuji_info_t, RAFDataGeneration) - 164usize];
    ["Offset of field: libraw_fuji_info_t::RAFDataVersion"]
        [::std::mem::offset_of!(libraw_fuji_info_t, RAFDataVersion) - 168usize];
    ["Offset of field: libraw_fuji_info_t::isTSNERDTS"]
        [::std::mem::offset_of!(libraw_fuji_info_t, isTSNERDTS) - 172usize];
    ["Offset of field: libraw_fuji_info_t::DriveMode"]
        [::std::mem::offset_of!(libraw_fuji_info_t, DriveMode) - 176usize];
    ["Offset of field: libraw_fuji_info_t::BlackLevel"]
        [::std::mem::offset_of!(libraw_fuji_info_t, BlackLevel) - 178usize];
    ["Offset of field: libraw_fuji_info_t::RAFData_ImageSizeTable"]
        [::std::mem::offset_of!(libraw_fuji_info_t, RAFData_ImageSizeTable) - 196usize];
    ["Offset of field: libraw_fuji_info_t::AutoBracketing"]
        [::std::mem::offset_of!(libraw_fuji_info_t, AutoBracketing) - 324usize];
    ["Offset of field: libraw_fuji_info_t::SequenceNumber"]
        [::std::mem::offset_of!(libraw_fuji_info_t, SequenceNumber) - 328usize];
    ["Offset of field: libraw_fuji_info_t::SeriesLength"]
        [::std::mem::offset_of!(libraw_fuji_info_t, SeriesLength) - 332usize];
    ["Offset of field: libraw_fuji_info_t::PixelShiftOffset"]
        [::std::mem::offset_of!(libraw_fuji_info_t, PixelShiftOffset) - 336usize];
    ["Offset of field: libraw_fuji_info_t::ImageCount"]
        [::std::mem::offset_of!(libraw_fuji_info_t, ImageCount) - 344usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_sensor_highspeed_crop_t {
    pub cleft: ushort,
    pub ctop: ushort,
    pub cwidth: ushort,
    pub cheight: ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_sensor_highspeed_crop_t"]
        [::std::mem::size_of::<libraw_sensor_highspeed_crop_t>() - 8usize];
    ["Alignment of libraw_sensor_highspeed_crop_t"]
        [::std::mem::align_of::<libraw_sensor_highspeed_crop_t>() - 2usize];
    ["Offset of field: libraw_sensor_highspeed_crop_t::cleft"]
        [::std::mem::offset_of!(libraw_sensor_highspeed_crop_t, cleft) - 0usize];
    ["Offset of field: libraw_sensor_highspeed_crop_t::ctop"]
        [::std::mem::offset_of!(libraw_sensor_highspeed_crop_t, ctop) - 2usize];
    ["Offset of field: libraw_sensor_highspeed_crop_t::cwidth"]
        [::std::mem::offset_of!(libraw_sensor_highspeed_crop_t, cwidth) - 4usize];
    ["Offset of field: libraw_sensor_highspeed_crop_t::cheight"]
        [::std::mem::offset_of!(libraw_sensor_highspeed_crop_t, cheight) - 6usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_nikon_makernotes_t {
    pub ExposureBracketValue: f64,
    pub ActiveDLighting: ushort,
    pub ShootingMode: ushort,
    pub ImageStabilization: [uchar; 7usize],
    pub VibrationReduction: uchar,
    pub VRMode: uchar,
    pub FlashSetting: [::std::os::raw::c_char; 13usize],
    pub FlashType: [::std::os::raw::c_char; 20usize],
    pub FlashExposureCompensation: [uchar; 4usize],
    pub ExternalFlashExposureComp: [uchar; 4usize],
    pub FlashExposureBracketValue: [uchar; 4usize],
    pub FlashMode: uchar,
    pub FlashExposureCompensation2: ::std::os::raw::c_schar,
    pub FlashExposureCompensation3: ::std::os::raw::c_schar,
    pub FlashExposureCompensation4: ::std::os::raw::c_schar,
    pub FlashSource: uchar,
    pub FlashFirmware: [uchar; 2usize],
    pub ExternalFlashFlags: uchar,
    pub FlashControlCommanderMode: uchar,
    pub FlashOutputAndCompensation: uchar,
    pub FlashFocalLength: uchar,
    pub FlashGNDistance: uchar,
    pub FlashGroupControlMode: [uchar; 4usize],
    pub FlashGroupOutputAndCompensation: [uchar; 4usize],
    pub FlashColorFilter: uchar,
    pub NEFCompression: ushort,
    pub ExposureMode: ::std::os::raw::c_int,
    pub ExposureProgram: ::std::os::raw::c_int,
    pub nMEshots: ::std::os::raw::c_int,
    pub MEgainOn: ::std::os::raw::c_int,
    pub ME_WB: [f64; 4usize],
    pub AFFineTune: uchar,
    pub AFFineTuneIndex: uchar,
    pub AFFineTuneAdj: i8,
    pub LensDataVersion: ::std::os::raw::c_uint,
    pub FlashInfoVersion: ::std::os::raw::c_uint,
    pub ColorBalanceVersion: ::std::os::raw::c_uint,
    pub key: uchar,
    pub NEFBitDepth: [ushort; 4usize],
    pub HighSpeedCropFormat: ushort,
    pub SensorHighSpeedCrop: libraw_sensor_highspeed_crop_t,
    pub SensorWidth: ushort,
    pub SensorHeight: ushort,
    pub Active_D_Lighting: ushort,
    pub PictureControlVersion: ::std::os::raw::c_uint,
    pub PictureControlName: [::std::os::raw::c_char; 20usize],
    pub PictureControlBase: [::std::os::raw::c_char; 20usize],
    pub ShotInfoVersion: ::std::os::raw::c_uint,
    pub MakernotesFlip: ::std::os::raw::c_short,
    pub RollAngle: f64,
    pub PitchAngle: f64,
    pub YawAngle: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_nikon_makernotes_t"]
        [::std::mem::size_of::<libraw_nikon_makernotes_t>() - 264usize];
    ["Alignment of libraw_nikon_makernotes_t"]
        [::std::mem::align_of::<libraw_nikon_makernotes_t>() - 8usize];
    ["Offset of field: libraw_nikon_makernotes_t::ExposureBracketValue"]
        [::std::mem::offset_of!(libraw_nikon_makernotes_t, ExposureBracketValue) - 0usize];
    ["Offset of field: libraw_nikon_makernotes_t::ActiveDLighting"]
        [::std::mem::offset_of!(libraw_nikon_makernotes_t, ActiveDLighting) - 8usize];
    ["Offset of field: libraw_nikon_makernotes_t::ShootingMode"]
        [::std::mem::offset_of!(libraw_nikon_makernotes_t, ShootingMode) - 10usize];
    ["Offset of field: libraw_nikon_makernotes_t::ImageStabilization"]
        [::std::mem::offset_of!(libraw_nikon_makernotes_t, ImageStabilization) - 12usize];
    ["Offset of field: libraw_nikon_makernotes_t::VibrationReduction"]
        [::std::mem::offset_of!(libraw_nikon_makernotes_t, VibrationReduction) - 19usize];
    ["Offset of field: libraw_nikon_makernotes_t::VRMode"]
        [::std::mem::offset_of!(libraw_nikon_makernotes_t, VRMode) - 20usize];
    ["Offset of field: libraw_nikon_makernotes_t::FlashSetting"]
        [::std::mem::offset_of!(libraw_nikon_makernotes_t, FlashSetting) - 21usize];
    ["Offset of field: libraw_nikon_makernotes_t::FlashType"]
        [::std::mem::offset_of!(libraw_nikon_makernotes_t, FlashType) - 34usize];
    ["Offset of field: libraw_nikon_makernotes_t::FlashExposureCompensation"]
        [::std::mem::offset_of!(libraw_nikon_makernotes_t, FlashExposureCompensation) - 54usize];
    ["Offset of field: libraw_nikon_makernotes_t::ExternalFlashExposureComp"]
        [::std::mem::offset_of!(libraw_nikon_makernotes_t, ExternalFlashExposureComp) - 58usize];
    ["Offset of field: libraw_nikon_makernotes_t::FlashExposureBracketValue"]
        [::std::mem::offset_of!(libraw_nikon_makernotes_t, FlashExposureBracketValue) - 62usize];
    ["Offset of field: libraw_nikon_makernotes_t::FlashMode"]
        [::std::mem::offset_of!(libraw_nikon_makernotes_t, FlashMode) - 66usize];
    ["Offset of field: libraw_nikon_makernotes_t::FlashExposureCompensation2"]
        [::std::mem::offset_of!(libraw_nikon_makernotes_t, FlashExposureCompensation2) - 67usize];
    ["Offset of field: libraw_nikon_makernotes_t::FlashExposureCompensation3"]
        [::std::mem::offset_of!(libraw_nikon_makernotes_t, FlashExposureCompensation3) - 68usize];
    ["Offset of field: libraw_nikon_makernotes_t::FlashExposureCompensation4"]
        [::std::mem::offset_of!(libraw_nikon_makernotes_t, FlashExposureCompensation4) - 69usize];
    ["Offset of field: libraw_nikon_makernotes_t::FlashSource"]
        [::std::mem::offset_of!(libraw_nikon_makernotes_t, FlashSource) - 70usize];
    ["Offset of field: libraw_nikon_makernotes_t::FlashFirmware"]
        [::std::mem::offset_of!(libraw_nikon_makernotes_t, FlashFirmware) - 71usize];
    ["Offset of field: libraw_nikon_makernotes_t::ExternalFlashFlags"]
        [::std::mem::offset_of!(libraw_nikon_makernotes_t, ExternalFlashFlags) - 73usize];
    ["Offset of field: libraw_nikon_makernotes_t::FlashControlCommanderMode"]
        [::std::mem::offset_of!(libraw_nikon_makernotes_t, FlashControlCommanderMode) - 74usize];
    ["Offset of field: libraw_nikon_makernotes_t::FlashOutputAndCompensation"]
        [::std::mem::offset_of!(libraw_nikon_makernotes_t, FlashOutputAndCompensation) - 75usize];
    ["Offset of field: libraw_nikon_makernotes_t::FlashFocalLength"]
        [::std::mem::offset_of!(libraw_nikon_makernotes_t, FlashFocalLength) - 76usize];
    ["Offset of field: libraw_nikon_makernotes_t::FlashGNDistance"]
        [::std::mem::offset_of!(libraw_nikon_makernotes_t, FlashGNDistance) - 77usize];
    ["Offset of field: libraw_nikon_makernotes_t::FlashGroupControlMode"]
        [::std::mem::offset_of!(libraw_nikon_makernotes_t, FlashGroupControlMode) - 78usize];
    ["Offset of field: libraw_nikon_makernotes_t::FlashGroupOutputAndCompensation"][::std::mem::offset_of!(
        libraw_nikon_makernotes_t,
        FlashGroupOutputAndCompensation
    ) - 82usize];
    ["Offset of field: libraw_nikon_makernotes_t::FlashColorFilter"]
        [::std::mem::offset_of!(libraw_nikon_makernotes_t, FlashColorFilter) - 86usize];
    ["Offset of field: libraw_nikon_makernotes_t::NEFCompression"]
        [::std::mem::offset_of!(libraw_nikon_makernotes_t, NEFCompression) - 88usize];
    ["Offset of field: libraw_nikon_makernotes_t::ExposureMode"]
        [::std::mem::offset_of!(libraw_nikon_makernotes_t, ExposureMode) - 92usize];
    ["Offset of field: libraw_nikon_makernotes_t::ExposureProgram"]
        [::std::mem::offset_of!(libraw_nikon_makernotes_t, ExposureProgram) - 96usize];
    ["Offset of field: libraw_nikon_makernotes_t::nMEshots"]
        [::std::mem::offset_of!(libraw_nikon_makernotes_t, nMEshots) - 100usize];
    ["Offset of field: libraw_nikon_makernotes_t::MEgainOn"]
        [::std::mem::offset_of!(libraw_nikon_makernotes_t, MEgainOn) - 104usize];
    ["Offset of field: libraw_nikon_makernotes_t::ME_WB"]
        [::std::mem::offset_of!(libraw_nikon_makernotes_t, ME_WB) - 112usize];
    ["Offset of field: libraw_nikon_makernotes_t::AFFineTune"]
        [::std::mem::offset_of!(libraw_nikon_makernotes_t, AFFineTune) - 144usize];
    ["Offset of field: libraw_nikon_makernotes_t::AFFineTuneIndex"]
        [::std::mem::offset_of!(libraw_nikon_makernotes_t, AFFineTuneIndex) - 145usize];
    ["Offset of field: libraw_nikon_makernotes_t::AFFineTuneAdj"]
        [::std::mem::offset_of!(libraw_nikon_makernotes_t, AFFineTuneAdj) - 146usize];
    ["Offset of field: libraw_nikon_makernotes_t::LensDataVersion"]
        [::std::mem::offset_of!(libraw_nikon_makernotes_t, LensDataVersion) - 148usize];
    ["Offset of field: libraw_nikon_makernotes_t::FlashInfoVersion"]
        [::std::mem::offset_of!(libraw_nikon_makernotes_t, FlashInfoVersion) - 152usize];
    ["Offset of field: libraw_nikon_makernotes_t::ColorBalanceVersion"]
        [::std::mem::offset_of!(libraw_nikon_makernotes_t, ColorBalanceVersion) - 156usize];
    ["Offset of field: libraw_nikon_makernotes_t::key"]
        [::std::mem::offset_of!(libraw_nikon_makernotes_t, key) - 160usize];
    ["Offset of field: libraw_nikon_makernotes_t::NEFBitDepth"]
        [::std::mem::offset_of!(libraw_nikon_makernotes_t, NEFBitDepth) - 162usize];
    ["Offset of field: libraw_nikon_makernotes_t::HighSpeedCropFormat"]
        [::std::mem::offset_of!(libraw_nikon_makernotes_t, HighSpeedCropFormat) - 170usize];
    ["Offset of field: libraw_nikon_makernotes_t::SensorHighSpeedCrop"]
        [::std::mem::offset_of!(libraw_nikon_makernotes_t, SensorHighSpeedCrop) - 172usize];
    ["Offset of field: libraw_nikon_makernotes_t::SensorWidth"]
        [::std::mem::offset_of!(libraw_nikon_makernotes_t, SensorWidth) - 180usize];
    ["Offset of field: libraw_nikon_makernotes_t::SensorHeight"]
        [::std::mem::offset_of!(libraw_nikon_makernotes_t, SensorHeight) - 182usize];
    ["Offset of field: libraw_nikon_makernotes_t::Active_D_Lighting"]
        [::std::mem::offset_of!(libraw_nikon_makernotes_t, Active_D_Lighting) - 184usize];
    ["Offset of field: libraw_nikon_makernotes_t::PictureControlVersion"]
        [::std::mem::offset_of!(libraw_nikon_makernotes_t, PictureControlVersion) - 188usize];
    ["Offset of field: libraw_nikon_makernotes_t::PictureControlName"]
        [::std::mem::offset_of!(libraw_nikon_makernotes_t, PictureControlName) - 192usize];
    ["Offset of field: libraw_nikon_makernotes_t::PictureControlBase"]
        [::std::mem::offset_of!(libraw_nikon_makernotes_t, PictureControlBase) - 212usize];
    ["Offset of field: libraw_nikon_makernotes_t::ShotInfoVersion"]
        [::std::mem::offset_of!(libraw_nikon_makernotes_t, ShotInfoVersion) - 232usize];
    ["Offset of field: libraw_nikon_makernotes_t::MakernotesFlip"]
        [::std::mem::offset_of!(libraw_nikon_makernotes_t, MakernotesFlip) - 236usize];
    ["Offset of field: libraw_nikon_makernotes_t::RollAngle"]
        [::std::mem::offset_of!(libraw_nikon_makernotes_t, RollAngle) - 240usize];
    ["Offset of field: libraw_nikon_makernotes_t::PitchAngle"]
        [::std::mem::offset_of!(libraw_nikon_makernotes_t, PitchAngle) - 248usize];
    ["Offset of field: libraw_nikon_makernotes_t::YawAngle"]
        [::std::mem::offset_of!(libraw_nikon_makernotes_t, YawAngle) - 256usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_olympus_makernotes_t {
    pub CameraType2: [::std::os::raw::c_char; 6usize],
    pub ValidBits: ushort,
    pub SensorCalibration: [::std::os::raw::c_int; 2usize],
    pub DriveMode: [ushort; 5usize],
    pub ColorSpace: ushort,
    pub FocusMode: [ushort; 2usize],
    pub AutoFocus: ushort,
    pub AFPoint: ushort,
    pub AFAreas: [::std::os::raw::c_uint; 64usize],
    pub AFPointSelected: [f64; 5usize],
    pub AFResult: ushort,
    pub AFFineTune: uchar,
    pub AFFineTuneAdj: [::std::os::raw::c_short; 3usize],
    pub SpecialMode: [::std::os::raw::c_uint; 3usize],
    pub ZoomStepCount: ushort,
    pub FocusStepCount: ushort,
    pub FocusStepInfinity: ushort,
    pub FocusStepNear: ushort,
    pub FocusDistance: f64,
    pub AspectFrame: [ushort; 4usize],
    pub StackedImage: [::std::os::raw::c_uint; 2usize],
    pub isLiveND: uchar,
    pub LiveNDfactor: ::std::os::raw::c_uint,
    pub Panorama_mode: ushort,
    pub Panorama_frameNum: ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_olympus_makernotes_t"]
        [::std::mem::size_of::<libraw_olympus_makernotes_t>() - 408usize];
    ["Alignment of libraw_olympus_makernotes_t"]
        [::std::mem::align_of::<libraw_olympus_makernotes_t>() - 8usize];
    ["Offset of field: libraw_olympus_makernotes_t::CameraType2"]
        [::std::mem::offset_of!(libraw_olympus_makernotes_t, CameraType2) - 0usize];
    ["Offset of field: libraw_olympus_makernotes_t::ValidBits"]
        [::std::mem::offset_of!(libraw_olympus_makernotes_t, ValidBits) - 6usize];
    ["Offset of field: libraw_olympus_makernotes_t::SensorCalibration"]
        [::std::mem::offset_of!(libraw_olympus_makernotes_t, SensorCalibration) - 8usize];
    ["Offset of field: libraw_olympus_makernotes_t::DriveMode"]
        [::std::mem::offset_of!(libraw_olympus_makernotes_t, DriveMode) - 16usize];
    ["Offset of field: libraw_olympus_makernotes_t::ColorSpace"]
        [::std::mem::offset_of!(libraw_olympus_makernotes_t, ColorSpace) - 26usize];
    ["Offset of field: libraw_olympus_makernotes_t::FocusMode"]
        [::std::mem::offset_of!(libraw_olympus_makernotes_t, FocusMode) - 28usize];
    ["Offset of field: libraw_olympus_makernotes_t::AutoFocus"]
        [::std::mem::offset_of!(libraw_olympus_makernotes_t, AutoFocus) - 32usize];
    ["Offset of field: libraw_olympus_makernotes_t::AFPoint"]
        [::std::mem::offset_of!(libraw_olympus_makernotes_t, AFPoint) - 34usize];
    ["Offset of field: libraw_olympus_makernotes_t::AFAreas"]
        [::std::mem::offset_of!(libraw_olympus_makernotes_t, AFAreas) - 36usize];
    ["Offset of field: libraw_olympus_makernotes_t::AFPointSelected"]
        [::std::mem::offset_of!(libraw_olympus_makernotes_t, AFPointSelected) - 296usize];
    ["Offset of field: libraw_olympus_makernotes_t::AFResult"]
        [::std::mem::offset_of!(libraw_olympus_makernotes_t, AFResult) - 336usize];
    ["Offset of field: libraw_olympus_makernotes_t::AFFineTune"]
        [::std::mem::offset_of!(libraw_olympus_makernotes_t, AFFineTune) - 338usize];
    ["Offset of field: libraw_olympus_makernotes_t::AFFineTuneAdj"]
        [::std::mem::offset_of!(libraw_olympus_makernotes_t, AFFineTuneAdj) - 340usize];
    ["Offset of field: libraw_olympus_makernotes_t::SpecialMode"]
        [::std::mem::offset_of!(libraw_olympus_makernotes_t, SpecialMode) - 348usize];
    ["Offset of field: libraw_olympus_makernotes_t::ZoomStepCount"]
        [::std::mem::offset_of!(libraw_olympus_makernotes_t, ZoomStepCount) - 360usize];
    ["Offset of field: libraw_olympus_makernotes_t::FocusStepCount"]
        [::std::mem::offset_of!(libraw_olympus_makernotes_t, FocusStepCount) - 362usize];
    ["Offset of field: libraw_olympus_makernotes_t::FocusStepInfinity"]
        [::std::mem::offset_of!(libraw_olympus_makernotes_t, FocusStepInfinity) - 364usize];
    ["Offset of field: libraw_olympus_makernotes_t::FocusStepNear"]
        [::std::mem::offset_of!(libraw_olympus_makernotes_t, FocusStepNear) - 366usize];
    ["Offset of field: libraw_olympus_makernotes_t::FocusDistance"]
        [::std::mem::offset_of!(libraw_olympus_makernotes_t, FocusDistance) - 368usize];
    ["Offset of field: libraw_olympus_makernotes_t::AspectFrame"]
        [::std::mem::offset_of!(libraw_olympus_makernotes_t, AspectFrame) - 376usize];
    ["Offset of field: libraw_olympus_makernotes_t::StackedImage"]
        [::std::mem::offset_of!(libraw_olympus_makernotes_t, StackedImage) - 384usize];
    ["Offset of field: libraw_olympus_makernotes_t::isLiveND"]
        [::std::mem::offset_of!(libraw_olympus_makernotes_t, isLiveND) - 392usize];
    ["Offset of field: libraw_olympus_makernotes_t::LiveNDfactor"]
        [::std::mem::offset_of!(libraw_olympus_makernotes_t, LiveNDfactor) - 396usize];
    ["Offset of field: libraw_olympus_makernotes_t::Panorama_mode"]
        [::std::mem::offset_of!(libraw_olympus_makernotes_t, Panorama_mode) - 400usize];
    ["Offset of field: libraw_olympus_makernotes_t::Panorama_frameNum"]
        [::std::mem::offset_of!(libraw_olympus_makernotes_t, Panorama_frameNum) - 402usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_panasonic_makernotes_t {
    pub Compression: ushort,
    pub BlackLevelDim: ushort,
    pub BlackLevel: [f32; 8usize],
    pub Multishot: ::std::os::raw::c_uint,
    pub gamma: f32,
    pub HighISOMultiplier: [::std::os::raw::c_int; 3usize],
    pub FocusStepNear: ::std::os::raw::c_short,
    pub FocusStepCount: ::std::os::raw::c_short,
    pub ZoomPosition: ::std::os::raw::c_uint,
    pub LensManufacturer: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_panasonic_makernotes_t"]
        [::std::mem::size_of::<libraw_panasonic_makernotes_t>() - 68usize];
    ["Alignment of libraw_panasonic_makernotes_t"]
        [::std::mem::align_of::<libraw_panasonic_makernotes_t>() - 4usize];
    ["Offset of field: libraw_panasonic_makernotes_t::Compression"]
        [::std::mem::offset_of!(libraw_panasonic_makernotes_t, Compression) - 0usize];
    ["Offset of field: libraw_panasonic_makernotes_t::BlackLevelDim"]
        [::std::mem::offset_of!(libraw_panasonic_makernotes_t, BlackLevelDim) - 2usize];
    ["Offset of field: libraw_panasonic_makernotes_t::BlackLevel"]
        [::std::mem::offset_of!(libraw_panasonic_makernotes_t, BlackLevel) - 4usize];
    ["Offset of field: libraw_panasonic_makernotes_t::Multishot"]
        [::std::mem::offset_of!(libraw_panasonic_makernotes_t, Multishot) - 36usize];
    ["Offset of field: libraw_panasonic_makernotes_t::gamma"]
        [::std::mem::offset_of!(libraw_panasonic_makernotes_t, gamma) - 40usize];
    ["Offset of field: libraw_panasonic_makernotes_t::HighISOMultiplier"]
        [::std::mem::offset_of!(libraw_panasonic_makernotes_t, HighISOMultiplier) - 44usize];
    ["Offset of field: libraw_panasonic_makernotes_t::FocusStepNear"]
        [::std::mem::offset_of!(libraw_panasonic_makernotes_t, FocusStepNear) - 56usize];
    ["Offset of field: libraw_panasonic_makernotes_t::FocusStepCount"]
        [::std::mem::offset_of!(libraw_panasonic_makernotes_t, FocusStepCount) - 58usize];
    ["Offset of field: libraw_panasonic_makernotes_t::ZoomPosition"]
        [::std::mem::offset_of!(libraw_panasonic_makernotes_t, ZoomPosition) - 60usize];
    ["Offset of field: libraw_panasonic_makernotes_t::LensManufacturer"]
        [::std::mem::offset_of!(libraw_panasonic_makernotes_t, LensManufacturer) - 64usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_pentax_makernotes_t {
    pub DriveMode: [uchar; 4usize],
    pub FocusMode: [ushort; 2usize],
    pub AFPointSelected: [ushort; 2usize],
    pub AFPointSelected_Area: ushort,
    pub AFPointsInFocus_version: ::std::os::raw::c_int,
    pub AFPointsInFocus: ::std::os::raw::c_uint,
    pub FocusPosition: ushort,
    pub AFAdjustment: ::std::os::raw::c_short,
    pub AFPointMode: uchar,
    pub MultiExposure: uchar,
    pub Quality: ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_pentax_makernotes_t"]
        [::std::mem::size_of::<libraw_pentax_makernotes_t>() - 32usize];
    ["Alignment of libraw_pentax_makernotes_t"]
        [::std::mem::align_of::<libraw_pentax_makernotes_t>() - 4usize];
    ["Offset of field: libraw_pentax_makernotes_t::DriveMode"]
        [::std::mem::offset_of!(libraw_pentax_makernotes_t, DriveMode) - 0usize];
    ["Offset of field: libraw_pentax_makernotes_t::FocusMode"]
        [::std::mem::offset_of!(libraw_pentax_makernotes_t, FocusMode) - 4usize];
    ["Offset of field: libraw_pentax_makernotes_t::AFPointSelected"]
        [::std::mem::offset_of!(libraw_pentax_makernotes_t, AFPointSelected) - 8usize];
    ["Offset of field: libraw_pentax_makernotes_t::AFPointSelected_Area"]
        [::std::mem::offset_of!(libraw_pentax_makernotes_t, AFPointSelected_Area) - 12usize];
    ["Offset of field: libraw_pentax_makernotes_t::AFPointsInFocus_version"]
        [::std::mem::offset_of!(libraw_pentax_makernotes_t, AFPointsInFocus_version) - 16usize];
    ["Offset of field: libraw_pentax_makernotes_t::AFPointsInFocus"]
        [::std::mem::offset_of!(libraw_pentax_makernotes_t, AFPointsInFocus) - 20usize];
    ["Offset of field: libraw_pentax_makernotes_t::FocusPosition"]
        [::std::mem::offset_of!(libraw_pentax_makernotes_t, FocusPosition) - 24usize];
    ["Offset of field: libraw_pentax_makernotes_t::AFAdjustment"]
        [::std::mem::offset_of!(libraw_pentax_makernotes_t, AFAdjustment) - 26usize];
    ["Offset of field: libraw_pentax_makernotes_t::AFPointMode"]
        [::std::mem::offset_of!(libraw_pentax_makernotes_t, AFPointMode) - 28usize];
    ["Offset of field: libraw_pentax_makernotes_t::MultiExposure"]
        [::std::mem::offset_of!(libraw_pentax_makernotes_t, MultiExposure) - 29usize];
    ["Offset of field: libraw_pentax_makernotes_t::Quality"]
        [::std::mem::offset_of!(libraw_pentax_makernotes_t, Quality) - 30usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_ricoh_makernotes_t {
    pub AFStatus: ushort,
    pub AFAreaXPosition: [::std::os::raw::c_uint; 2usize],
    pub AFAreaYPosition: [::std::os::raw::c_uint; 2usize],
    pub AFAreaMode: ushort,
    pub SensorWidth: ::std::os::raw::c_uint,
    pub SensorHeight: ::std::os::raw::c_uint,
    pub CroppedImageWidth: ::std::os::raw::c_uint,
    pub CroppedImageHeight: ::std::os::raw::c_uint,
    pub WideAdapter: ushort,
    pub CropMode: ushort,
    pub NDFilter: ushort,
    pub AutoBracketing: ushort,
    pub MacroMode: ushort,
    pub FlashMode: ushort,
    pub FlashExposureComp: f64,
    pub ManualFlashOutput: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_ricoh_makernotes_t"]
        [::std::mem::size_of::<libraw_ricoh_makernotes_t>() - 72usize];
    ["Alignment of libraw_ricoh_makernotes_t"]
        [::std::mem::align_of::<libraw_ricoh_makernotes_t>() - 8usize];
    ["Offset of field: libraw_ricoh_makernotes_t::AFStatus"]
        [::std::mem::offset_of!(libraw_ricoh_makernotes_t, AFStatus) - 0usize];
    ["Offset of field: libraw_ricoh_makernotes_t::AFAreaXPosition"]
        [::std::mem::offset_of!(libraw_ricoh_makernotes_t, AFAreaXPosition) - 4usize];
    ["Offset of field: libraw_ricoh_makernotes_t::AFAreaYPosition"]
        [::std::mem::offset_of!(libraw_ricoh_makernotes_t, AFAreaYPosition) - 12usize];
    ["Offset of field: libraw_ricoh_makernotes_t::AFAreaMode"]
        [::std::mem::offset_of!(libraw_ricoh_makernotes_t, AFAreaMode) - 20usize];
    ["Offset of field: libraw_ricoh_makernotes_t::SensorWidth"]
        [::std::mem::offset_of!(libraw_ricoh_makernotes_t, SensorWidth) - 24usize];
    ["Offset of field: libraw_ricoh_makernotes_t::SensorHeight"]
        [::std::mem::offset_of!(libraw_ricoh_makernotes_t, SensorHeight) - 28usize];
    ["Offset of field: libraw_ricoh_makernotes_t::CroppedImageWidth"]
        [::std::mem::offset_of!(libraw_ricoh_makernotes_t, CroppedImageWidth) - 32usize];
    ["Offset of field: libraw_ricoh_makernotes_t::CroppedImageHeight"]
        [::std::mem::offset_of!(libraw_ricoh_makernotes_t, CroppedImageHeight) - 36usize];
    ["Offset of field: libraw_ricoh_makernotes_t::WideAdapter"]
        [::std::mem::offset_of!(libraw_ricoh_makernotes_t, WideAdapter) - 40usize];
    ["Offset of field: libraw_ricoh_makernotes_t::CropMode"]
        [::std::mem::offset_of!(libraw_ricoh_makernotes_t, CropMode) - 42usize];
    ["Offset of field: libraw_ricoh_makernotes_t::NDFilter"]
        [::std::mem::offset_of!(libraw_ricoh_makernotes_t, NDFilter) - 44usize];
    ["Offset of field: libraw_ricoh_makernotes_t::AutoBracketing"]
        [::std::mem::offset_of!(libraw_ricoh_makernotes_t, AutoBracketing) - 46usize];
    ["Offset of field: libraw_ricoh_makernotes_t::MacroMode"]
        [::std::mem::offset_of!(libraw_ricoh_makernotes_t, MacroMode) - 48usize];
    ["Offset of field: libraw_ricoh_makernotes_t::FlashMode"]
        [::std::mem::offset_of!(libraw_ricoh_makernotes_t, FlashMode) - 50usize];
    ["Offset of field: libraw_ricoh_makernotes_t::FlashExposureComp"]
        [::std::mem::offset_of!(libraw_ricoh_makernotes_t, FlashExposureComp) - 56usize];
    ["Offset of field: libraw_ricoh_makernotes_t::ManualFlashOutput"]
        [::std::mem::offset_of!(libraw_ricoh_makernotes_t, ManualFlashOutput) - 64usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_samsung_makernotes_t {
    pub ImageSizeFull: [::std::os::raw::c_uint; 4usize],
    pub ImageSizeCrop: [::std::os::raw::c_uint; 4usize],
    pub ColorSpace: [::std::os::raw::c_int; 2usize],
    pub key: [::std::os::raw::c_uint; 11usize],
    pub DigitalGain: f64,
    pub DeviceType: ::std::os::raw::c_int,
    pub LensFirmware: [::std::os::raw::c_char; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_samsung_makernotes_t"]
        [::std::mem::size_of::<libraw_samsung_makernotes_t>() - 136usize];
    ["Alignment of libraw_samsung_makernotes_t"]
        [::std::mem::align_of::<libraw_samsung_makernotes_t>() - 8usize];
    ["Offset of field: libraw_samsung_makernotes_t::ImageSizeFull"]
        [::std::mem::offset_of!(libraw_samsung_makernotes_t, ImageSizeFull) - 0usize];
    ["Offset of field: libraw_samsung_makernotes_t::ImageSizeCrop"]
        [::std::mem::offset_of!(libraw_samsung_makernotes_t, ImageSizeCrop) - 16usize];
    ["Offset of field: libraw_samsung_makernotes_t::ColorSpace"]
        [::std::mem::offset_of!(libraw_samsung_makernotes_t, ColorSpace) - 32usize];
    ["Offset of field: libraw_samsung_makernotes_t::key"]
        [::std::mem::offset_of!(libraw_samsung_makernotes_t, key) - 40usize];
    ["Offset of field: libraw_samsung_makernotes_t::DigitalGain"]
        [::std::mem::offset_of!(libraw_samsung_makernotes_t, DigitalGain) - 88usize];
    ["Offset of field: libraw_samsung_makernotes_t::DeviceType"]
        [::std::mem::offset_of!(libraw_samsung_makernotes_t, DeviceType) - 96usize];
    ["Offset of field: libraw_samsung_makernotes_t::LensFirmware"]
        [::std::mem::offset_of!(libraw_samsung_makernotes_t, LensFirmware) - 100usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_kodak_makernotes_t {
    pub BlackLevelTop: ushort,
    pub BlackLevelBottom: ushort,
    pub offset_left: ::std::os::raw::c_short,
    pub offset_top: ::std::os::raw::c_short,
    pub clipBlack: ushort,
    pub clipWhite: ushort,
    pub romm_camDaylight: [[f32; 3usize]; 3usize],
    pub romm_camTungsten: [[f32; 3usize]; 3usize],
    pub romm_camFluorescent: [[f32; 3usize]; 3usize],
    pub romm_camFlash: [[f32; 3usize]; 3usize],
    pub romm_camCustom: [[f32; 3usize]; 3usize],
    pub romm_camAuto: [[f32; 3usize]; 3usize],
    pub val018percent: ushort,
    pub val100percent: ushort,
    pub val170percent: ushort,
    pub MakerNoteKodak8a: ::std::os::raw::c_short,
    pub ISOCalibrationGain: f32,
    pub AnalogISO: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_kodak_makernotes_t"]
        [::std::mem::size_of::<libraw_kodak_makernotes_t>() - 244usize];
    ["Alignment of libraw_kodak_makernotes_t"]
        [::std::mem::align_of::<libraw_kodak_makernotes_t>() - 4usize];
    ["Offset of field: libraw_kodak_makernotes_t::BlackLevelTop"]
        [::std::mem::offset_of!(libraw_kodak_makernotes_t, BlackLevelTop) - 0usize];
    ["Offset of field: libraw_kodak_makernotes_t::BlackLevelBottom"]
        [::std::mem::offset_of!(libraw_kodak_makernotes_t, BlackLevelBottom) - 2usize];
    ["Offset of field: libraw_kodak_makernotes_t::offset_left"]
        [::std::mem::offset_of!(libraw_kodak_makernotes_t, offset_left) - 4usize];
    ["Offset of field: libraw_kodak_makernotes_t::offset_top"]
        [::std::mem::offset_of!(libraw_kodak_makernotes_t, offset_top) - 6usize];
    ["Offset of field: libraw_kodak_makernotes_t::clipBlack"]
        [::std::mem::offset_of!(libraw_kodak_makernotes_t, clipBlack) - 8usize];
    ["Offset of field: libraw_kodak_makernotes_t::clipWhite"]
        [::std::mem::offset_of!(libraw_kodak_makernotes_t, clipWhite) - 10usize];
    ["Offset of field: libraw_kodak_makernotes_t::romm_camDaylight"]
        [::std::mem::offset_of!(libraw_kodak_makernotes_t, romm_camDaylight) - 12usize];
    ["Offset of field: libraw_kodak_makernotes_t::romm_camTungsten"]
        [::std::mem::offset_of!(libraw_kodak_makernotes_t, romm_camTungsten) - 48usize];
    ["Offset of field: libraw_kodak_makernotes_t::romm_camFluorescent"]
        [::std::mem::offset_of!(libraw_kodak_makernotes_t, romm_camFluorescent) - 84usize];
    ["Offset of field: libraw_kodak_makernotes_t::romm_camFlash"]
        [::std::mem::offset_of!(libraw_kodak_makernotes_t, romm_camFlash) - 120usize];
    ["Offset of field: libraw_kodak_makernotes_t::romm_camCustom"]
        [::std::mem::offset_of!(libraw_kodak_makernotes_t, romm_camCustom) - 156usize];
    ["Offset of field: libraw_kodak_makernotes_t::romm_camAuto"]
        [::std::mem::offset_of!(libraw_kodak_makernotes_t, romm_camAuto) - 192usize];
    ["Offset of field: libraw_kodak_makernotes_t::val018percent"]
        [::std::mem::offset_of!(libraw_kodak_makernotes_t, val018percent) - 228usize];
    ["Offset of field: libraw_kodak_makernotes_t::val100percent"]
        [::std::mem::offset_of!(libraw_kodak_makernotes_t, val100percent) - 230usize];
    ["Offset of field: libraw_kodak_makernotes_t::val170percent"]
        [::std::mem::offset_of!(libraw_kodak_makernotes_t, val170percent) - 232usize];
    ["Offset of field: libraw_kodak_makernotes_t::MakerNoteKodak8a"]
        [::std::mem::offset_of!(libraw_kodak_makernotes_t, MakerNoteKodak8a) - 234usize];
    ["Offset of field: libraw_kodak_makernotes_t::ISOCalibrationGain"]
        [::std::mem::offset_of!(libraw_kodak_makernotes_t, ISOCalibrationGain) - 236usize];
    ["Offset of field: libraw_kodak_makernotes_t::AnalogISO"]
        [::std::mem::offset_of!(libraw_kodak_makernotes_t, AnalogISO) - 240usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_p1_makernotes_t {
    pub Software: [::std::os::raw::c_char; 64usize],
    pub SystemType: [::std::os::raw::c_char; 64usize],
    pub FirmwareString: [::std::os::raw::c_char; 256usize],
    pub SystemModel: [::std::os::raw::c_char; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_p1_makernotes_t"][::std::mem::size_of::<libraw_p1_makernotes_t>() - 448usize];
    ["Alignment of libraw_p1_makernotes_t"]
        [::std::mem::align_of::<libraw_p1_makernotes_t>() - 1usize];
    ["Offset of field: libraw_p1_makernotes_t::Software"]
        [::std::mem::offset_of!(libraw_p1_makernotes_t, Software) - 0usize];
    ["Offset of field: libraw_p1_makernotes_t::SystemType"]
        [::std::mem::offset_of!(libraw_p1_makernotes_t, SystemType) - 64usize];
    ["Offset of field: libraw_p1_makernotes_t::FirmwareString"]
        [::std::mem::offset_of!(libraw_p1_makernotes_t, FirmwareString) - 128usize];
    ["Offset of field: libraw_p1_makernotes_t::SystemModel"]
        [::std::mem::offset_of!(libraw_p1_makernotes_t, SystemModel) - 384usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_sony_info_t {
    pub CameraType: ushort,
    pub Sony0x9400_version: uchar,
    pub Sony0x9400_ReleaseMode2: uchar,
    pub Sony0x9400_SequenceImageNumber: ::std::os::raw::c_uint,
    pub Sony0x9400_SequenceLength1: uchar,
    pub Sony0x9400_SequenceFileNumber: ::std::os::raw::c_uint,
    pub Sony0x9400_SequenceLength2: uchar,
    pub AFAreaModeSetting: u8,
    pub AFAreaMode: u16,
    pub FlexibleSpotPosition: [ushort; 2usize],
    pub AFPointSelected: u8,
    pub AFPointSelected_0x201e: u8,
    pub nAFPointsUsed: ::std::os::raw::c_short,
    pub AFPointsUsed: [u8; 10usize],
    pub AFTracking: u8,
    pub AFType: u8,
    pub FocusLocation: [ushort; 4usize],
    pub FocusPosition: ushort,
    pub AFMicroAdjValue: i8,
    pub AFMicroAdjOn: i8,
    pub AFMicroAdjRegisteredLenses: uchar,
    pub VariableLowPassFilter: ushort,
    pub LongExposureNoiseReduction: ::std::os::raw::c_uint,
    pub HighISONoiseReduction: ushort,
    pub HDR: [ushort; 2usize],
    pub group2010: ushort,
    pub group9050: ushort,
    pub len_group9050: ushort,
    pub real_iso_offset: ushort,
    pub MeteringMode_offset: ushort,
    pub ExposureProgram_offset: ushort,
    pub ReleaseMode2_offset: ushort,
    pub MinoltaCamID: ::std::os::raw::c_uint,
    pub firmware: f32,
    pub ImageCount3_offset: ushort,
    pub ImageCount3: ::std::os::raw::c_uint,
    pub ElectronicFrontCurtainShutter: ::std::os::raw::c_uint,
    pub MeteringMode2: ushort,
    pub SonyDateTime: [::std::os::raw::c_char; 20usize],
    pub ShotNumberSincePowerUp: ::std::os::raw::c_uint,
    pub PixelShiftGroupPrefix: ushort,
    pub PixelShiftGroupID: ::std::os::raw::c_uint,
    pub nShotsInPixelShiftGroup: ::std::os::raw::c_char,
    pub numInPixelShiftGroup: ::std::os::raw::c_char,
    pub prd_ImageHeight: ushort,
    pub prd_ImageWidth: ushort,
    pub prd_Total_bps: ushort,
    pub prd_Active_bps: ushort,
    pub prd_StorageMethod: ushort,
    pub prd_BayerPattern: ushort,
    pub SonyRawFileType: ushort,
    pub RAWFileType: ushort,
    pub RawSizeType: ushort,
    pub Quality: ::std::os::raw::c_uint,
    pub FileFormat: ushort,
    pub MetaVersion: [::std::os::raw::c_char; 16usize],
    pub AspectRatio: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_sony_info_t"][::std::mem::size_of::<libraw_sony_info_t>() - 184usize];
    ["Alignment of libraw_sony_info_t"][::std::mem::align_of::<libraw_sony_info_t>() - 4usize];
    ["Offset of field: libraw_sony_info_t::CameraType"]
        [::std::mem::offset_of!(libraw_sony_info_t, CameraType) - 0usize];
    ["Offset of field: libraw_sony_info_t::Sony0x9400_version"]
        [::std::mem::offset_of!(libraw_sony_info_t, Sony0x9400_version) - 2usize];
    ["Offset of field: libraw_sony_info_t::Sony0x9400_ReleaseMode2"]
        [::std::mem::offset_of!(libraw_sony_info_t, Sony0x9400_ReleaseMode2) - 3usize];
    ["Offset of field: libraw_sony_info_t::Sony0x9400_SequenceImageNumber"]
        [::std::mem::offset_of!(libraw_sony_info_t, Sony0x9400_SequenceImageNumber) - 4usize];
    ["Offset of field: libraw_sony_info_t::Sony0x9400_SequenceLength1"]
        [::std::mem::offset_of!(libraw_sony_info_t, Sony0x9400_SequenceLength1) - 8usize];
    ["Offset of field: libraw_sony_info_t::Sony0x9400_SequenceFileNumber"]
        [::std::mem::offset_of!(libraw_sony_info_t, Sony0x9400_SequenceFileNumber) - 12usize];
    ["Offset of field: libraw_sony_info_t::Sony0x9400_SequenceLength2"]
        [::std::mem::offset_of!(libraw_sony_info_t, Sony0x9400_SequenceLength2) - 16usize];
    ["Offset of field: libraw_sony_info_t::AFAreaModeSetting"]
        [::std::mem::offset_of!(libraw_sony_info_t, AFAreaModeSetting) - 17usize];
    ["Offset of field: libraw_sony_info_t::AFAreaMode"]
        [::std::mem::offset_of!(libraw_sony_info_t, AFAreaMode) - 18usize];
    ["Offset of field: libraw_sony_info_t::FlexibleSpotPosition"]
        [::std::mem::offset_of!(libraw_sony_info_t, FlexibleSpotPosition) - 20usize];
    ["Offset of field: libraw_sony_info_t::AFPointSelected"]
        [::std::mem::offset_of!(libraw_sony_info_t, AFPointSelected) - 24usize];
    ["Offset of field: libraw_sony_info_t::AFPointSelected_0x201e"]
        [::std::mem::offset_of!(libraw_sony_info_t, AFPointSelected_0x201e) - 25usize];
    ["Offset of field: libraw_sony_info_t::nAFPointsUsed"]
        [::std::mem::offset_of!(libraw_sony_info_t, nAFPointsUsed) - 26usize];
    ["Offset of field: libraw_sony_info_t::AFPointsUsed"]
        [::std::mem::offset_of!(libraw_sony_info_t, AFPointsUsed) - 28usize];
    ["Offset of field: libraw_sony_info_t::AFTracking"]
        [::std::mem::offset_of!(libraw_sony_info_t, AFTracking) - 38usize];
    ["Offset of field: libraw_sony_info_t::AFType"]
        [::std::mem::offset_of!(libraw_sony_info_t, AFType) - 39usize];
    ["Offset of field: libraw_sony_info_t::FocusLocation"]
        [::std::mem::offset_of!(libraw_sony_info_t, FocusLocation) - 40usize];
    ["Offset of field: libraw_sony_info_t::FocusPosition"]
        [::std::mem::offset_of!(libraw_sony_info_t, FocusPosition) - 48usize];
    ["Offset of field: libraw_sony_info_t::AFMicroAdjValue"]
        [::std::mem::offset_of!(libraw_sony_info_t, AFMicroAdjValue) - 50usize];
    ["Offset of field: libraw_sony_info_t::AFMicroAdjOn"]
        [::std::mem::offset_of!(libraw_sony_info_t, AFMicroAdjOn) - 51usize];
    ["Offset of field: libraw_sony_info_t::AFMicroAdjRegisteredLenses"]
        [::std::mem::offset_of!(libraw_sony_info_t, AFMicroAdjRegisteredLenses) - 52usize];
    ["Offset of field: libraw_sony_info_t::VariableLowPassFilter"]
        [::std::mem::offset_of!(libraw_sony_info_t, VariableLowPassFilter) - 54usize];
    ["Offset of field: libraw_sony_info_t::LongExposureNoiseReduction"]
        [::std::mem::offset_of!(libraw_sony_info_t, LongExposureNoiseReduction) - 56usize];
    ["Offset of field: libraw_sony_info_t::HighISONoiseReduction"]
        [::std::mem::offset_of!(libraw_sony_info_t, HighISONoiseReduction) - 60usize];
    ["Offset of field: libraw_sony_info_t::HDR"]
        [::std::mem::offset_of!(libraw_sony_info_t, HDR) - 62usize];
    ["Offset of field: libraw_sony_info_t::group2010"]
        [::std::mem::offset_of!(libraw_sony_info_t, group2010) - 66usize];
    ["Offset of field: libraw_sony_info_t::group9050"]
        [::std::mem::offset_of!(libraw_sony_info_t, group9050) - 68usize];
    ["Offset of field: libraw_sony_info_t::len_group9050"]
        [::std::mem::offset_of!(libraw_sony_info_t, len_group9050) - 70usize];
    ["Offset of field: libraw_sony_info_t::real_iso_offset"]
        [::std::mem::offset_of!(libraw_sony_info_t, real_iso_offset) - 72usize];
    ["Offset of field: libraw_sony_info_t::MeteringMode_offset"]
        [::std::mem::offset_of!(libraw_sony_info_t, MeteringMode_offset) - 74usize];
    ["Offset of field: libraw_sony_info_t::ExposureProgram_offset"]
        [::std::mem::offset_of!(libraw_sony_info_t, ExposureProgram_offset) - 76usize];
    ["Offset of field: libraw_sony_info_t::ReleaseMode2_offset"]
        [::std::mem::offset_of!(libraw_sony_info_t, ReleaseMode2_offset) - 78usize];
    ["Offset of field: libraw_sony_info_t::MinoltaCamID"]
        [::std::mem::offset_of!(libraw_sony_info_t, MinoltaCamID) - 80usize];
    ["Offset of field: libraw_sony_info_t::firmware"]
        [::std::mem::offset_of!(libraw_sony_info_t, firmware) - 84usize];
    ["Offset of field: libraw_sony_info_t::ImageCount3_offset"]
        [::std::mem::offset_of!(libraw_sony_info_t, ImageCount3_offset) - 88usize];
    ["Offset of field: libraw_sony_info_t::ImageCount3"]
        [::std::mem::offset_of!(libraw_sony_info_t, ImageCount3) - 92usize];
    ["Offset of field: libraw_sony_info_t::ElectronicFrontCurtainShutter"]
        [::std::mem::offset_of!(libraw_sony_info_t, ElectronicFrontCurtainShutter) - 96usize];
    ["Offset of field: libraw_sony_info_t::MeteringMode2"]
        [::std::mem::offset_of!(libraw_sony_info_t, MeteringMode2) - 100usize];
    ["Offset of field: libraw_sony_info_t::SonyDateTime"]
        [::std::mem::offset_of!(libraw_sony_info_t, SonyDateTime) - 102usize];
    ["Offset of field: libraw_sony_info_t::ShotNumberSincePowerUp"]
        [::std::mem::offset_of!(libraw_sony_info_t, ShotNumberSincePowerUp) - 124usize];
    ["Offset of field: libraw_sony_info_t::PixelShiftGroupPrefix"]
        [::std::mem::offset_of!(libraw_sony_info_t, PixelShiftGroupPrefix) - 128usize];
    ["Offset of field: libraw_sony_info_t::PixelShiftGroupID"]
        [::std::mem::offset_of!(libraw_sony_info_t, PixelShiftGroupID) - 132usize];
    ["Offset of field: libraw_sony_info_t::nShotsInPixelShiftGroup"]
        [::std::mem::offset_of!(libraw_sony_info_t, nShotsInPixelShiftGroup) - 136usize];
    ["Offset of field: libraw_sony_info_t::numInPixelShiftGroup"]
        [::std::mem::offset_of!(libraw_sony_info_t, numInPixelShiftGroup) - 137usize];
    ["Offset of field: libraw_sony_info_t::prd_ImageHeight"]
        [::std::mem::offset_of!(libraw_sony_info_t, prd_ImageHeight) - 138usize];
    ["Offset of field: libraw_sony_info_t::prd_ImageWidth"]
        [::std::mem::offset_of!(libraw_sony_info_t, prd_ImageWidth) - 140usize];
    ["Offset of field: libraw_sony_info_t::prd_Total_bps"]
        [::std::mem::offset_of!(libraw_sony_info_t, prd_Total_bps) - 142usize];
    ["Offset of field: libraw_sony_info_t::prd_Active_bps"]
        [::std::mem::offset_of!(libraw_sony_info_t, prd_Active_bps) - 144usize];
    ["Offset of field: libraw_sony_info_t::prd_StorageMethod"]
        [::std::mem::offset_of!(libraw_sony_info_t, prd_StorageMethod) - 146usize];
    ["Offset of field: libraw_sony_info_t::prd_BayerPattern"]
        [::std::mem::offset_of!(libraw_sony_info_t, prd_BayerPattern) - 148usize];
    ["Offset of field: libraw_sony_info_t::SonyRawFileType"]
        [::std::mem::offset_of!(libraw_sony_info_t, SonyRawFileType) - 150usize];
    ["Offset of field: libraw_sony_info_t::RAWFileType"]
        [::std::mem::offset_of!(libraw_sony_info_t, RAWFileType) - 152usize];
    ["Offset of field: libraw_sony_info_t::RawSizeType"]
        [::std::mem::offset_of!(libraw_sony_info_t, RawSizeType) - 154usize];
    ["Offset of field: libraw_sony_info_t::Quality"]
        [::std::mem::offset_of!(libraw_sony_info_t, Quality) - 156usize];
    ["Offset of field: libraw_sony_info_t::FileFormat"]
        [::std::mem::offset_of!(libraw_sony_info_t, FileFormat) - 160usize];
    ["Offset of field: libraw_sony_info_t::MetaVersion"]
        [::std::mem::offset_of!(libraw_sony_info_t, MetaVersion) - 162usize];
    ["Offset of field: libraw_sony_info_t::AspectRatio"]
        [::std::mem::offset_of!(libraw_sony_info_t, AspectRatio) - 180usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_colordata_t {
    pub curve: [ushort; 65536usize],
    pub cblack: [::std::os::raw::c_uint; 4104usize],
    pub black: ::std::os::raw::c_uint,
    pub data_maximum: ::std::os::raw::c_uint,
    pub maximum: ::std::os::raw::c_uint,
    pub linear_max: [::std::os::raw::c_long; 4usize],
    pub fmaximum: f32,
    pub fnorm: f32,
    pub white: [[ushort; 8usize]; 8usize],
    pub cam_mul: [f32; 4usize],
    pub pre_mul: [f32; 4usize],
    pub cmatrix: [[f32; 4usize]; 3usize],
    pub ccm: [[f32; 4usize]; 3usize],
    pub rgb_cam: [[f32; 4usize]; 3usize],
    pub cam_xyz: [[f32; 3usize]; 4usize],
    pub phase_one_data: ph1_t,
    pub flash_used: f32,
    pub canon_ev: f32,
    pub model2: [::std::os::raw::c_char; 64usize],
    pub UniqueCameraModel: [::std::os::raw::c_char; 64usize],
    pub LocalizedCameraModel: [::std::os::raw::c_char; 64usize],
    pub ImageUniqueID: [::std::os::raw::c_char; 64usize],
    pub RawDataUniqueID: [::std::os::raw::c_char; 17usize],
    pub OriginalRawFileName: [::std::os::raw::c_char; 64usize],
    pub profile: *mut ::std::os::raw::c_void,
    pub profile_length: ::std::os::raw::c_uint,
    pub black_stat: [::std::os::raw::c_uint; 8usize],
    pub dng_color: [libraw_dng_color_t; 2usize],
    pub dng_levels: libraw_dng_levels_t,
    pub WB_Coeffs: [[::std::os::raw::c_int; 4usize]; 256usize],
    pub WBCT_Coeffs: [[f32; 5usize]; 64usize],
    pub as_shot_wb_applied: ::std::os::raw::c_int,
    pub P1_color: [libraw_P1_color_t; 2usize],
    pub raw_bps: ::std::os::raw::c_uint,
    pub ExifColorSpace: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_colordata_t"][::std::mem::size_of::<libraw_colordata_t>() - 187048usize];
    ["Alignment of libraw_colordata_t"][::std::mem::align_of::<libraw_colordata_t>() - 8usize];
    ["Offset of field: libraw_colordata_t::curve"]
        [::std::mem::offset_of!(libraw_colordata_t, curve) - 0usize];
    ["Offset of field: libraw_colordata_t::cblack"]
        [::std::mem::offset_of!(libraw_colordata_t, cblack) - 131072usize];
    ["Offset of field: libraw_colordata_t::black"]
        [::std::mem::offset_of!(libraw_colordata_t, black) - 147488usize];
    ["Offset of field: libraw_colordata_t::data_maximum"]
        [::std::mem::offset_of!(libraw_colordata_t, data_maximum) - 147492usize];
    ["Offset of field: libraw_colordata_t::maximum"]
        [::std::mem::offset_of!(libraw_colordata_t, maximum) - 147496usize];
    ["Offset of field: libraw_colordata_t::linear_max"]
        [::std::mem::offset_of!(libraw_colordata_t, linear_max) - 147504usize];
    ["Offset of field: libraw_colordata_t::fmaximum"]
        [::std::mem::offset_of!(libraw_colordata_t, fmaximum) - 147536usize];
    ["Offset of field: libraw_colordata_t::fnorm"]
        [::std::mem::offset_of!(libraw_colordata_t, fnorm) - 147540usize];
    ["Offset of field: libraw_colordata_t::white"]
        [::std::mem::offset_of!(libraw_colordata_t, white) - 147544usize];
    ["Offset of field: libraw_colordata_t::cam_mul"]
        [::std::mem::offset_of!(libraw_colordata_t, cam_mul) - 147672usize];
    ["Offset of field: libraw_colordata_t::pre_mul"]
        [::std::mem::offset_of!(libraw_colordata_t, pre_mul) - 147688usize];
    ["Offset of field: libraw_colordata_t::cmatrix"]
        [::std::mem::offset_of!(libraw_colordata_t, cmatrix) - 147704usize];
    ["Offset of field: libraw_colordata_t::ccm"]
        [::std::mem::offset_of!(libraw_colordata_t, ccm) - 147752usize];
    ["Offset of field: libraw_colordata_t::rgb_cam"]
        [::std::mem::offset_of!(libraw_colordata_t, rgb_cam) - 147800usize];
    ["Offset of field: libraw_colordata_t::cam_xyz"]
        [::std::mem::offset_of!(libraw_colordata_t, cam_xyz) - 147848usize];
    ["Offset of field: libraw_colordata_t::phase_one_data"]
        [::std::mem::offset_of!(libraw_colordata_t, phase_one_data) - 147896usize];
    ["Offset of field: libraw_colordata_t::flash_used"]
        [::std::mem::offset_of!(libraw_colordata_t, flash_used) - 147932usize];
    ["Offset of field: libraw_colordata_t::canon_ev"]
        [::std::mem::offset_of!(libraw_colordata_t, canon_ev) - 147936usize];
    ["Offset of field: libraw_colordata_t::model2"]
        [::std::mem::offset_of!(libraw_colordata_t, model2) - 147940usize];
    ["Offset of field: libraw_colordata_t::UniqueCameraModel"]
        [::std::mem::offset_of!(libraw_colordata_t, UniqueCameraModel) - 148004usize];
    ["Offset of field: libraw_colordata_t::LocalizedCameraModel"]
        [::std::mem::offset_of!(libraw_colordata_t, LocalizedCameraModel) - 148068usize];
    ["Offset of field: libraw_colordata_t::ImageUniqueID"]
        [::std::mem::offset_of!(libraw_colordata_t, ImageUniqueID) - 148132usize];
    ["Offset of field: libraw_colordata_t::RawDataUniqueID"]
        [::std::mem::offset_of!(libraw_colordata_t, RawDataUniqueID) - 148196usize];
    ["Offset of field: libraw_colordata_t::OriginalRawFileName"]
        [::std::mem::offset_of!(libraw_colordata_t, OriginalRawFileName) - 148213usize];
    ["Offset of field: libraw_colordata_t::profile"]
        [::std::mem::offset_of!(libraw_colordata_t, profile) - 148280usize];
    ["Offset of field: libraw_colordata_t::profile_length"]
        [::std::mem::offset_of!(libraw_colordata_t, profile_length) - 148288usize];
    ["Offset of field: libraw_colordata_t::black_stat"]
        [::std::mem::offset_of!(libraw_colordata_t, black_stat) - 148292usize];
    ["Offset of field: libraw_colordata_t::dng_color"]
        [::std::mem::offset_of!(libraw_colordata_t, dng_color) - 148324usize];
    ["Offset of field: libraw_colordata_t::dng_levels"]
        [::std::mem::offset_of!(libraw_colordata_t, dng_levels) - 148660usize];
    ["Offset of field: libraw_colordata_t::WB_Coeffs"]
        [::std::mem::offset_of!(libraw_colordata_t, WB_Coeffs) - 181588usize];
    ["Offset of field: libraw_colordata_t::WBCT_Coeffs"]
        [::std::mem::offset_of!(libraw_colordata_t, WBCT_Coeffs) - 185684usize];
    ["Offset of field: libraw_colordata_t::as_shot_wb_applied"]
        [::std::mem::offset_of!(libraw_colordata_t, as_shot_wb_applied) - 186964usize];
    ["Offset of field: libraw_colordata_t::P1_color"]
        [::std::mem::offset_of!(libraw_colordata_t, P1_color) - 186968usize];
    ["Offset of field: libraw_colordata_t::raw_bps"]
        [::std::mem::offset_of!(libraw_colordata_t, raw_bps) - 187040usize];
    ["Offset of field: libraw_colordata_t::ExifColorSpace"]
        [::std::mem::offset_of!(libraw_colordata_t, ExifColorSpace) - 187044usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_thumbnail_t {
    pub tformat: LibRaw_thumbnail_formats,
    pub twidth: ushort,
    pub theight: ushort,
    pub tlength: ::std::os::raw::c_uint,
    pub tcolors: ::std::os::raw::c_int,
    pub thumb: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_thumbnail_t"][::std::mem::size_of::<libraw_thumbnail_t>() - 24usize];
    ["Alignment of libraw_thumbnail_t"][::std::mem::align_of::<libraw_thumbnail_t>() - 8usize];
    ["Offset of field: libraw_thumbnail_t::tformat"]
        [::std::mem::offset_of!(libraw_thumbnail_t, tformat) - 0usize];
    ["Offset of field: libraw_thumbnail_t::twidth"]
        [::std::mem::offset_of!(libraw_thumbnail_t, twidth) - 4usize];
    ["Offset of field: libraw_thumbnail_t::theight"]
        [::std::mem::offset_of!(libraw_thumbnail_t, theight) - 6usize];
    ["Offset of field: libraw_thumbnail_t::tlength"]
        [::std::mem::offset_of!(libraw_thumbnail_t, tlength) - 8usize];
    ["Offset of field: libraw_thumbnail_t::tcolors"]
        [::std::mem::offset_of!(libraw_thumbnail_t, tcolors) - 12usize];
    ["Offset of field: libraw_thumbnail_t::thumb"]
        [::std::mem::offset_of!(libraw_thumbnail_t, thumb) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_thumbnail_item_t {
    pub tformat: LibRaw_internal_thumbnail_formats,
    pub twidth: ushort,
    pub theight: ushort,
    pub tflip: ushort,
    pub tlength: ::std::os::raw::c_uint,
    pub tmisc: ::std::os::raw::c_uint,
    pub toffset: INT64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_thumbnail_item_t"][::std::mem::size_of::<libraw_thumbnail_item_t>() - 32usize];
    ["Alignment of libraw_thumbnail_item_t"]
        [::std::mem::align_of::<libraw_thumbnail_item_t>() - 8usize];
    ["Offset of field: libraw_thumbnail_item_t::tformat"]
        [::std::mem::offset_of!(libraw_thumbnail_item_t, tformat) - 0usize];
    ["Offset of field: libraw_thumbnail_item_t::twidth"]
        [::std::mem::offset_of!(libraw_thumbnail_item_t, twidth) - 4usize];
    ["Offset of field: libraw_thumbnail_item_t::theight"]
        [::std::mem::offset_of!(libraw_thumbnail_item_t, theight) - 6usize];
    ["Offset of field: libraw_thumbnail_item_t::tflip"]
        [::std::mem::offset_of!(libraw_thumbnail_item_t, tflip) - 8usize];
    ["Offset of field: libraw_thumbnail_item_t::tlength"]
        [::std::mem::offset_of!(libraw_thumbnail_item_t, tlength) - 12usize];
    ["Offset of field: libraw_thumbnail_item_t::tmisc"]
        [::std::mem::offset_of!(libraw_thumbnail_item_t, tmisc) - 16usize];
    ["Offset of field: libraw_thumbnail_item_t::toffset"]
        [::std::mem::offset_of!(libraw_thumbnail_item_t, toffset) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_thumbnail_list_t {
    pub thumbcount: ::std::os::raw::c_int,
    pub thumblist: [libraw_thumbnail_item_t; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_thumbnail_list_t"]
        [::std::mem::size_of::<libraw_thumbnail_list_t>() - 264usize];
    ["Alignment of libraw_thumbnail_list_t"]
        [::std::mem::align_of::<libraw_thumbnail_list_t>() - 8usize];
    ["Offset of field: libraw_thumbnail_list_t::thumbcount"]
        [::std::mem::offset_of!(libraw_thumbnail_list_t, thumbcount) - 0usize];
    ["Offset of field: libraw_thumbnail_list_t::thumblist"]
        [::std::mem::offset_of!(libraw_thumbnail_list_t, thumblist) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_gps_info_t {
    pub latitude: [f32; 3usize],
    pub longitude: [f32; 3usize],
    pub gpstimestamp: [f32; 3usize],
    pub altitude: f32,
    pub altref: ::std::os::raw::c_char,
    pub latref: ::std::os::raw::c_char,
    pub longref: ::std::os::raw::c_char,
    pub gpsstatus: ::std::os::raw::c_char,
    pub gpsparsed: ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_gps_info_t"][::std::mem::size_of::<libraw_gps_info_t>() - 48usize];
    ["Alignment of libraw_gps_info_t"][::std::mem::align_of::<libraw_gps_info_t>() - 4usize];
    ["Offset of field: libraw_gps_info_t::latitude"]
        [::std::mem::offset_of!(libraw_gps_info_t, latitude) - 0usize];
    ["Offset of field: libraw_gps_info_t::longitude"]
        [::std::mem::offset_of!(libraw_gps_info_t, longitude) - 12usize];
    ["Offset of field: libraw_gps_info_t::gpstimestamp"]
        [::std::mem::offset_of!(libraw_gps_info_t, gpstimestamp) - 24usize];
    ["Offset of field: libraw_gps_info_t::altitude"]
        [::std::mem::offset_of!(libraw_gps_info_t, altitude) - 36usize];
    ["Offset of field: libraw_gps_info_t::altref"]
        [::std::mem::offset_of!(libraw_gps_info_t, altref) - 40usize];
    ["Offset of field: libraw_gps_info_t::latref"]
        [::std::mem::offset_of!(libraw_gps_info_t, latref) - 41usize];
    ["Offset of field: libraw_gps_info_t::longref"]
        [::std::mem::offset_of!(libraw_gps_info_t, longref) - 42usize];
    ["Offset of field: libraw_gps_info_t::gpsstatus"]
        [::std::mem::offset_of!(libraw_gps_info_t, gpsstatus) - 43usize];
    ["Offset of field: libraw_gps_info_t::gpsparsed"]
        [::std::mem::offset_of!(libraw_gps_info_t, gpsparsed) - 44usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_imgother_t {
    pub iso_speed: f32,
    pub shutter: f32,
    pub aperture: f32,
    pub focal_len: f32,
    pub timestamp: time_t,
    pub shot_order: ::std::os::raw::c_uint,
    pub gpsdata: [::std::os::raw::c_uint; 32usize],
    pub parsed_gps: libraw_gps_info_t,
    pub desc: [::std::os::raw::c_char; 512usize],
    pub artist: [::std::os::raw::c_char; 64usize],
    pub analogbalance: [f32; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_imgother_t"][::std::mem::size_of::<libraw_imgother_t>() - 800usize];
    ["Alignment of libraw_imgother_t"][::std::mem::align_of::<libraw_imgother_t>() - 8usize];
    ["Offset of field: libraw_imgother_t::iso_speed"]
        [::std::mem::offset_of!(libraw_imgother_t, iso_speed) - 0usize];
    ["Offset of field: libraw_imgother_t::shutter"]
        [::std::mem::offset_of!(libraw_imgother_t, shutter) - 4usize];
    ["Offset of field: libraw_imgother_t::aperture"]
        [::std::mem::offset_of!(libraw_imgother_t, aperture) - 8usize];
    ["Offset of field: libraw_imgother_t::focal_len"]
        [::std::mem::offset_of!(libraw_imgother_t, focal_len) - 12usize];
    ["Offset of field: libraw_imgother_t::timestamp"]
        [::std::mem::offset_of!(libraw_imgother_t, timestamp) - 16usize];
    ["Offset of field: libraw_imgother_t::shot_order"]
        [::std::mem::offset_of!(libraw_imgother_t, shot_order) - 24usize];
    ["Offset of field: libraw_imgother_t::gpsdata"]
        [::std::mem::offset_of!(libraw_imgother_t, gpsdata) - 28usize];
    ["Offset of field: libraw_imgother_t::parsed_gps"]
        [::std::mem::offset_of!(libraw_imgother_t, parsed_gps) - 156usize];
    ["Offset of field: libraw_imgother_t::desc"]
        [::std::mem::offset_of!(libraw_imgother_t, desc) - 204usize];
    ["Offset of field: libraw_imgother_t::artist"]
        [::std::mem::offset_of!(libraw_imgother_t, artist) - 716usize];
    ["Offset of field: libraw_imgother_t::analogbalance"]
        [::std::mem::offset_of!(libraw_imgother_t, analogbalance) - 780usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_afinfo_item_t {
    pub AFInfoData_tag: ::std::os::raw::c_uint,
    pub AFInfoData_order: ::std::os::raw::c_short,
    pub AFInfoData_version: ::std::os::raw::c_uint,
    pub AFInfoData_length: ::std::os::raw::c_uint,
    pub AFInfoData: *mut uchar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_afinfo_item_t"][::std::mem::size_of::<libraw_afinfo_item_t>() - 24usize];
    ["Alignment of libraw_afinfo_item_t"][::std::mem::align_of::<libraw_afinfo_item_t>() - 8usize];
    ["Offset of field: libraw_afinfo_item_t::AFInfoData_tag"]
        [::std::mem::offset_of!(libraw_afinfo_item_t, AFInfoData_tag) - 0usize];
    ["Offset of field: libraw_afinfo_item_t::AFInfoData_order"]
        [::std::mem::offset_of!(libraw_afinfo_item_t, AFInfoData_order) - 4usize];
    ["Offset of field: libraw_afinfo_item_t::AFInfoData_version"]
        [::std::mem::offset_of!(libraw_afinfo_item_t, AFInfoData_version) - 8usize];
    ["Offset of field: libraw_afinfo_item_t::AFInfoData_length"]
        [::std::mem::offset_of!(libraw_afinfo_item_t, AFInfoData_length) - 12usize];
    ["Offset of field: libraw_afinfo_item_t::AFInfoData"]
        [::std::mem::offset_of!(libraw_afinfo_item_t, AFInfoData) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_metadata_common_t {
    pub FlashEC: f32,
    pub FlashGN: f32,
    pub CameraTemperature: f32,
    pub SensorTemperature: f32,
    pub SensorTemperature2: f32,
    pub LensTemperature: f32,
    pub AmbientTemperature: f32,
    pub BatteryTemperature: f32,
    pub exifAmbientTemperature: f32,
    pub exifHumidity: f32,
    pub exifPressure: f32,
    pub exifWaterDepth: f32,
    pub exifAcceleration: f32,
    pub exifCameraElevationAngle: f32,
    pub real_ISO: f32,
    pub exifExposureIndex: f32,
    pub ColorSpace: ushort,
    pub firmware: [::std::os::raw::c_char; 128usize],
    pub ExposureCalibrationShift: f32,
    pub afdata: [libraw_afinfo_item_t; 4usize],
    pub afcount: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_metadata_common_t"]
        [::std::mem::size_of::<libraw_metadata_common_t>() - 304usize];
    ["Alignment of libraw_metadata_common_t"]
        [::std::mem::align_of::<libraw_metadata_common_t>() - 8usize];
    ["Offset of field: libraw_metadata_common_t::FlashEC"]
        [::std::mem::offset_of!(libraw_metadata_common_t, FlashEC) - 0usize];
    ["Offset of field: libraw_metadata_common_t::FlashGN"]
        [::std::mem::offset_of!(libraw_metadata_common_t, FlashGN) - 4usize];
    ["Offset of field: libraw_metadata_common_t::CameraTemperature"]
        [::std::mem::offset_of!(libraw_metadata_common_t, CameraTemperature) - 8usize];
    ["Offset of field: libraw_metadata_common_t::SensorTemperature"]
        [::std::mem::offset_of!(libraw_metadata_common_t, SensorTemperature) - 12usize];
    ["Offset of field: libraw_metadata_common_t::SensorTemperature2"]
        [::std::mem::offset_of!(libraw_metadata_common_t, SensorTemperature2) - 16usize];
    ["Offset of field: libraw_metadata_common_t::LensTemperature"]
        [::std::mem::offset_of!(libraw_metadata_common_t, LensTemperature) - 20usize];
    ["Offset of field: libraw_metadata_common_t::AmbientTemperature"]
        [::std::mem::offset_of!(libraw_metadata_common_t, AmbientTemperature) - 24usize];
    ["Offset of field: libraw_metadata_common_t::BatteryTemperature"]
        [::std::mem::offset_of!(libraw_metadata_common_t, BatteryTemperature) - 28usize];
    ["Offset of field: libraw_metadata_common_t::exifAmbientTemperature"]
        [::std::mem::offset_of!(libraw_metadata_common_t, exifAmbientTemperature) - 32usize];
    ["Offset of field: libraw_metadata_common_t::exifHumidity"]
        [::std::mem::offset_of!(libraw_metadata_common_t, exifHumidity) - 36usize];
    ["Offset of field: libraw_metadata_common_t::exifPressure"]
        [::std::mem::offset_of!(libraw_metadata_common_t, exifPressure) - 40usize];
    ["Offset of field: libraw_metadata_common_t::exifWaterDepth"]
        [::std::mem::offset_of!(libraw_metadata_common_t, exifWaterDepth) - 44usize];
    ["Offset of field: libraw_metadata_common_t::exifAcceleration"]
        [::std::mem::offset_of!(libraw_metadata_common_t, exifAcceleration) - 48usize];
    ["Offset of field: libraw_metadata_common_t::exifCameraElevationAngle"]
        [::std::mem::offset_of!(libraw_metadata_common_t, exifCameraElevationAngle) - 52usize];
    ["Offset of field: libraw_metadata_common_t::real_ISO"]
        [::std::mem::offset_of!(libraw_metadata_common_t, real_ISO) - 56usize];
    ["Offset of field: libraw_metadata_common_t::exifExposureIndex"]
        [::std::mem::offset_of!(libraw_metadata_common_t, exifExposureIndex) - 60usize];
    ["Offset of field: libraw_metadata_common_t::ColorSpace"]
        [::std::mem::offset_of!(libraw_metadata_common_t, ColorSpace) - 64usize];
    ["Offset of field: libraw_metadata_common_t::firmware"]
        [::std::mem::offset_of!(libraw_metadata_common_t, firmware) - 66usize];
    ["Offset of field: libraw_metadata_common_t::ExposureCalibrationShift"]
        [::std::mem::offset_of!(libraw_metadata_common_t, ExposureCalibrationShift) - 196usize];
    ["Offset of field: libraw_metadata_common_t::afdata"]
        [::std::mem::offset_of!(libraw_metadata_common_t, afdata) - 200usize];
    ["Offset of field: libraw_metadata_common_t::afcount"]
        [::std::mem::offset_of!(libraw_metadata_common_t, afcount) - 296usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_output_params_t {
    pub greybox: [::std::os::raw::c_uint; 4usize],
    pub cropbox: [::std::os::raw::c_uint; 4usize],
    pub aber: [f64; 4usize],
    pub gamm: [f64; 6usize],
    pub user_mul: [f32; 4usize],
    pub bright: f32,
    pub threshold: f32,
    pub half_size: ::std::os::raw::c_int,
    pub four_color_rgb: ::std::os::raw::c_int,
    pub highlight: ::std::os::raw::c_int,
    pub use_auto_wb: ::std::os::raw::c_int,
    pub use_camera_wb: ::std::os::raw::c_int,
    pub use_camera_matrix: ::std::os::raw::c_int,
    pub output_color: ::std::os::raw::c_int,
    pub output_profile: *mut ::std::os::raw::c_char,
    pub camera_profile: *mut ::std::os::raw::c_char,
    pub bad_pixels: *mut ::std::os::raw::c_char,
    pub dark_frame: *mut ::std::os::raw::c_char,
    pub output_bps: ::std::os::raw::c_int,
    pub output_tiff: ::std::os::raw::c_int,
    pub output_flags: ::std::os::raw::c_int,
    pub user_flip: ::std::os::raw::c_int,
    pub user_qual: ::std::os::raw::c_int,
    pub user_black: ::std::os::raw::c_int,
    pub user_cblack: [::std::os::raw::c_int; 4usize],
    pub user_sat: ::std::os::raw::c_int,
    pub med_passes: ::std::os::raw::c_int,
    pub auto_bright_thr: f32,
    pub adjust_maximum_thr: f32,
    pub no_auto_bright: ::std::os::raw::c_int,
    pub use_fuji_rotate: ::std::os::raw::c_int,
    pub use_p1_correction: ::std::os::raw::c_int,
    pub green_matching: ::std::os::raw::c_int,
    pub dcb_iterations: ::std::os::raw::c_int,
    pub dcb_enhance_fl: ::std::os::raw::c_int,
    pub fbdd_noiserd: ::std::os::raw::c_int,
    pub exp_correc: ::std::os::raw::c_int,
    pub exp_shift: f32,
    pub exp_preser: f32,
    pub no_auto_scale: ::std::os::raw::c_int,
    pub no_interpolation: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_output_params_t"][::std::mem::size_of::<libraw_output_params_t>() - 304usize];
    ["Alignment of libraw_output_params_t"]
        [::std::mem::align_of::<libraw_output_params_t>() - 8usize];
    ["Offset of field: libraw_output_params_t::greybox"]
        [::std::mem::offset_of!(libraw_output_params_t, greybox) - 0usize];
    ["Offset of field: libraw_output_params_t::cropbox"]
        [::std::mem::offset_of!(libraw_output_params_t, cropbox) - 16usize];
    ["Offset of field: libraw_output_params_t::aber"]
        [::std::mem::offset_of!(libraw_output_params_t, aber) - 32usize];
    ["Offset of field: libraw_output_params_t::gamm"]
        [::std::mem::offset_of!(libraw_output_params_t, gamm) - 64usize];
    ["Offset of field: libraw_output_params_t::user_mul"]
        [::std::mem::offset_of!(libraw_output_params_t, user_mul) - 112usize];
    ["Offset of field: libraw_output_params_t::bright"]
        [::std::mem::offset_of!(libraw_output_params_t, bright) - 128usize];
    ["Offset of field: libraw_output_params_t::threshold"]
        [::std::mem::offset_of!(libraw_output_params_t, threshold) - 132usize];
    ["Offset of field: libraw_output_params_t::half_size"]
        [::std::mem::offset_of!(libraw_output_params_t, half_size) - 136usize];
    ["Offset of field: libraw_output_params_t::four_color_rgb"]
        [::std::mem::offset_of!(libraw_output_params_t, four_color_rgb) - 140usize];
    ["Offset of field: libraw_output_params_t::highlight"]
        [::std::mem::offset_of!(libraw_output_params_t, highlight) - 144usize];
    ["Offset of field: libraw_output_params_t::use_auto_wb"]
        [::std::mem::offset_of!(libraw_output_params_t, use_auto_wb) - 148usize];
    ["Offset of field: libraw_output_params_t::use_camera_wb"]
        [::std::mem::offset_of!(libraw_output_params_t, use_camera_wb) - 152usize];
    ["Offset of field: libraw_output_params_t::use_camera_matrix"]
        [::std::mem::offset_of!(libraw_output_params_t, use_camera_matrix) - 156usize];
    ["Offset of field: libraw_output_params_t::output_color"]
        [::std::mem::offset_of!(libraw_output_params_t, output_color) - 160usize];
    ["Offset of field: libraw_output_params_t::output_profile"]
        [::std::mem::offset_of!(libraw_output_params_t, output_profile) - 168usize];
    ["Offset of field: libraw_output_params_t::camera_profile"]
        [::std::mem::offset_of!(libraw_output_params_t, camera_profile) - 176usize];
    ["Offset of field: libraw_output_params_t::bad_pixels"]
        [::std::mem::offset_of!(libraw_output_params_t, bad_pixels) - 184usize];
    ["Offset of field: libraw_output_params_t::dark_frame"]
        [::std::mem::offset_of!(libraw_output_params_t, dark_frame) - 192usize];
    ["Offset of field: libraw_output_params_t::output_bps"]
        [::std::mem::offset_of!(libraw_output_params_t, output_bps) - 200usize];
    ["Offset of field: libraw_output_params_t::output_tiff"]
        [::std::mem::offset_of!(libraw_output_params_t, output_tiff) - 204usize];
    ["Offset of field: libraw_output_params_t::output_flags"]
        [::std::mem::offset_of!(libraw_output_params_t, output_flags) - 208usize];
    ["Offset of field: libraw_output_params_t::user_flip"]
        [::std::mem::offset_of!(libraw_output_params_t, user_flip) - 212usize];
    ["Offset of field: libraw_output_params_t::user_qual"]
        [::std::mem::offset_of!(libraw_output_params_t, user_qual) - 216usize];
    ["Offset of field: libraw_output_params_t::user_black"]
        [::std::mem::offset_of!(libraw_output_params_t, user_black) - 220usize];
    ["Offset of field: libraw_output_params_t::user_cblack"]
        [::std::mem::offset_of!(libraw_output_params_t, user_cblack) - 224usize];
    ["Offset of field: libraw_output_params_t::user_sat"]
        [::std::mem::offset_of!(libraw_output_params_t, user_sat) - 240usize];
    ["Offset of field: libraw_output_params_t::med_passes"]
        [::std::mem::offset_of!(libraw_output_params_t, med_passes) - 244usize];
    ["Offset of field: libraw_output_params_t::auto_bright_thr"]
        [::std::mem::offset_of!(libraw_output_params_t, auto_bright_thr) - 248usize];
    ["Offset of field: libraw_output_params_t::adjust_maximum_thr"]
        [::std::mem::offset_of!(libraw_output_params_t, adjust_maximum_thr) - 252usize];
    ["Offset of field: libraw_output_params_t::no_auto_bright"]
        [::std::mem::offset_of!(libraw_output_params_t, no_auto_bright) - 256usize];
    ["Offset of field: libraw_output_params_t::use_fuji_rotate"]
        [::std::mem::offset_of!(libraw_output_params_t, use_fuji_rotate) - 260usize];
    ["Offset of field: libraw_output_params_t::use_p1_correction"]
        [::std::mem::offset_of!(libraw_output_params_t, use_p1_correction) - 264usize];
    ["Offset of field: libraw_output_params_t::green_matching"]
        [::std::mem::offset_of!(libraw_output_params_t, green_matching) - 268usize];
    ["Offset of field: libraw_output_params_t::dcb_iterations"]
        [::std::mem::offset_of!(libraw_output_params_t, dcb_iterations) - 272usize];
    ["Offset of field: libraw_output_params_t::dcb_enhance_fl"]
        [::std::mem::offset_of!(libraw_output_params_t, dcb_enhance_fl) - 276usize];
    ["Offset of field: libraw_output_params_t::fbdd_noiserd"]
        [::std::mem::offset_of!(libraw_output_params_t, fbdd_noiserd) - 280usize];
    ["Offset of field: libraw_output_params_t::exp_correc"]
        [::std::mem::offset_of!(libraw_output_params_t, exp_correc) - 284usize];
    ["Offset of field: libraw_output_params_t::exp_shift"]
        [::std::mem::offset_of!(libraw_output_params_t, exp_shift) - 288usize];
    ["Offset of field: libraw_output_params_t::exp_preser"]
        [::std::mem::offset_of!(libraw_output_params_t, exp_preser) - 292usize];
    ["Offset of field: libraw_output_params_t::no_auto_scale"]
        [::std::mem::offset_of!(libraw_output_params_t, no_auto_scale) - 296usize];
    ["Offset of field: libraw_output_params_t::no_interpolation"]
        [::std::mem::offset_of!(libraw_output_params_t, no_interpolation) - 300usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_raw_unpack_params_t {
    pub use_rawspeed: ::std::os::raw::c_int,
    pub use_dngsdk: ::std::os::raw::c_int,
    pub options: ::std::os::raw::c_uint,
    pub shot_select: ::std::os::raw::c_uint,
    pub specials: ::std::os::raw::c_uint,
    pub max_raw_memory_mb: ::std::os::raw::c_uint,
    pub sony_arw2_posterization_thr: ::std::os::raw::c_int,
    pub coolscan_nef_gamma: f32,
    pub p4shot_order: [::std::os::raw::c_char; 5usize],
    pub custom_camera_strings: *mut *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_raw_unpack_params_t"]
        [::std::mem::size_of::<libraw_raw_unpack_params_t>() - 48usize];
    ["Alignment of libraw_raw_unpack_params_t"]
        [::std::mem::align_of::<libraw_raw_unpack_params_t>() - 8usize];
    ["Offset of field: libraw_raw_unpack_params_t::use_rawspeed"]
        [::std::mem::offset_of!(libraw_raw_unpack_params_t, use_rawspeed) - 0usize];
    ["Offset of field: libraw_raw_unpack_params_t::use_dngsdk"]
        [::std::mem::offset_of!(libraw_raw_unpack_params_t, use_dngsdk) - 4usize];
    ["Offset of field: libraw_raw_unpack_params_t::options"]
        [::std::mem::offset_of!(libraw_raw_unpack_params_t, options) - 8usize];
    ["Offset of field: libraw_raw_unpack_params_t::shot_select"]
        [::std::mem::offset_of!(libraw_raw_unpack_params_t, shot_select) - 12usize];
    ["Offset of field: libraw_raw_unpack_params_t::specials"]
        [::std::mem::offset_of!(libraw_raw_unpack_params_t, specials) - 16usize];
    ["Offset of field: libraw_raw_unpack_params_t::max_raw_memory_mb"]
        [::std::mem::offset_of!(libraw_raw_unpack_params_t, max_raw_memory_mb) - 20usize];
    ["Offset of field: libraw_raw_unpack_params_t::sony_arw2_posterization_thr"]
        [::std::mem::offset_of!(libraw_raw_unpack_params_t, sony_arw2_posterization_thr) - 24usize];
    ["Offset of field: libraw_raw_unpack_params_t::coolscan_nef_gamma"]
        [::std::mem::offset_of!(libraw_raw_unpack_params_t, coolscan_nef_gamma) - 28usize];
    ["Offset of field: libraw_raw_unpack_params_t::p4shot_order"]
        [::std::mem::offset_of!(libraw_raw_unpack_params_t, p4shot_order) - 32usize];
    ["Offset of field: libraw_raw_unpack_params_t::custom_camera_strings"]
        [::std::mem::offset_of!(libraw_raw_unpack_params_t, custom_camera_strings) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_rawdata_t {
    pub raw_alloc: *mut ::std::os::raw::c_void,
    pub raw_image: *mut ushort,
    pub color4_image: *mut [ushort; 4usize],
    pub color3_image: *mut [ushort; 3usize],
    pub float_image: *mut f32,
    pub float3_image: *mut [f32; 3usize],
    pub float4_image: *mut [f32; 4usize],
    pub ph1_cblack: *mut [::std::os::raw::c_short; 2usize],
    pub ph1_rblack: *mut [::std::os::raw::c_short; 2usize],
    pub iparams: libraw_iparams_t,
    pub sizes: libraw_image_sizes_t,
    pub ioparams: libraw_internal_output_params_t,
    pub color: libraw_colordata_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_rawdata_t"][::std::mem::size_of::<libraw_rawdata_t>() - 187760usize];
    ["Alignment of libraw_rawdata_t"][::std::mem::align_of::<libraw_rawdata_t>() - 8usize];
    ["Offset of field: libraw_rawdata_t::raw_alloc"]
        [::std::mem::offset_of!(libraw_rawdata_t, raw_alloc) - 0usize];
    ["Offset of field: libraw_rawdata_t::raw_image"]
        [::std::mem::offset_of!(libraw_rawdata_t, raw_image) - 8usize];
    ["Offset of field: libraw_rawdata_t::color4_image"]
        [::std::mem::offset_of!(libraw_rawdata_t, color4_image) - 16usize];
    ["Offset of field: libraw_rawdata_t::color3_image"]
        [::std::mem::offset_of!(libraw_rawdata_t, color3_image) - 24usize];
    ["Offset of field: libraw_rawdata_t::float_image"]
        [::std::mem::offset_of!(libraw_rawdata_t, float_image) - 32usize];
    ["Offset of field: libraw_rawdata_t::float3_image"]
        [::std::mem::offset_of!(libraw_rawdata_t, float3_image) - 40usize];
    ["Offset of field: libraw_rawdata_t::float4_image"]
        [::std::mem::offset_of!(libraw_rawdata_t, float4_image) - 48usize];
    ["Offset of field: libraw_rawdata_t::ph1_cblack"]
        [::std::mem::offset_of!(libraw_rawdata_t, ph1_cblack) - 56usize];
    ["Offset of field: libraw_rawdata_t::ph1_rblack"]
        [::std::mem::offset_of!(libraw_rawdata_t, ph1_rblack) - 64usize];
    ["Offset of field: libraw_rawdata_t::iparams"]
        [::std::mem::offset_of!(libraw_rawdata_t, iparams) - 72usize];
    ["Offset of field: libraw_rawdata_t::sizes"]
        [::std::mem::offset_of!(libraw_rawdata_t, sizes) - 512usize];
    ["Offset of field: libraw_rawdata_t::ioparams"]
        [::std::mem::offset_of!(libraw_rawdata_t, ioparams) - 696usize];
    ["Offset of field: libraw_rawdata_t::color"]
        [::std::mem::offset_of!(libraw_rawdata_t, color) - 712usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_makernotes_lens_t {
    pub LensID: ::std::os::raw::c_ulonglong,
    pub Lens: [::std::os::raw::c_char; 128usize],
    pub LensFormat: ushort,
    pub LensMount: ushort,
    pub CamID: ::std::os::raw::c_ulonglong,
    pub CameraFormat: ushort,
    pub CameraMount: ushort,
    pub body: [::std::os::raw::c_char; 64usize],
    pub FocalType: ::std::os::raw::c_short,
    pub LensFeatures_pre: [::std::os::raw::c_char; 16usize],
    pub LensFeatures_suf: [::std::os::raw::c_char; 16usize],
    pub MinFocal: f32,
    pub MaxFocal: f32,
    pub MaxAp4MinFocal: f32,
    pub MaxAp4MaxFocal: f32,
    pub MinAp4MinFocal: f32,
    pub MinAp4MaxFocal: f32,
    pub MaxAp: f32,
    pub MinAp: f32,
    pub CurFocal: f32,
    pub CurAp: f32,
    pub MaxAp4CurFocal: f32,
    pub MinAp4CurFocal: f32,
    pub MinFocusDistance: f32,
    pub FocusRangeIndex: f32,
    pub LensFStops: f32,
    pub TeleconverterID: ::std::os::raw::c_ulonglong,
    pub Teleconverter: [::std::os::raw::c_char; 128usize],
    pub AdapterID: ::std::os::raw::c_ulonglong,
    pub Adapter: [::std::os::raw::c_char; 128usize],
    pub AttachmentID: ::std::os::raw::c_ulonglong,
    pub Attachment: [::std::os::raw::c_char; 128usize],
    pub FocalUnits: ushort,
    pub FocalLengthIn35mmFormat: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_makernotes_lens_t"]
        [::std::mem::size_of::<libraw_makernotes_lens_t>() - 736usize];
    ["Alignment of libraw_makernotes_lens_t"]
        [::std::mem::align_of::<libraw_makernotes_lens_t>() - 8usize];
    ["Offset of field: libraw_makernotes_lens_t::LensID"]
        [::std::mem::offset_of!(libraw_makernotes_lens_t, LensID) - 0usize];
    ["Offset of field: libraw_makernotes_lens_t::Lens"]
        [::std::mem::offset_of!(libraw_makernotes_lens_t, Lens) - 8usize];
    ["Offset of field: libraw_makernotes_lens_t::LensFormat"]
        [::std::mem::offset_of!(libraw_makernotes_lens_t, LensFormat) - 136usize];
    ["Offset of field: libraw_makernotes_lens_t::LensMount"]
        [::std::mem::offset_of!(libraw_makernotes_lens_t, LensMount) - 138usize];
    ["Offset of field: libraw_makernotes_lens_t::CamID"]
        [::std::mem::offset_of!(libraw_makernotes_lens_t, CamID) - 144usize];
    ["Offset of field: libraw_makernotes_lens_t::CameraFormat"]
        [::std::mem::offset_of!(libraw_makernotes_lens_t, CameraFormat) - 152usize];
    ["Offset of field: libraw_makernotes_lens_t::CameraMount"]
        [::std::mem::offset_of!(libraw_makernotes_lens_t, CameraMount) - 154usize];
    ["Offset of field: libraw_makernotes_lens_t::body"]
        [::std::mem::offset_of!(libraw_makernotes_lens_t, body) - 156usize];
    ["Offset of field: libraw_makernotes_lens_t::FocalType"]
        [::std::mem::offset_of!(libraw_makernotes_lens_t, FocalType) - 220usize];
    ["Offset of field: libraw_makernotes_lens_t::LensFeatures_pre"]
        [::std::mem::offset_of!(libraw_makernotes_lens_t, LensFeatures_pre) - 222usize];
    ["Offset of field: libraw_makernotes_lens_t::LensFeatures_suf"]
        [::std::mem::offset_of!(libraw_makernotes_lens_t, LensFeatures_suf) - 238usize];
    ["Offset of field: libraw_makernotes_lens_t::MinFocal"]
        [::std::mem::offset_of!(libraw_makernotes_lens_t, MinFocal) - 256usize];
    ["Offset of field: libraw_makernotes_lens_t::MaxFocal"]
        [::std::mem::offset_of!(libraw_makernotes_lens_t, MaxFocal) - 260usize];
    ["Offset of field: libraw_makernotes_lens_t::MaxAp4MinFocal"]
        [::std::mem::offset_of!(libraw_makernotes_lens_t, MaxAp4MinFocal) - 264usize];
    ["Offset of field: libraw_makernotes_lens_t::MaxAp4MaxFocal"]
        [::std::mem::offset_of!(libraw_makernotes_lens_t, MaxAp4MaxFocal) - 268usize];
    ["Offset of field: libraw_makernotes_lens_t::MinAp4MinFocal"]
        [::std::mem::offset_of!(libraw_makernotes_lens_t, MinAp4MinFocal) - 272usize];
    ["Offset of field: libraw_makernotes_lens_t::MinAp4MaxFocal"]
        [::std::mem::offset_of!(libraw_makernotes_lens_t, MinAp4MaxFocal) - 276usize];
    ["Offset of field: libraw_makernotes_lens_t::MaxAp"]
        [::std::mem::offset_of!(libraw_makernotes_lens_t, MaxAp) - 280usize];
    ["Offset of field: libraw_makernotes_lens_t::MinAp"]
        [::std::mem::offset_of!(libraw_makernotes_lens_t, MinAp) - 284usize];
    ["Offset of field: libraw_makernotes_lens_t::CurFocal"]
        [::std::mem::offset_of!(libraw_makernotes_lens_t, CurFocal) - 288usize];
    ["Offset of field: libraw_makernotes_lens_t::CurAp"]
        [::std::mem::offset_of!(libraw_makernotes_lens_t, CurAp) - 292usize];
    ["Offset of field: libraw_makernotes_lens_t::MaxAp4CurFocal"]
        [::std::mem::offset_of!(libraw_makernotes_lens_t, MaxAp4CurFocal) - 296usize];
    ["Offset of field: libraw_makernotes_lens_t::MinAp4CurFocal"]
        [::std::mem::offset_of!(libraw_makernotes_lens_t, MinAp4CurFocal) - 300usize];
    ["Offset of field: libraw_makernotes_lens_t::MinFocusDistance"]
        [::std::mem::offset_of!(libraw_makernotes_lens_t, MinFocusDistance) - 304usize];
    ["Offset of field: libraw_makernotes_lens_t::FocusRangeIndex"]
        [::std::mem::offset_of!(libraw_makernotes_lens_t, FocusRangeIndex) - 308usize];
    ["Offset of field: libraw_makernotes_lens_t::LensFStops"]
        [::std::mem::offset_of!(libraw_makernotes_lens_t, LensFStops) - 312usize];
    ["Offset of field: libraw_makernotes_lens_t::TeleconverterID"]
        [::std::mem::offset_of!(libraw_makernotes_lens_t, TeleconverterID) - 320usize];
    ["Offset of field: libraw_makernotes_lens_t::Teleconverter"]
        [::std::mem::offset_of!(libraw_makernotes_lens_t, Teleconverter) - 328usize];
    ["Offset of field: libraw_makernotes_lens_t::AdapterID"]
        [::std::mem::offset_of!(libraw_makernotes_lens_t, AdapterID) - 456usize];
    ["Offset of field: libraw_makernotes_lens_t::Adapter"]
        [::std::mem::offset_of!(libraw_makernotes_lens_t, Adapter) - 464usize];
    ["Offset of field: libraw_makernotes_lens_t::AttachmentID"]
        [::std::mem::offset_of!(libraw_makernotes_lens_t, AttachmentID) - 592usize];
    ["Offset of field: libraw_makernotes_lens_t::Attachment"]
        [::std::mem::offset_of!(libraw_makernotes_lens_t, Attachment) - 600usize];
    ["Offset of field: libraw_makernotes_lens_t::FocalUnits"]
        [::std::mem::offset_of!(libraw_makernotes_lens_t, FocalUnits) - 728usize];
    ["Offset of field: libraw_makernotes_lens_t::FocalLengthIn35mmFormat"]
        [::std::mem::offset_of!(libraw_makernotes_lens_t, FocalLengthIn35mmFormat) - 732usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_nikonlens_t {
    pub EffectiveMaxAp: f32,
    pub LensIDNumber: uchar,
    pub LensFStops: uchar,
    pub MCUVersion: uchar,
    pub LensType: uchar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_nikonlens_t"][::std::mem::size_of::<libraw_nikonlens_t>() - 8usize];
    ["Alignment of libraw_nikonlens_t"][::std::mem::align_of::<libraw_nikonlens_t>() - 4usize];
    ["Offset of field: libraw_nikonlens_t::EffectiveMaxAp"]
        [::std::mem::offset_of!(libraw_nikonlens_t, EffectiveMaxAp) - 0usize];
    ["Offset of field: libraw_nikonlens_t::LensIDNumber"]
        [::std::mem::offset_of!(libraw_nikonlens_t, LensIDNumber) - 4usize];
    ["Offset of field: libraw_nikonlens_t::LensFStops"]
        [::std::mem::offset_of!(libraw_nikonlens_t, LensFStops) - 5usize];
    ["Offset of field: libraw_nikonlens_t::MCUVersion"]
        [::std::mem::offset_of!(libraw_nikonlens_t, MCUVersion) - 6usize];
    ["Offset of field: libraw_nikonlens_t::LensType"]
        [::std::mem::offset_of!(libraw_nikonlens_t, LensType) - 7usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_dnglens_t {
    pub MinFocal: f32,
    pub MaxFocal: f32,
    pub MaxAp4MinFocal: f32,
    pub MaxAp4MaxFocal: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_dnglens_t"][::std::mem::size_of::<libraw_dnglens_t>() - 16usize];
    ["Alignment of libraw_dnglens_t"][::std::mem::align_of::<libraw_dnglens_t>() - 4usize];
    ["Offset of field: libraw_dnglens_t::MinFocal"]
        [::std::mem::offset_of!(libraw_dnglens_t, MinFocal) - 0usize];
    ["Offset of field: libraw_dnglens_t::MaxFocal"]
        [::std::mem::offset_of!(libraw_dnglens_t, MaxFocal) - 4usize];
    ["Offset of field: libraw_dnglens_t::MaxAp4MinFocal"]
        [::std::mem::offset_of!(libraw_dnglens_t, MaxAp4MinFocal) - 8usize];
    ["Offset of field: libraw_dnglens_t::MaxAp4MaxFocal"]
        [::std::mem::offset_of!(libraw_dnglens_t, MaxAp4MaxFocal) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_lensinfo_t {
    pub MinFocal: f32,
    pub MaxFocal: f32,
    pub MaxAp4MinFocal: f32,
    pub MaxAp4MaxFocal: f32,
    pub EXIF_MaxAp: f32,
    pub LensMake: [::std::os::raw::c_char; 128usize],
    pub Lens: [::std::os::raw::c_char; 128usize],
    pub LensSerial: [::std::os::raw::c_char; 128usize],
    pub InternalLensSerial: [::std::os::raw::c_char; 128usize],
    pub FocalLengthIn35mmFormat: ushort,
    pub nikon: libraw_nikonlens_t,
    pub dng: libraw_dnglens_t,
    pub makernotes: libraw_makernotes_lens_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_lensinfo_t"][::std::mem::size_of::<libraw_lensinfo_t>() - 1296usize];
    ["Alignment of libraw_lensinfo_t"][::std::mem::align_of::<libraw_lensinfo_t>() - 8usize];
    ["Offset of field: libraw_lensinfo_t::MinFocal"]
        [::std::mem::offset_of!(libraw_lensinfo_t, MinFocal) - 0usize];
    ["Offset of field: libraw_lensinfo_t::MaxFocal"]
        [::std::mem::offset_of!(libraw_lensinfo_t, MaxFocal) - 4usize];
    ["Offset of field: libraw_lensinfo_t::MaxAp4MinFocal"]
        [::std::mem::offset_of!(libraw_lensinfo_t, MaxAp4MinFocal) - 8usize];
    ["Offset of field: libraw_lensinfo_t::MaxAp4MaxFocal"]
        [::std::mem::offset_of!(libraw_lensinfo_t, MaxAp4MaxFocal) - 12usize];
    ["Offset of field: libraw_lensinfo_t::EXIF_MaxAp"]
        [::std::mem::offset_of!(libraw_lensinfo_t, EXIF_MaxAp) - 16usize];
    ["Offset of field: libraw_lensinfo_t::LensMake"]
        [::std::mem::offset_of!(libraw_lensinfo_t, LensMake) - 20usize];
    ["Offset of field: libraw_lensinfo_t::Lens"]
        [::std::mem::offset_of!(libraw_lensinfo_t, Lens) - 148usize];
    ["Offset of field: libraw_lensinfo_t::LensSerial"]
        [::std::mem::offset_of!(libraw_lensinfo_t, LensSerial) - 276usize];
    ["Offset of field: libraw_lensinfo_t::InternalLensSerial"]
        [::std::mem::offset_of!(libraw_lensinfo_t, InternalLensSerial) - 404usize];
    ["Offset of field: libraw_lensinfo_t::FocalLengthIn35mmFormat"]
        [::std::mem::offset_of!(libraw_lensinfo_t, FocalLengthIn35mmFormat) - 532usize];
    ["Offset of field: libraw_lensinfo_t::nikon"]
        [::std::mem::offset_of!(libraw_lensinfo_t, nikon) - 536usize];
    ["Offset of field: libraw_lensinfo_t::dng"]
        [::std::mem::offset_of!(libraw_lensinfo_t, dng) - 544usize];
    ["Offset of field: libraw_lensinfo_t::makernotes"]
        [::std::mem::offset_of!(libraw_lensinfo_t, makernotes) - 560usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_makernotes_t {
    pub canon: libraw_canon_makernotes_t,
    pub nikon: libraw_nikon_makernotes_t,
    pub hasselblad: libraw_hasselblad_makernotes_t,
    pub fuji: libraw_fuji_info_t,
    pub olympus: libraw_olympus_makernotes_t,
    pub sony: libraw_sony_info_t,
    pub kodak: libraw_kodak_makernotes_t,
    pub panasonic: libraw_panasonic_makernotes_t,
    pub pentax: libraw_pentax_makernotes_t,
    pub phaseone: libraw_p1_makernotes_t,
    pub ricoh: libraw_ricoh_makernotes_t,
    pub samsung: libraw_samsung_makernotes_t,
    pub common: libraw_metadata_common_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_makernotes_t"][::std::mem::size_of::<libraw_makernotes_t>() - 3064usize];
    ["Alignment of libraw_makernotes_t"][::std::mem::align_of::<libraw_makernotes_t>() - 8usize];
    ["Offset of field: libraw_makernotes_t::canon"]
        [::std::mem::offset_of!(libraw_makernotes_t, canon) - 0usize];
    ["Offset of field: libraw_makernotes_t::nikon"]
        [::std::mem::offset_of!(libraw_makernotes_t, nikon) - 168usize];
    ["Offset of field: libraw_makernotes_t::hasselblad"]
        [::std::mem::offset_of!(libraw_makernotes_t, hasselblad) - 432usize];
    ["Offset of field: libraw_makernotes_t::fuji"]
        [::std::mem::offset_of!(libraw_makernotes_t, fuji) - 816usize];
    ["Offset of field: libraw_makernotes_t::olympus"]
        [::std::mem::offset_of!(libraw_makernotes_t, olympus) - 1168usize];
    ["Offset of field: libraw_makernotes_t::sony"]
        [::std::mem::offset_of!(libraw_makernotes_t, sony) - 1576usize];
    ["Offset of field: libraw_makernotes_t::kodak"]
        [::std::mem::offset_of!(libraw_makernotes_t, kodak) - 1760usize];
    ["Offset of field: libraw_makernotes_t::panasonic"]
        [::std::mem::offset_of!(libraw_makernotes_t, panasonic) - 2004usize];
    ["Offset of field: libraw_makernotes_t::pentax"]
        [::std::mem::offset_of!(libraw_makernotes_t, pentax) - 2072usize];
    ["Offset of field: libraw_makernotes_t::phaseone"]
        [::std::mem::offset_of!(libraw_makernotes_t, phaseone) - 2104usize];
    ["Offset of field: libraw_makernotes_t::ricoh"]
        [::std::mem::offset_of!(libraw_makernotes_t, ricoh) - 2552usize];
    ["Offset of field: libraw_makernotes_t::samsung"]
        [::std::mem::offset_of!(libraw_makernotes_t, samsung) - 2624usize];
    ["Offset of field: libraw_makernotes_t::common"]
        [::std::mem::offset_of!(libraw_makernotes_t, common) - 2760usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_shootinginfo_t {
    pub DriveMode: ::std::os::raw::c_short,
    pub FocusMode: ::std::os::raw::c_short,
    pub MeteringMode: ::std::os::raw::c_short,
    pub AFPoint: ::std::os::raw::c_short,
    pub ExposureMode: ::std::os::raw::c_short,
    pub ExposureProgram: ::std::os::raw::c_short,
    pub ImageStabilization: ::std::os::raw::c_short,
    pub BodySerial: [::std::os::raw::c_char; 64usize],
    pub InternalBodySerial: [::std::os::raw::c_char; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_shootinginfo_t"][::std::mem::size_of::<libraw_shootinginfo_t>() - 142usize];
    ["Alignment of libraw_shootinginfo_t"]
        [::std::mem::align_of::<libraw_shootinginfo_t>() - 2usize];
    ["Offset of field: libraw_shootinginfo_t::DriveMode"]
        [::std::mem::offset_of!(libraw_shootinginfo_t, DriveMode) - 0usize];
    ["Offset of field: libraw_shootinginfo_t::FocusMode"]
        [::std::mem::offset_of!(libraw_shootinginfo_t, FocusMode) - 2usize];
    ["Offset of field: libraw_shootinginfo_t::MeteringMode"]
        [::std::mem::offset_of!(libraw_shootinginfo_t, MeteringMode) - 4usize];
    ["Offset of field: libraw_shootinginfo_t::AFPoint"]
        [::std::mem::offset_of!(libraw_shootinginfo_t, AFPoint) - 6usize];
    ["Offset of field: libraw_shootinginfo_t::ExposureMode"]
        [::std::mem::offset_of!(libraw_shootinginfo_t, ExposureMode) - 8usize];
    ["Offset of field: libraw_shootinginfo_t::ExposureProgram"]
        [::std::mem::offset_of!(libraw_shootinginfo_t, ExposureProgram) - 10usize];
    ["Offset of field: libraw_shootinginfo_t::ImageStabilization"]
        [::std::mem::offset_of!(libraw_shootinginfo_t, ImageStabilization) - 12usize];
    ["Offset of field: libraw_shootinginfo_t::BodySerial"]
        [::std::mem::offset_of!(libraw_shootinginfo_t, BodySerial) - 14usize];
    ["Offset of field: libraw_shootinginfo_t::InternalBodySerial"]
        [::std::mem::offset_of!(libraw_shootinginfo_t, InternalBodySerial) - 78usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_custom_camera_t {
    pub fsize: ::std::os::raw::c_uint,
    pub rw: ushort,
    pub rh: ushort,
    pub lm: uchar,
    pub tm: uchar,
    pub rm: uchar,
    pub bm: uchar,
    pub lf: ushort,
    pub cf: uchar,
    pub max: uchar,
    pub flags: uchar,
    pub t_make: [::std::os::raw::c_char; 10usize],
    pub t_model: [::std::os::raw::c_char; 20usize],
    pub offset: ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_custom_camera_t"][::std::mem::size_of::<libraw_custom_camera_t>() - 52usize];
    ["Alignment of libraw_custom_camera_t"]
        [::std::mem::align_of::<libraw_custom_camera_t>() - 4usize];
    ["Offset of field: libraw_custom_camera_t::fsize"]
        [::std::mem::offset_of!(libraw_custom_camera_t, fsize) - 0usize];
    ["Offset of field: libraw_custom_camera_t::rw"]
        [::std::mem::offset_of!(libraw_custom_camera_t, rw) - 4usize];
    ["Offset of field: libraw_custom_camera_t::rh"]
        [::std::mem::offset_of!(libraw_custom_camera_t, rh) - 6usize];
    ["Offset of field: libraw_custom_camera_t::lm"]
        [::std::mem::offset_of!(libraw_custom_camera_t, lm) - 8usize];
    ["Offset of field: libraw_custom_camera_t::tm"]
        [::std::mem::offset_of!(libraw_custom_camera_t, tm) - 9usize];
    ["Offset of field: libraw_custom_camera_t::rm"]
        [::std::mem::offset_of!(libraw_custom_camera_t, rm) - 10usize];
    ["Offset of field: libraw_custom_camera_t::bm"]
        [::std::mem::offset_of!(libraw_custom_camera_t, bm) - 11usize];
    ["Offset of field: libraw_custom_camera_t::lf"]
        [::std::mem::offset_of!(libraw_custom_camera_t, lf) - 12usize];
    ["Offset of field: libraw_custom_camera_t::cf"]
        [::std::mem::offset_of!(libraw_custom_camera_t, cf) - 14usize];
    ["Offset of field: libraw_custom_camera_t::max"]
        [::std::mem::offset_of!(libraw_custom_camera_t, max) - 15usize];
    ["Offset of field: libraw_custom_camera_t::flags"]
        [::std::mem::offset_of!(libraw_custom_camera_t, flags) - 16usize];
    ["Offset of field: libraw_custom_camera_t::t_make"]
        [::std::mem::offset_of!(libraw_custom_camera_t, t_make) - 17usize];
    ["Offset of field: libraw_custom_camera_t::t_model"]
        [::std::mem::offset_of!(libraw_custom_camera_t, t_model) - 27usize];
    ["Offset of field: libraw_custom_camera_t::offset"]
        [::std::mem::offset_of!(libraw_custom_camera_t, offset) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_data_t {
    pub image: *mut [ushort; 4usize],
    pub sizes: libraw_image_sizes_t,
    pub idata: libraw_iparams_t,
    pub lens: libraw_lensinfo_t,
    pub makernotes: libraw_makernotes_t,
    pub shootinginfo: libraw_shootinginfo_t,
    pub params: libraw_output_params_t,
    pub rawparams: libraw_raw_unpack_params_t,
    pub progress_flags: ::std::os::raw::c_uint,
    pub process_warnings: ::std::os::raw::c_uint,
    pub color: libraw_colordata_t,
    pub other: libraw_imgother_t,
    pub thumbnail: libraw_thumbnail_t,
    pub thumbs_list: libraw_thumbnail_list_t,
    pub rawdata: libraw_rawdata_t,
    pub parent_class: *mut ::std::os::raw::c_void,
}
